package com.joyintech.service.report.regulatoryreporting.common.constant;

import java.math.BigDecimal;
import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

import com.joyintech.framework.base.BaseDictCodeList;
import com.joyintech.framework.select.SelectOptionDto;
import com.joyintech.framework.util.StringUtil;
import com.joyintech.tams.constant.DictCode;

/**
 * 报表数据字典明细枚举
 * <补充产品数据字典没有的枚举值>
 * @author zhangJin
 *
 */
public enum ReportDictCodeList implements BaseDictCodeList {
	分红方式_混合模式(DictCode.分红方式,"03","混合模式"),
	行内资产二级分类_同业存单(DictCode.行内资产二级分类,"01","同业存单"),
	行内资产二级分类_债券(DictCode.行内资产二级分类,"02","债券"),
	行内资产二级分类_理财直接融资工具(DictCode.行内资产二级分类,"03","理财直接融资工具"),
	行内资产二级分类_权益类投资(DictCode.行内资产二级分类,"04","权益类投资"),
	行内资产二级分类_现金及银行存款(DictCode.行内资产二级分类,"05","现金及银行存款"),
	行内资产二级分类_拆放同业及买入返售(DictCode.行内资产二级分类,"06","拆放同业及买入返售"),
	行内资产二级分类_公募基金(DictCode.行内资产二级分类,"07","公募基金"),
	行内资产二级分类_新增可投资资产(DictCode.行内资产二级分类,"08","新增可投资资产"),
	行内资产二级分类_非标准化债权类资产(DictCode.行内资产二级分类,"09","非标准化债权类资产"),
	行内资产二级分类_同业拆入及卖出回购(DictCode.行内资产二级分类,"12","同业拆入及卖出回购"),
	行内资产二级分类_金融衍生品(DictCode.行内资产二级分类,"14","金融衍生品"),
	行内资产二级分类_资产管理产品(DictCode.行内资产二级分类,"15","资产管理产品"),
	行内资产二级分类_委外投资_协议方式(DictCode.行内资产二级分类,"16","委外投资——协议方式"),
	行内资产二级分类_私募基金(DictCode.行内资产二级分类,"18","私募基金"),
	行内资产三级分类_本行发行的同业存单(DictCode.行内资产三级分类,"01","本行发行的同业存单"),
	行内资产三级分类_他行发行的同业存单(DictCode.行内资产三级分类,"02","他行发行的同业存单"),
	行内资产三级分类_国债(DictCode.行内资产三级分类,"03","国债"),
	行内资产三级分类_地方政府债(DictCode.行内资产三级分类,"04","地方政府债"),
	行内资产三级分类_央票(DictCode.行内资产三级分类,"05","央票"),
	行内资产三级分类_政策性金融债(DictCode.行内资产三级分类,"06","政策性金融债"),
	行内资产三级分类_政府支持机构债券(DictCode.行内资产三级分类,"07","政府支持机构债券"),
	行内资产三级分类_商业性金融债(DictCode.行内资产三级分类,"08","商业性金融债"),
	行内资产三级分类_企业债券(DictCode.行内资产三级分类,"09","企业债券"),
	行内资产三级分类_公司债券(DictCode.行内资产三级分类,"10","公司债券"),
	行内资产三级分类_企业债务融资工具(DictCode.行内资产三级分类,"11","企业债务融资工具"),
	行内资产三级分类_资产支持证券(DictCode.行内资产三级分类,"12","资产支持证券"),
	行内资产三级分类_外国债券(DictCode.行内资产三级分类,"13","外国债券"),
	行内资产三级分类_理财直接融资工具(DictCode.行内资产三级分类,"14","理财直接融资工具"),
	行内资产三级分类_其他理财直接融资工具(DictCode.行内资产三级分类,"15","其他理财直接融资工具"),
	行内资产三级分类_股票_一级市场(DictCode.行内资产三级分类,"16","股票（一级市场）"),
	行内资产三级分类_现金及活期存款(DictCode.行内资产三级分类,"17","现金及活期存款"),
	行内资产三级分类_本行存款(DictCode.行内资产三级分类,"18","本行存款"),
	行内资产三级分类_他行存款(DictCode.行内资产三级分类,"19","他行存款"),
	行内资产三级分类_本行发行的大额存单(DictCode.行内资产三级分类,"20","本行发行的大额存单"),
	行内资产三级分类_他行发行的大额存单(DictCode.行内资产三级分类,"21","他行发行的大额存单"),
	行内资产三级分类_拆放同业(DictCode.行内资产三级分类,"22","拆放同业"),
	行内资产三级分类_债券基金(DictCode.行内资产三级分类,"23","债券基金"),
	行内资产三级分类_货币市场基金(DictCode.行内资产三级分类,"24","货币市场基金"),
	行内资产三级分类_股票基金(DictCode.行内资产三级分类,"25","股票基金"),
	行内资产三级分类_基金中基金(DictCode.行内资产三级分类,"26","基金中基金"),
	行内资产三级分类_混合基金(DictCode.行内资产三级分类,"27","混合基金"),
	行内资产三级分类_其他公募基金(DictCode.行内资产三级分类,"28","其他公募基金"),
	行内资产三级分类_信贷资产流转项目(DictCode.行内资产三级分类,"29","信贷资产流转项目"),
	行内资产三级分类_其他新增可投资资产30(DictCode.行内资产三级分类,"30","其他新增可投资资产"),
	行内资产三级分类_其他新增可投资资产300(DictCode.行内资产三级分类,"300","其他新增可投资资产"),
	行内资产三级分类_票据类(DictCode.行内资产三级分类,"31","票据类"),
	行内资产三级分类_信用证(DictCode.行内资产三级分类,"32","信用证"),
	行内资产三级分类_信托贷款(DictCode.行内资产三级分类,"33","信托贷款"),
	行内资产三级分类_委托贷款(DictCode.行内资产三级分类,"34","委托贷款"),
	行内资产三级分类_信贷资产转让(DictCode.行内资产三级分类,"35","信贷资产转让"),
	行内资产三级分类_收_受益权(DictCode.行内资产三级分类,"36","收/受益权"),
	行内资产三级分类_委托债权(DictCode.行内资产三级分类,"37","委托债权"),
	行内资产三级分类_应收账款(DictCode.行内资产三级分类,"38","应收账款"),
	行内资产三级分类_带回购条款的股权性融资(DictCode.行内资产三级分类,"39","带回购条款的股权性融资"),
	行内资产三级分类_债权融资类产品(DictCode.行内资产三级分类,"40","债权融资类产品"),
	行内资产三级分类_其他非标准化债权类投资(DictCode.行内资产三级分类,"41","其他非标准化债权类投资"),
	行内资产三级分类_股权(DictCode.行内资产三级分类,"42","股权"),
	行内资产三级分类_其他权益类投资(DictCode.行内资产三级分类,"43","其他权益类投资"),
	行内资产三级分类_买入返售(DictCode.行内资产三级分类,"44","买入返售"),
	行内资产三级分类_卖出回购(DictCode.行内资产三级分类,"45","卖出回购"),
	行内资产三级分类_同业拆入(DictCode.行内资产三级分类,"46","同业拆入"),
	行内资产三级分类_股票_二级市场(DictCode.行内资产三级分类,"47","股票（二级市场）"),
	行内资产三级分类_互换(DictCode.行内资产三级分类,"48","互换"),
	行内资产三级分类_远期(DictCode.行内资产三级分类,"49","远期"),
	行内资产三级分类_债券借贷(DictCode.行内资产三级分类,"50","债券借贷"),
	行内资产三级分类_信托产品(DictCode.行内资产三级分类,"51","信托产品"),
	行内资产三级分类_券商资产管理计划(DictCode.行内资产三级分类,"52","券商资产管理计划"),
	行内资产三级分类_基金资产管理计划(DictCode.行内资产三级分类,"53","基金资产管理计划"),
	行内资产三级分类_期货资产管理计划(DictCode.行内资产三级分类,"54","期货资产管理计划"),
	行内资产三级分类_保险资产管理计划(DictCode.行内资产三级分类,"55","保险资产管理计划"),
	行内资产三级分类_其他资产管理计划(DictCode.行内资产三级分类,"56","其他资产管理计划"),
	行内资产三级分类_银行(DictCode.行内资产三级分类,"57","银行"),
	行内资产三级分类_信托公司(DictCode.行内资产三级分类,"58","信托公司"),
	行内资产三级分类_证券公司(DictCode.行内资产三级分类,"59","证券公司"),
	行内资产三级分类_基金公司(DictCode.行内资产三级分类,"60","基金公司"),
	行内资产三级分类_期货公司(DictCode.行内资产三级分类,"61","期货公司"),
	行内资产三级分类_保险公司(DictCode.行内资产三级分类,"62","保险公司"),
	行内资产三级分类_其他(DictCode.行内资产三级分类,"63","其他"),
	行内资产三级分类_信贷资产收益权转让(DictCode.行内资产三级分类,"64","信贷资产收益权转让"),
	行内资产三级分类_小微企业信贷资产流转和收益权转让(DictCode.行内资产三级分类,"65","小微企业信贷资产流转和收益权转让"),
	行内资产三级分类_私募股权投资基金(DictCode.行内资产三级分类,"66","私募股权投资基金"),
	行内资产三级分类_即期(DictCode.行内资产三级分类,"67","即期"),
	行内资产三级分类_掉期(DictCode.行内资产三级分类,"68","掉期"),
	行内资产四级分类_本行发行的同业存单(DictCode.行内资产四级分类,"001","本行发行的同业存单"),
	行内资产四级分类_他行发行的同业存单(DictCode.行内资产四级分类,"002","他行发行的同业存单"),
	行内资产四级分类_国债(DictCode.行内资产四级分类,"003","国债"),
	行内资产四级分类_地方政府债(DictCode.行内资产四级分类,"004","地方政府债"),
	行内资产四级分类_央票(DictCode.行内资产四级分类,"005","央票"),
	行内资产四级分类_政策性金融债(DictCode.行内资产四级分类,"006","政策性金融债"),
	行内资产四级分类_铁道债(DictCode.行内资产四级分类,"007","铁道债"),
	行内资产四级分类_金融债(DictCode.行内资产四级分类,"008","金融债"),
	行内资产四级分类_金融机构次级债(DictCode.行内资产四级分类,"009","金融机构次级债"),
	行内资产四级分类_企业债(DictCode.行内资产四级分类,"010","企业债"),
	行内资产四级分类_可交换债券(DictCode.行内资产四级分类,"011","可交换债券"),
	行内资产四级分类_公司债(DictCode.行内资产四级分类,"012","公司债"),
	行内资产四级分类_可转债(DictCode.行内资产四级分类,"013","可转债"),
	行内资产四级分类_交易所私募债(DictCode.行内资产四级分类,"014","交易所私募债"),
	行内资产四级分类_短融(DictCode.行内资产四级分类,"015","短融"),
	行内资产四级分类_超短融(DictCode.行内资产四级分类,"016","超短融"),
	行内资产四级分类_中票(DictCode.行内资产四级分类,"017","中票"),
	行内资产四级分类_银行间私募债(DictCode.行内资产四级分类,"018","银行间私募债"),
	行内资产四级分类_ABS(DictCode.行内资产四级分类,"019","ABS"),
	行内资产四级分类_外国债券(DictCode.行内资产四级分类,"020","外国债券"),
	行内资产四级分类_理财直接融资工具(DictCode.行内资产四级分类,"021","理财直接融资工具"),
	行内资产四级分类_其他理财直接融资工具(DictCode.行内资产四级分类,"022","其他理财直接融资工具"),
	行内资产四级分类_优先股(DictCode.行内资产四级分类,"023","优先股"),
	行内资产四级分类_现金及活期存款(DictCode.行内资产四级分类,"024","现金及活期存款"),
	行内资产四级分类_本行存款(DictCode.行内资产四级分类,"025","本行存款"),
	行内资产四级分类_协议存款(DictCode.行内资产四级分类,"026","协议存款"),
	行内资产四级分类_同业存款(DictCode.行内资产四级分类,"027","同业存款"),
	行内资产四级分类_其他他行存款(DictCode.行内资产四级分类,"028","其他他行存款"),
	行内资产四级分类_本行发行的大额存单(DictCode.行内资产四级分类,"029","本行发行的大额存单"),
	行内资产四级分类_他行发行的大额存单(DictCode.行内资产四级分类,"030","他行发行的大额存单"),
	行内资产四级分类_同业借款(DictCode.行内资产四级分类,"031","同业借款"),
	行内资产四级分类_债券基金(DictCode.行内资产四级分类,"032","债券基金"),
	行内资产四级分类_货币市场基金(DictCode.行内资产四级分类,"033","货币市场基金"),
	行内资产四级分类_股票基金(DictCode.行内资产四级分类,"034","股票基金"),
	行内资产四级分类_基金中基金(DictCode.行内资产四级分类,"035","基金中基金"),
	行内资产四级分类_保本基金(DictCode.行内资产四级分类,"036","保本基金"),
	行内资产四级分类_其他混合基金(DictCode.行内资产四级分类,"037","其他混合基金"),
	行内资产四级分类_其他公募基金(DictCode.行内资产四级分类,"038","其他公募基金"),
	行内资产四级分类_信贷资产流转项目(DictCode.行内资产四级分类,"039","信贷资产流转项目"),
	行内资产四级分类_信贷资产流转结构化产品(DictCode.行内资产四级分类,"040","信贷资产流转结构化产品"),
	行内资产四级分类_其他信贷资产流转(DictCode.行内资产四级分类,"041","其他信贷资产流转"),
	行内资产四级分类_其他新增可投资资产42(DictCode.行内资产四级分类,"042","其他新增可投资资产"),
	行内资产四级分类_商业承兑汇票(DictCode.行内资产四级分类,"043","商业承兑汇票"),
	行内资产四级分类_银行承兑汇票(DictCode.行内资产四级分类,"044","银行承兑汇票"),
	行内资产四级分类_混合类票据(DictCode.行内资产四级分类,"045","混合类票据"),
	行内资产四级分类_其他票据(DictCode.行内资产四级分类,"046","其他票据"),
	行内资产四级分类_信用证(DictCode.行内资产四级分类,"047","信用证"),
	行内资产四级分类_政府购买服务(DictCode.行内资产四级分类,"048","政府购买服务"),
	行内资产四级分类_PPP(DictCode.行内资产四级分类,"049","PPP"),
	行内资产四级分类_公司客户融资(DictCode.行内资产四级分类,"050","公司客户融资"),
	行内资产四级分类_项目融资(DictCode.行内资产四级分类,"051","项目融资"),
	行内资产四级分类_融贷通(DictCode.行内资产四级分类,"052","融贷通"),
	行内资产四级分类_存单质押(DictCode.行内资产四级分类,"053","存单质押"),
	行内资产四级分类_其他信托贷款(DictCode.行内资产四级分类,"054","其他信托贷款"),
	行内资产四级分类_其他委托贷款(DictCode.行内资产四级分类,"055","其他委托贷款"),
	行内资产四级分类_信贷资产转让(DictCode.行内资产四级分类,"056","信贷资产转让"),
	行内资产四级分类_融资融券收益权(DictCode.行内资产四级分类,"057","融资融券收益权"),
	行内资产四级分类_股票质押收益权(DictCode.行内资产四级分类,"058","股票质押收益权"),
	行内资产四级分类_证券公司收益凭证收_受益权(DictCode.行内资产四级分类,"059","证券公司收益凭证收/受益权"),
	行内资产四级分类_信贷资产转让收_受益权(DictCode.行内资产四级分类,"060","信贷资产转让收/受益权"),
	行内资产四级分类_信托贷款收_受益权(DictCode.行内资产四级分类,"061","信托贷款收/受益权"),
	行内资产四级分类_委托贷款收_受益权(DictCode.行内资产四级分类,"062","委托贷款收/受益权"),
	行内资产四级分类_委托债权收_受益权(DictCode.行内资产四级分类,"063","委托债权收/受益权"),
	行内资产四级分类_私募债权收_受益权(DictCode.行内资产四级分类,"064","私募债权收/受益权"),
	行内资产四级分类_应收账款收_受益权(DictCode.行内资产四级分类,"065","应收账款收/受益权"),
	行内资产四级分类_带回购条款的股权性融资收_受益权(DictCode.行内资产四级分类,"066","带回购条款的股权性融资收/受益权"),
	行内资产四级分类_票据收_受益权(DictCode.行内资产四级分类,"067","票据收/受益权"),
	行内资产四级分类_其他收_受益权(DictCode.行内资产四级分类,"068","其他收/受益权"),
	行内资产四级分类_委托债权(DictCode.行内资产四级分类,"069","委托债权"),
	行内资产四级分类_应收账款(DictCode.行内资产四级分类,"070","应收账款"),
	行内资产四级分类_非产业基金(DictCode.行内资产四级分类,"071","非产业基金"),
	行内资产四级分类_产业基金(DictCode.行内资产四级分类,"072","产业基金"),
	行内资产四级分类_私募债权(DictCode.行内资产四级分类,"073","私募债权"),
	行内资产四级分类_保理(DictCode.行内资产四级分类,"074","保理"),
	行内资产四级分类_股票质押式回购_场内(DictCode.行内资产四级分类,"075","股票质押式回购（场内）"),
	行内资产四级分类_股票质押式回购_场外(DictCode.行内资产四级分类,"076","股票质押式回购（场外）"),
	行内资产四级分类_融资租赁(DictCode.行内资产四级分类,"077","融资租赁"),
	行内资产四级分类_收益凭证(DictCode.行内资产四级分类,"078","收益凭证"),
	行内资产四级分类_收益凭证_OTC(DictCode.行内资产四级分类,"079","收益凭证（OTC）"),
	行内资产四级分类_私募ABS(DictCode.行内资产四级分类,"080","私募ABS"),
	行内资产四级分类_产业基金_股东借款(DictCode.行内资产四级分类,"081","产业基金-股东借款"),
	行内资产四级分类_非产业基金_股东借款(DictCode.行内资产四级分类,"082","非产业基金-股东借款"),
	行内资产四级分类_其他其他非标准划债券类投资(DictCode.行内资产四级分类,"083","其他其他非标准划债券类投资"),
	行内资产四级分类_未上市公司股权(DictCode.行内资产四级分类,"084","未上市公司股权"),
	行内资产四级分类_股票定向增发(DictCode.行内资产四级分类,"085","股票定向增发"),
	行内资产四级分类_夹层(DictCode.行内资产四级分类,"086","夹层"),
	行内资产四级分类_私募股权基金(DictCode.行内资产四级分类,"087","私募股权基金"),
	行内资产四级分类_风险投资(DictCode.行内资产四级分类,"088","风险投资"),
	行内资产四级分类_阳光私募(DictCode.行内资产四级分类,"089","阳光私募"),
	行内资产四级分类_其他其他权益类投资(DictCode.行内资产四级分类,"090","其他其他权益类投资"),
	行内资产四级分类_债券质押式协议回购(DictCode.行内资产四级分类,"091","债券质押式协议回购"),
	行内资产四级分类_债券质押式竞价回购(DictCode.行内资产四级分类,"092","债券质押式竞价回购"),
	行内资产四级分类_债券买断式回购(DictCode.行内资产四级分类,"093","债券买断式回购"),
	行内资产四级分类_其他拆放同业(DictCode.行内资产四级分类,"094","其他拆放同业"),
	行内资产四级分类_普通股(DictCode.行内资产四级分类,"095","普通股"),
	行内资产四级分类_其他股票_一级市场(DictCode.行内资产四级分类,"096","其他股票（一级市场）"),
	行内资产四级分类_员工持股计划(DictCode.行内资产四级分类,"097","员工持股计划"),
	行内资产四级分类_大股东增持(DictCode.行内资产四级分类,"098","大股东增持"),
	行内资产四级分类_其他股票_二级市场(DictCode.行内资产四级分类,"099","其他股票（二级市场）"),
	行内资产四级分类_互换(DictCode.行内资产四级分类,"100","互换"),
	行内资产四级分类_远期(DictCode.行内资产四级分类,"101","远期"),
	行内资产四级分类_债券借贷(DictCode.行内资产四级分类,"102","债券借贷"),
	行内资产四级分类_自主管理(DictCode.行内资产四级分类,"103","自主管理"),
	行内资产四级分类_债券结构化(DictCode.行内资产四级分类,"104","债券结构化"),
	行内资产四级分类_股债混合结构化(DictCode.行内资产四级分类,"105","股债混合结构化"),
	行内资产四级分类_股债混合跟投(DictCode.行内资产四级分类,"106","股债混合跟投"),
	行内资产四级分类_委托投资107(DictCode.行内资产四级分类,"107","委托投资"),
	行内资产四级分类_公募型信托产品(DictCode.行内资产四级分类,"108","公募型信托产品"),
	行内资产四级分类_其他信托产品委托管理(DictCode.行内资产四级分类,"109","其他信托产品委托管理"),
	行内资产四级分类_公募型券商资产管理计划(DictCode.行内资产四级分类,"110","公募型券商资产管理计划"),
	行内资产四级分类_其他券商资产管理计划委托管理(DictCode.行内资产四级分类,"111","其他券商资产管理计划委托管理"),
	行内资产四级分类_其他基金资产管理计划委托管理(DictCode.行内资产四级分类,"112","其他基金资产管理计划委托管理"),
	行内资产四级分类_公募型期货资产管理计划(DictCode.行内资产四级分类,"113","公募型期货资产管理计划"),
	行内资产四级分类_其他期货资产管理计划委托管理(DictCode.行内资产四级分类,"114","其他期货资产管理计划委托管理"),
	行内资产四级分类_公募型保险资产管理计划(DictCode.行内资产四级分类,"115","公募型保险资产管理计划"),
	行内资产四级分类_其他保险资产管理计划委托管理(DictCode.行内资产四级分类,"116","其他保险资产管理计划委托管理"),
	行内资产四级分类_其他资产管理计划委托管理(DictCode.行内资产四级分类,"117","其他资产管理计划委托管理"),
	行内资产四级分类_银行(DictCode.行内资产四级分类,"118","银行"),
	行内资产四级分类_信托公司(DictCode.行内资产四级分类,"119","信托公司"),
	行内资产四级分类_证券公司(DictCode.行内资产四级分类,"120","证券公司"),
	行内资产四级分类_其他(DictCode.行内资产四级分类,"124","其他"),
	行内资产四级分类_委托投资125(DictCode.行内资产四级分类,"125","委托投资"),
	行内资产四级分类_政策性金融次级债(DictCode.行内资产四级分类,"126","政策性金融次级债"),
	行内资产四级分类_交易商协会ABN(DictCode.行内资产四级分类,"127","交易商协会ABN"),
	行内资产四级分类_银保监会主管ABS(DictCode.行内资产四级分类,"128","银保监会主管ABS"),
	行内资产四级分类_证监会主管ABS(DictCode.行内资产四级分类,"129","证监会主管ABS"),
	行内资产四级分类_北金所债券资产(DictCode.行内资产四级分类,"130","北金所债券资产"),
	行内资产四级分类_保交所债权资产(DictCode.行内资产四级分类,"131","保交所债权资产"),
	行内资产四级分类_普通股打新(DictCode.行内资产四级分类,"132","普通股打新"),
	行内资产四级分类_其他股票(DictCode.行内资产四级分类,"133","其他股票"),
	行内资产四级分类_股票结构化(DictCode.行内资产四级分类,"134","股票结构化"),
	行内资产四级分类_市场化债转股(DictCode.行内资产四级分类,"135","市场化债转股"),
	行内资产四级分类_其他类基金(DictCode.行内资产四级分类,"136","其他类基金"),
	行内资产四级分类_委托投资137(DictCode.行内资产四级分类,"137","委托投资"),
	行内资产四级分类_委托投资138(DictCode.行内资产四级分类,"138","委托投资"),
	行内资产四级分类_委托投资139(DictCode.行内资产四级分类,"139","委托投资"),
	行内资产四级分类_委托投资140(DictCode.行内资产四级分类,"140","委托投资"),
	行内资产四级分类_即期(DictCode.行内资产四级分类,"141","即期"),
	行内资产四级分类_掉期(DictCode.行内资产四级分类,"142","掉期"),
	行内资产四级分类_其他新增可投资资产301(DictCode.行内资产四级分类,"301","其他新增可投资资产"),
	行内资产五级分类_本行发行的同业存单(DictCode.行内资产五级分类,"001","本行发行的同业存单"),
	行内资产五级分类_他行发行的同业存单(DictCode.行内资产五级分类,"002","他行发行的同业存单"),
	行内资产五级分类_国债(DictCode.行内资产五级分类,"003","国债"),
	行内资产五级分类_地方政府债(DictCode.行内资产五级分类,"004","地方政府债"),
	行内资产五级分类_央票(DictCode.行内资产五级分类,"005","央票"),
	行内资产五级分类_政策性金融债(DictCode.行内资产五级分类,"006","政策性金融债"),
	行内资产五级分类_铁道债(DictCode.行内资产五级分类,"007","铁道债"),
	行内资产五级分类_金融债(DictCode.行内资产五级分类,"008","金融债"),
	行内资产五级分类_金融机构次级债(DictCode.行内资产五级分类,"009","金融机构次级债"),
	行内资产五级分类_企业债(DictCode.行内资产五级分类,"010","企业债"),
	行内资产五级分类_可交换债券(DictCode.行内资产五级分类,"011","可交换债券"),
	行内资产五级分类_公司债(DictCode.行内资产五级分类,"012","公司债"),
	行内资产五级分类_可转债(DictCode.行内资产五级分类,"013","可转债"),
	行内资产五级分类_交易所私募债(DictCode.行内资产五级分类,"014","交易所私募债"),
	行内资产五级分类_短融(DictCode.行内资产五级分类,"015","短融"),
	行内资产五级分类_超短融(DictCode.行内资产五级分类,"016","超短融"),
	行内资产五级分类_中票(DictCode.行内资产五级分类,"017","中票"),
	行内资产五级分类_银行间私募债(DictCode.行内资产五级分类,"018","银行间私募债"),
	行内资产五级分类_ABS(DictCode.行内资产五级分类,"019","ABS"),
	行内资产五级分类_外国债券(DictCode.行内资产五级分类,"020","外国债券"),
	行内资产五级分类_理财直接融资工具(DictCode.行内资产五级分类,"021","理财直接融资工具"),
	行内资产五级分类_其他理财直接融资工具(DictCode.行内资产五级分类,"022","其他理财直接融资工具"),
	行内资产五级分类_优先股(DictCode.行内资产五级分类,"023","优先股"),
	行内资产五级分类_现金及活期存款(DictCode.行内资产五级分类,"024","现金及活期存款"),
	行内资产五级分类_本行存款(DictCode.行内资产五级分类,"025","本行存款"),
	行内资产五级分类_协议存款(DictCode.行内资产五级分类,"026","协议存款"),
	行内资产五级分类_同业存款(DictCode.行内资产五级分类,"027","同业存款"),
	行内资产五级分类_其他他行存款(DictCode.行内资产五级分类,"028","其他他行存款"),
	行内资产五级分类_本行发行的大额存单(DictCode.行内资产五级分类,"029","本行发行的大额存单"),
	行内资产五级分类_他行发行的大额存单(DictCode.行内资产五级分类,"030","他行发行的大额存单"),
	行内资产五级分类_同业借款(DictCode.行内资产五级分类,"031","同业借款"),
	行内资产五级分类_债券基金(DictCode.行内资产五级分类,"032","债券基金"),
	行内资产五级分类_货币市场基金(DictCode.行内资产五级分类,"033","货币市场基金"),
	行内资产五级分类_股票基金(DictCode.行内资产五级分类,"034","股票基金"),
	行内资产五级分类_基金中基金(DictCode.行内资产五级分类,"035","基金中基金"),
	行内资产五级分类_保本基金(DictCode.行内资产五级分类,"036","保本基金"),
	行内资产五级分类_其他混合基金(DictCode.行内资产五级分类,"037","其他混合基金"),
	行内资产五级分类_其他公募基金(DictCode.行内资产五级分类,"038","其他公募基金"),
	行内资产五级分类_信贷资产流转项目(DictCode.行内资产五级分类,"039","信贷资产流转项目"),
	行内资产五级分类_信贷资产流转结构化产品(DictCode.行内资产五级分类,"040","信贷资产流转结构化产品"),
	行内资产五级分类_其他信贷资产流转(DictCode.行内资产五级分类,"041","其他信贷资产流转"),
	行内资产五级分类_其他新增可投资资产42(DictCode.行内资产五级分类,"042","其他新增可投资资产"),
	行内资产五级分类_商业承兑汇票(DictCode.行内资产五级分类,"043","商业承兑汇票"),
	行内资产五级分类_银行承兑汇票(DictCode.行内资产五级分类,"044","银行承兑汇票"),
	行内资产五级分类_混合类票据(DictCode.行内资产五级分类,"045","混合类票据"),
	行内资产五级分类_其他票据(DictCode.行内资产五级分类,"046","其他票据"),
	行内资产五级分类_信用证(DictCode.行内资产五级分类,"047","信用证"),
	行内资产五级分类_政府购买服务(DictCode.行内资产五级分类,"048","政府购买服务"),
	行内资产五级分类_PPP(DictCode.行内资产五级分类,"049","PPP"),
	行内资产五级分类_公司客户融资(DictCode.行内资产五级分类,"050","公司客户融资"),
	行内资产五级分类_项目融资(DictCode.行内资产五级分类,"051","项目融资"),
	行内资产五级分类_融贷通(DictCode.行内资产五级分类,"052","融贷通"),
	行内资产五级分类_存单质押(DictCode.行内资产五级分类,"053","存单质押"),
	行内资产五级分类_其他信托贷款(DictCode.行内资产五级分类,"054","其他信托贷款"),
	行内资产五级分类_其他委托贷款(DictCode.行内资产五级分类,"055","其他委托贷款"),
	行内资产五级分类_信贷资产转让(DictCode.行内资产五级分类,"056","信贷资产转让"),
	行内资产五级分类_融资融券收益权(DictCode.行内资产五级分类,"057","融资融券收益权"),
	行内资产五级分类_股票质押收益权(DictCode.行内资产五级分类,"058","股票质押收益权"),
	行内资产五级分类_证券公司收益凭证收_受益权(DictCode.行内资产五级分类,"059","证券公司收益凭证收/受益权"),
	行内资产五级分类_信贷资产转让收_受益权(DictCode.行内资产五级分类,"060","信贷资产转让收/受益权"),
	行内资产五级分类_信托贷款收_受益权(DictCode.行内资产五级分类,"061","信托贷款收/受益权"),
	行内资产五级分类_委托贷款收_受益权(DictCode.行内资产五级分类,"062","委托贷款收/受益权"),
	行内资产五级分类_委托债权收_受益权(DictCode.行内资产五级分类,"063","委托债权收/受益权"),
	行内资产五级分类_私募债权收_受益权(DictCode.行内资产五级分类,"064","私募债权收/受益权"),
	行内资产五级分类_应收账款收_受益权(DictCode.行内资产五级分类,"065","应收账款收/受益权"),
	行内资产五级分类_带回购条款的股权性融资收_受益权(DictCode.行内资产五级分类,"066","带回购条款的股权性融资收/受益权"),
	行内资产五级分类_票据收_受益权(DictCode.行内资产五级分类,"067","票据收/受益权"),
	行内资产五级分类_其他收_受益权(DictCode.行内资产五级分类,"068","其他收/受益权"),
	行内资产五级分类_委托债权(DictCode.行内资产五级分类,"069","委托债权"),
	行内资产五级分类_应收账款(DictCode.行内资产五级分类,"070","应收账款"),
	行内资产五级分类_其他非产业基金(DictCode.行内资产五级分类,"071","其他非产业基金"),
	行内资产五级分类_其他产业基金(DictCode.行内资产五级分类,"072","其他产业基金"),
	行内资产五级分类_私募债权(DictCode.行内资产五级分类,"073","私募债权"),
	行内资产五级分类_保理(DictCode.行内资产五级分类,"074","保理"),
	行内资产五级分类_股票质押式回购_场内(DictCode.行内资产五级分类,"075","股票质押式回购（场内）"),
	行内资产五级分类_股票质押式回购_场外(DictCode.行内资产五级分类,"076","股票质押式回购（场外）"),
	行内资产五级分类_融资租赁(DictCode.行内资产五级分类,"077","融资租赁"),
	行内资产五级分类_收益凭证(DictCode.行内资产五级分类,"078","收益凭证"),
	行内资产五级分类_收益凭证_OTC(DictCode.行内资产五级分类,"079","收益凭证（OTC）"),
	行内资产五级分类_银登类标准ABS(DictCode.行内资产五级分类,"080","银登类标准ABS"),
	行内资产五级分类_银登非标准ABS(DictCode.行内资产五级分类,"081","银登非标准ABS"),
	行内资产五级分类_其他私募ABS(DictCode.行内资产五级分类,"082","其他私募ABS"),
	行内资产五级分类_其他产业基金_股东借款(DictCode.行内资产五级分类,"083","其他产业基金-股东借款"),
	行内资产五级分类_其他非产业基金_股东借款(DictCode.行内资产五级分类,"084","其他非产业基金-股东借款"),
	行内资产五级分类_其他其他非标准划债券类投资(DictCode.行内资产五级分类,"085","其他其他非标准划债券类投资"),
	行内资产五级分类_股权(DictCode.行内资产五级分类,"086","股权"),
	行内资产五级分类_股票定向增发(DictCode.行内资产五级分类,"087","股票定向增发"),
	行内资产五级分类_夹层(DictCode.行内资产五级分类,"088","夹层"),
	行内资产五级分类_私募股权基金(DictCode.行内资产五级分类,"089","私募股权基金"),
	行内资产五级分类_风险投资(DictCode.行内资产五级分类,"090","风险投资"),
	行内资产五级分类_阳光私募(DictCode.行内资产五级分类,"091","阳光私募"),
	行内资产五级分类_其他其他权益类投资(DictCode.行内资产五级分类,"092","其他其他权益类投资"),
	行内资产五级分类_债券质押式协议回购(DictCode.行内资产五级分类,"093","债券质押式协议回购"),
	行内资产五级分类_债券质押式竞价回购(DictCode.行内资产五级分类,"094","债券质押式竞价回购"),
	行内资产五级分类_债券买断式回购(DictCode.行内资产五级分类,"095","债券买断式回购"),
	行内资产五级分类_其他拆放同业(DictCode.行内资产五级分类,"096","其他拆放同业"),
	行内资产五级分类_普通股(DictCode.行内资产五级分类,"097","普通股"),
	行内资产五级分类_其他股票_一级市场(DictCode.行内资产五级分类,"098","其他股票（一级市场）"),
	行内资产五级分类_员工持股计划(DictCode.行内资产五级分类,"099","员工持股计划"),
	行内资产五级分类_大股东增持(DictCode.行内资产五级分类,"100","大股东增持"),
	行内资产五级分类_其他股票_二级市场(DictCode.行内资产五级分类,"101","其他股票（二级市场）"),
	行内资产五级分类_互换(DictCode.行内资产五级分类,"102","互换"),
	行内资产五级分类_远期(DictCode.行内资产五级分类,"103","远期"),
	行内资产五级分类_债券借贷(DictCode.行内资产五级分类,"104","债券借贷"),
	行内资产五级分类_自主管理(DictCode.行内资产五级分类,"105","自主管理"),
	行内资产五级分类_债券结构化(DictCode.行内资产五级分类,"106","债券结构化"),
	行内资产五级分类_股债混合结构化(DictCode.行内资产五级分类,"107","股债混合结构化"),
	行内资产五级分类_股债混合跟投(DictCode.行内资产五级分类,"108","股债混合跟投"),
	行内资产五级分类_债券配置增强策略委托投资(DictCode.行内资产五级分类,"109","债券配置增强策略委托投资"),
	行内资产五级分类_可交换债策略委托投资(DictCode.行内资产五级分类,"110","可交换债策略委托投资"),
	行内资产五级分类_保本策略委托投资(DictCode.行内资产五级分类,"111","保本策略委托投资"),
	行内资产五级分类_IPO打新策略委托投资(DictCode.行内资产五级分类,"112","IPO打新策略委托投资"),
	行内资产五级分类_股票定增池策略委托投资(DictCode.行内资产五级分类,"113","股票定增池策略委托投资"),
	行内资产五级分类_国债期货套保套利策略委托投资(DictCode.行内资产五级分类,"114","国债期货套保套利策略委托投资"),
	行内资产五级分类_量化策略委托投资(DictCode.行内资产五级分类,"115","量化策略委托投资"),
	行内资产五级分类_港股通配置策略(DictCode.行内资产五级分类,"116","港股通配置策略"),
	行内资产五级分类_海外债策略委托投资(DictCode.行内资产五级分类,"117","海外债策略委托投资"),
	行内资产五级分类_其他境外投资策略委托投资(DictCode.行内资产五级分类,"118","其他境外投资策略委托投资"),
	行内资产五级分类_其他策略委托投资(DictCode.行内资产五级分类,"119","其他策略委托投资"),
	行内资产五级分类_混合多策略委托投资(DictCode.行内资产五级分类,"120","混合多策略委托投资"),
	行内资产五级分类_公募型券商资产管理计划(DictCode.行内资产五级分类,"124","公募型券商资产管理计划"),
	行内资产五级分类_其他券商资产管理计划委托管理(DictCode.行内资产五级分类,"125","其他券商资产管理计划委托管理"),
	行内资产五级分类_其他基金资产管理计划委托管理(DictCode.行内资产五级分类,"126","其他基金资产管理计划委托管理"),
	行内资产五级分类_公募型期货资产管理计划(DictCode.行内资产五级分类,"127","公募型期货资产管理计划"),
	行内资产五级分类_其他期货资产管理计划委托管理(DictCode.行内资产五级分类,"128","其他期货资产管理计划委托管理"),
	行内资产五级分类_公募型保险资产管理计划(DictCode.行内资产五级分类,"129","公募型保险资产管理计划"),
	行内资产五级分类_其他保险资产管理计划委托管理(DictCode.行内资产五级分类,"130","其他保险资产管理计划委托管理"),
	行内资产五级分类_其他资产管理计划委托管理(DictCode.行内资产五级分类,"131","其他资产管理计划委托管理"),
	行内资产五级分类_银行(DictCode.行内资产五级分类,"132","银行"),
	行内资产五级分类_信托公司(DictCode.行内资产五级分类,"133","信托公司"),
	行内资产五级分类_证券公司(DictCode.行内资产五级分类,"134","证券公司"),
	行内资产五级分类_基金公司(DictCode.行内资产五级分类,"135","基金公司"),
	行内资产五级分类_期货公司(DictCode.行内资产五级分类,"136","期货公司"),
	行内资产五级分类_保险公司(DictCode.行内资产五级分类,"137","保险公司"),
	行内资产五级分类_其他(DictCode.行内资产五级分类,"138","其他"),
	行内资产五级分类_交易商协会ABN(DictCode.行内资产五级分类,"139","交易商协会ABN"),
	行内资产五级分类_银保监会主管ABS(DictCode.行内资产五级分类,"140","银保监会主管ABS"),
	行内资产五级分类_证监会主管ABS(DictCode.行内资产五级分类,"141","证监会主管ABS"),
	行内资产五级分类_上市银行优先股(DictCode.行内资产五级分类,"142","上市银行优先股"),
	行内资产五级分类_非上市银行优先股(DictCode.行内资产五级分类,"143","非上市银行优先股"),
	行内资产五级分类_组合分级产品(DictCode.行内资产五级分类,"144","组合分级产品"),
	行内资产五级分类_债权融资计划(DictCode.行内资产五级分类,"145","债权融资计划"),
	行内资产五级分类_应收账款债权融资计划(DictCode.行内资产五级分类,"146","应收账款债权融资计划"),
	行内资产五级分类_永续债权融资计划(DictCode.行内资产五级分类,"147","永续债权融资计划"),
	行内资产五级分类_委托债权计划(DictCode.行内资产五级分类,"148","委托债权计划"),
	行内资产五级分类_保险债权投资计划(DictCode.行内资产五级分类,"149","保险债权投资计划"),
	行内资产五级分类_资产支持计划(DictCode.行内资产五级分类,"150","资产支持计划"),
	行内资产五级分类_其他债权投资(DictCode.行内资产五级分类,"151","其他债权投资"),
	行内资产五级分类_未上市公司股权(DictCode.行内资产五级分类,"152","未上市公司股权"),
	行内资产五级分类_普通股打新(DictCode.行内资产五级分类,"153","普通股打新"),
	行内资产五级分类_其他股票(DictCode.行内资产五级分类,"154","其他股票"),
	行内资产五级分类_股票结构化(DictCode.行内资产五级分类,"155","股票结构化"),
	行内资产五级分类_市场化债转股(DictCode.行内资产五级分类,"156","市场化债转股"),
	行内资产五级分类_产业基金(DictCode.行内资产五级分类,"157","产业基金"),
	行内资产五级分类_政策性金融次级债(DictCode.行内资产五级分类,"158","政策性金融次级债"),
	行内资产五级分类_即期(DictCode.行内资产五级分类,"159","即期"),
	行内资产五级分类_掉期(DictCode.行内资产五级分类,"160","掉期"),
	行内资产五级分类_其他新增可投资资产302(DictCode.行内资产五级分类,"302","其他新增可投资资产"),

;
    /**
     * 对应于数据字典code
     */
    private String value;

    /**
     * 数据字典枚举
     */
    private DictCode dictCode;

    /**
     * 明细名称
     */
    private String codeName;

    ReportDictCodeList(DictCode dictCode, String value, String codeName) {
        this.dictCode = dictCode;
        this.value = value;
        this.setCodeName(codeName);
    }

    /**
     * 获得数据字典详细类
     *
     * @param value 数据字典值
     * @param dictCode 数据字典DictCode
     * @return DictCodeList
     * @see
     * @since 1.0
     */
    public static ReportDictCodeList from(DictCode dictCode, String value) {
        ReportDictCodeList[] values = ReportDictCodeList.values();
        for (ReportDictCodeList code : values) {
            if (StringUtil.equals(value, code.getValue()) && code.getDictCode() == dictCode) {
                return code;
            }
        }
        return null;
    }

    /**
     * 转换成DICTCODELIST
     * @param dictCodeListExt2
     * @return
     */
    public static Map<String,Object> fromDictCodeList(ReportDictCodeList dictCodeListExt2){
        Map<String,Object> retMap=new HashMap<String,Object>();
        retMap.put("codeName",dictCodeListExt2.codeName);
        retMap.put("value",dictCodeListExt2.value);
        retMap.put("dictCode",dictCodeListExt2.dictCode);
        return retMap;
    }
    /**
     * 获取数据字典明细List
     *
     * @param dictCode DictCode
     * @return List&lt;SelectOptionDto&gt;
     * @see
     * @since 1.0
     */
    public static List<SelectOptionDto> fromDictCode(DictCode dictCode) {
        List<SelectOptionDto> result = new ArrayList<>();
        ReportDictCodeList[] values = ReportDictCodeList.values();
        for (ReportDictCodeList code : values) {
            if (code.getDictCode() == dictCode) {
                SelectOptionDto option = new SelectOptionDto();
                option.setId(code.getValue());
                option.setText(code.getCodeName());
                result.add(option);
            }
        }
        return result;
    }

    /**
     * 获取数据字典明细valueList
     *
     * @param dictCode DictCode
     * @return List&lt;SelectOptionDto&gt;
     * @see
     * @since 1.0
     */
    public static List<String> valuesfromDictCode(DictCode dictCode) {
        List<String> result = new ArrayList<>();
        ReportDictCodeList[] values = ReportDictCodeList.values();
        for (ReportDictCodeList code : values) {
            if (code.getDictCode() == dictCode) {
                result.add(code.getValue());
            }
        }
        return result;
    }

    /**
     * 获取 DictCode
     *
     * @return value.
     */
    @Override
    public DictCode getDictCode() {
        return dictCode;
    }

    /**
     * 获取 value
     *
     * @return value.
     */
    @Override
    public String getValue() {
        return value;
    }

    /**
     * 设置 value
     *
     * @param value value
     */
    @Override
    public void setValue(String value) {
        this.value = value;
    }

    /**
     * 获取 codeName
     *
     * @return codeName.
     */
    @Override
    public String getCodeName() {
        return codeName;
    }

    /**
     * 获取 带有引号的名称
     *
     * @return 带有引号的名称.
     */
    public String getQuotesCodeName() {
        return "“" + codeName + "”";
    }

    /**
     * 获取Integer value
     *
     * @return Integer value
     */
    public Integer getIntegerCodeName() {
        Integer result = null;
        try {
            result = Integer.parseInt(codeName);
        }
        catch (Exception e) {
        }
        return result;
    }

    /**
     * 获取Integer value
     *
     * @return Integer value
     */
    public BigDecimal getBigDecimalCodeName() {
        BigDecimal result = null;
        try {
            result = new BigDecimal(codeName);
        }
        catch (Exception e) {
        }
        return result;
    }

    /**
     * 设置 codeName
     *
     * @param codeName codeName
     */
    @Override
    public void setCodeName(String codeName) {
        this.codeName = codeName;
    }
}
