-- 执行建表脚本的方法（假设某盘符到 \主产品\脚本\2.1.3.3\移动APP页面配置脚本是DIR）：
@DIR\建表脚本\Tm_App_Audit_Tab_Confit.sql;
@DIR\建表脚本\Tm_App_Audit_Tab_Detail.sql;
@DIR\建表脚本\Tm_App_Audit_Type_Confit.sql;
@DIR\建表脚本\TM_APP_TOKEN.sql;


-- 执行业务类型脚本的方法（假设某盘符到 \主产品\脚本\2.1.3.3\移动APP页面配置脚本是DIR）：
@DIR\业务类型脚本\DVP资金调拨.sql;
@DIR\业务类型脚本\拆借存续期.sql;
@DIR\业务类型脚本\拆借交易.sql;
@DIR\业务类型脚本\拆借指令.sql;
@DIR\业务类型脚本\存款类标的.sql;
@DIR\业务类型脚本\存款类存续期.sql;
@DIR\业务类型脚本\存款类指令.sql;
@DIR\业务类型脚本\存款类交易.sql;
@DIR\业务类型脚本\公募基金交易.sql;
@DIR\业务类型脚本\公墓基金指令.sql;
@DIR\业务类型脚本\机构名称授信.sql;
@DIR\业务类型脚本\机构授信.sql;
@DIR\业务类型脚本\计划类货币型存续期.sql;
@DIR\业务类型脚本\计划类货币型交易.sql;
@DIR\业务类型脚本\计划类货币型指令.sql;
@DIR\业务类型脚本\计划类净值型存续期.sql;
@DIR\业务类型脚本\计划类净值型交易.sql;
@DIR\业务类型脚本\计划类净值型指令.sql;
@DIR\业务类型脚本\计划类利率型存续期.sql;
@DIR\业务类型脚本\计划类利率型交易.sql;
@DIR\业务类型脚本\计划类利率型指令.sql;
@DIR\业务类型脚本\计划类资产行情信息.sql;
@DIR\业务类型脚本\交易对手管理.sql;
@DIR\业务类型脚本\买断式回购交易.sql;
@DIR\业务类型脚本\授权管理.sql;
@DIR\业务类型脚本\通道资金划拨管理.sql;
@DIR\业务类型脚本\项目类标的.sql;
@DIR\业务类型脚本\项目类资产存续期.sql;
@DIR\业务类型脚本\项目类资产交易.sql;
@DIR\业务类型脚本\项目类资产指令.sql;
@DIR\业务类型脚本\银证转账管理.sql;
@DIR\业务类型脚本\债券标的.sql;
@DIR\业务类型脚本\债券存续期.sql;
@DIR\业务类型脚本\债券二级交易.sql;
@DIR\业务类型脚本\债券二级指令.sql;
@DIR\业务类型脚本\债券一级指令.sql;
@DIR\业务类型脚本\质押式回购存续期.sql;
@DIR\业务类型脚本\质押式回购交易.sql;
@DIR\业务类型脚本\质押式回购指令.sql;
@DIR\业务类型脚本\自定义现金流.sql;
@DIR\业务类型脚本\组合管理.sql;
 

 