package com.joyintech.tams.disclosure.busicommon.common.constants;

import java.math.BigDecimal;
import java.util.ArrayList;
import java.util.List;

import com.joyintech.framework.base.BaseDictCodeList;
import com.joyintech.framework.select.SelectOptionDto;
import com.joyintech.framework.util.StringUtil;

/**
 * 数据字典明细枚举
 *
 * @author chenzhuo
 * @version 1.0 2016年11月12日
 * @see DictCodeList
 * @since 1.0
 */
public enum DictCodeList implements BaseDictCodeList {
    /**
     * 会计准则_基金
     */
    会计准则_基金(
        DictCode.会计准则, "JJ", "基金准则"
    ),
    /**
     * 会计准则_企业
     */
    会计准则_企业(
        DictCode.会计准则, "QY", "企业准则"
    ),
    /**
     * 会计准则_全部
     */
    会计准则_全部(
        DictCode.会计准则, "ALL", "全部准则"
    ),
    /**
     * 账务记账类型_正常交易
     */
    冲正标识_正常交易(
        DictCode.冲正标识, "01", "正常交易"
    ),
    /**
     * 账务记账类型_冲销交易
     */
    冲正标识_冲销交易(
        DictCode.冲正标识, "02", "冲销交易"
    ),

    会计场景代码_拆入_起息(
        DictCode.会计场景代码, "1201", "拆入-起息"
    ),
    会计场景代码_资金划款_同业借款买入(
            DictCode.会计场景代码, "2727", "资金划款-同业借款买入"
        ),
    会计场景代码_资金收款_同业借款卖出(
            DictCode.会计场景代码, "2728", "资金收款-同业借款卖出"
        ),
    会计场景代码_资金收款_拆入起息(
            DictCode.会计场景代码, "2729", "资金收款-拆入起息"
        ),
    会计场景代码_资金划款_拆入到期(
            DictCode.会计场景代码, "2730", "资金划款-拆入到期"
        ),
    会计场景代码_拆入_利息计提(
        DictCode.会计场景代码, "1202", "拆入-利息计提"
    ),

    会计场景代码_拆入_到期(
        DictCode.会计场景代码, "1203", "拆入-到期"
    ),

    会计场景代码_拆放同业_起息转仓买入(
        DictCode.会计场景代码, "1105", "拆放同业-起息/转仓买入"
    ),

    会计场景代码_拆放同业_计提(
        DictCode.会计场景代码, "1106", "拆放同业-计提"
    ),

    会计场景代码_拆放同业_到期(
        DictCode.会计场景代码, "1107", "拆放同业-到期"
    ),

    会计场景代码_拆放同业_中间收息(
        DictCode.会计场景代码, "1108", "拆放同业-中间收息"
    ),

    会计场景代码_拆放同业_转仓卖出(
        DictCode.会计场景代码, "1109", "拆放同业-转仓卖出"
    ),

    会计场景代码_产品_货币型_认购申购交易(
        DictCode.会计场景代码, "8031", "产品(货币型)-认购申购交易"
    ),

    会计场景代码_产品_货币型_应付利润结转(
        DictCode.会计场景代码, "8032", "产品(货币型)-应付利润结转"
    ),

    会计场景代码_产品_货币型_现金分红(
        DictCode.会计场景代码, "8033", "产品(货币型)-现金分红"
    ),

    会计场景代码_产品_货币型_红利再投(
        DictCode.会计场景代码, "8034", "产品(货币型)-红利再投"
    ),

    会计场景代码_产品_货币型_赎回交易(
        DictCode.会计场景代码, "8035", "产品(货币型)-赎回交易"
    ),

    会计场景代码_产品_货币型_到期分红(
        DictCode.会计场景代码, "8037", "产品(货币型)-到期分红"
    ),

    会计场景代码_产品_净值型_认购申购交易(
        DictCode.会计场景代码, "8011", "产品(净值型)-认购申购交易"
    ),

    会计场景代码_产品_净值型_分红除权处理(
        DictCode.会计场景代码, "8012", "产品(净值型)-分红除权处理"
    ),

    会计场景代码_产品_净值型_现金分红(
        DictCode.会计场景代码, "8013", "产品(净值型)-现金分红"
    ),

    会计场景代码_产品_净值型_红利再投(
        DictCode.会计场景代码, "8014", "产品(净值型)-红利再投"
    ),

    会计场景代码_产品_净值型_赎回到期(
        DictCode.会计场景代码, "8015", "产品(净值型)-赎回到期"
    ),

    会计场景代码_产品_预期收益型_认购申购(
        DictCode.会计场景代码, "8001", "产品(预期收益型)-认购申购"
    ),

    会计场景代码_产品_预期收益型_赎回到期(
        DictCode.会计场景代码, "8002", "产品(预期收益型)-赎回到期"
    ), 会计场景代码_产品_预期收益型_客户计提收益(
        DictCode.会计场景代码, "8004", "产品(预期收益型)-客户计提收益"
    ), 会计场景代码_产品_预期收益型_兑付客户收益(
        DictCode.会计场景代码, "8005", "产品(预期收益型)-兑付客户收益"
    ),

    会计场景代码_产品_销售服务费计提(
        DictCode.会计场景代码, "8101", "产品-销售服务费计提"
    ),

    会计场景代码_产品_销售服务费支付(
        DictCode.会计场景代码, "8102", "产品-销售服务费支付"
    ),

    会计场景代码_产品_固定资产管理费计提(
        DictCode.会计场景代码, "8103", "产品-固定资产管理费计提"
    ),

    会计场景代码_产品_固定资产管理费支付(
        DictCode.会计场景代码, "8104", "产品-固定资产管理费支付"
    ),

    会计场景代码_产品_浮动管理费计提(
        DictCode.会计场景代码, "8105", "产品-浮动管理费计提"
    ),

    会计场景代码_产品_浮动管理费支付(
        DictCode.会计场景代码, "8106", "产品-浮动管理费支付"
    ),

    会计场景代码_产品_托管费计提(
        DictCode.会计场景代码, "8107", "产品-托管费计提"
    ),

    会计场景代码_产品_托管费支付(
        DictCode.会计场景代码, "8108", "产品-托管费支付"
    ),

    会计场景代码_产品_管理费贴补(
        DictCode.会计场景代码, "8109", "产品-管理费贴补"
    ),

    会计场景代码_产品_代销费计提(
        DictCode.会计场景代码, "8110", "产品-代销费计提"
    ),

    会计场景代码_产品_代销费支付(
        DictCode.会计场景代码, "8111", "产品-代销费支付"
    ),

    会计场景代码_产品_外包服务费计提(
        DictCode.会计场景代码, "8112", "产品-外包服务费计提"
    ),

    会计场景代码_产品_外包服务费支付(
        DictCode.会计场景代码, "8113", "产品-外包服务费支付"
    ),

    会计场景代码_产品_其他费用计提(
        DictCode.会计场景代码, "8114", "产品-其他费用计提"
    ),

    会计场景代码_产品_其他费用支付(
        DictCode.会计场景代码, "8115", "产品-其他费用支付"
    ),

    会计场景代码_产品_已实现损益结转(
        DictCode.会计场景代码, "8019", "产品-已实现损益结转"
    ),

    会计场景代码_产品_本期利润已实现结转(
        DictCode.会计场景代码, "8020", "产品-本期利润已实现结转"
    ),

    会计场景代码_产品_未实现损益结转(
        DictCode.会计场景代码, "8021", "产品-未实现损益结转"
    ),

    会计场景代码_产品_未分配利润结转(
        DictCode.会计场景代码, "8022", "产品-未分配利润结转"
    ),

    会计场景代码_产品_损益平准金结转(
        DictCode.会计场景代码, "8023", "产品-损益平准金结转"
    ),

    会计场景代码_产品_本期利润未实现结转(
        DictCode.会计场景代码, "8024", "产品-本期利润未实现结转"
    ),

    会计场景代码_存放同业_起息或买入(
        DictCode.会计场景代码, "1101", "存放同业-起息或买入"
    ),

    会计场景代码_存放同业_利息计提(
        DictCode.会计场景代码, "1102", "存放同业-利息计提"
    ),

    会计场景代码_存放同业_收息(
        DictCode.会计场景代码, "1103", "存放同业-收息"
    ),

    会计场景代码_存放同业_到期或卖出(
        DictCode.会计场景代码, "1104", "存放同业-到期或卖出"
    ),

    会计场景代码_存放同业_还本_到期(
        DictCode.会计场景代码, "1110", "存放同业-还本/到期"
    ),

    会计场景代码_非货币基金及净值型资产_认购申请(
        DictCode.会计场景代码, "1621", "非货币基金及净值型资产-认购申请"
    ),

    会计场景代码_非货币基金及净值型资产_认购确认(
        DictCode.会计场景代码, "1622", "非货币基金及净值型资产-认购确认"
    ),

    会计场景代码_非货币基金及净值型资产_认购返款(
        DictCode.会计场景代码, "1623", "非货币基金及净值型资产-认购返款"
    ),

    会计场景代码_非货币基金及净值型资产_认购返款利息确认(
        DictCode.会计场景代码, "1624", "非货币基金及净值型资产-认购返款利息确认"
    ),

    会计场景代码_非货币基金及净值型资产_申购划款(
        DictCode.会计场景代码, "1625", "非货币基金及净值型资产-申购划款"
    ),

    会计场景代码_非货币基金及净值型资产_申购确认(
        DictCode.会计场景代码, "1626", "非货币基金及净值型资产-申购确认"
    ),

    会计场景代码_非货币基金及净值型资产_申购返款(
        DictCode.会计场景代码, "1627", "非货币基金及净值型资产-申购返款"
    ),

    会计场景代码_非货币基金及净值型资产_转仓买入(
        DictCode.会计场景代码, "1628", "非货币基金及净值型资产-转仓买入"
    ),

    会计场景代码_非货币基金及净值型资产_公允价值变动(
        DictCode.会计场景代码, "1629", "非货币基金及净值型资产-公允价值变动"
    ),

    会计场景代码_非货币基金及净值型资产_分红除权(
        DictCode.会计场景代码, "1631", "非货币基金及净值型资产-分红除权"
    ),

    会计场景代码_非货币基金及净值型资产_现金分红(
        DictCode.会计场景代码, "1632", "非货币基金及净值型资产-现金分红"
    ),

    会计场景代码_非货币基金及净值型资产_红利再投(
        DictCode.会计场景代码, "1633", "非货币基金及净值型资产-红利再投"
    ),

    会计场景代码_非货币基金及净值型资产_赎回确认(
        DictCode.会计场景代码, "1634", "非货币基金及净值型资产-赎回确认"
    ),

    会计场景代码_非货币基金及净值型资产_赎回到账(
        DictCode.会计场景代码, "1635", "非货币基金及净值型资产-赎回到账"
    ),

    会计场景代码_非货币基金及净值型资产_份额调增(
        DictCode.会计场景代码, "1636", "非货币基金及净值型资产-份额调增"
    ),

    会计场景代码_非货币基金及净值型资产_份额调减(
        DictCode.会计场景代码, "1637", "非货币基金及净值型资产-份额调减"
    ),

    会计场景代码_非货币基金及净值型资产_转仓卖出(
        DictCode.会计场景代码, "1638", "非货币基金及净值型资产-转仓卖出"
    ),

    会计场景代码_非货币基金及净值型资产_转换入交易(
        DictCode.会计场景代码, "1639", "非货币基金及净值型资产-转换入交易"
    ),

    会计场景代码_非货币基金及净值型资产_转换出交易(
        DictCode.会计场景代码, "1640", "非货币基金及净值型资产-转换出交易"
    ),

    会计场景代码_非货币基金及净值型资产_转托管交易(
        DictCode.会计场景代码, "1641", "非货币基金及净值型资产-转托管交易"
    ),

    会计场景代码_非货币基金及净值型资产_拆分交易(
        DictCode.会计场景代码, "1642", "非货币基金及净值型资产-拆分交易"
    ),

    会计场景代码_非货币基金及净值型资产_基金合并(
        DictCode.会计场景代码, "1643", "非货币基金及净值型资产-基金合并"
    ),

    会计场景代码_公允价值损益类货币型资产_申购划款(
        DictCode.会计场景代码, "1519", "公允价值损益类货币型资产-申购划款"
    ),

    会计场景代码_公允价值损益类货币型资产_申购确认(
        DictCode.会计场景代码, "1520", "公允价值损益类货币型资产-申购确认"
    ),

    会计场景代码_公允价值损益类货币型资产_转仓买入(
        DictCode.会计场景代码, "1521", "公允价值损益类货币型资产-转仓买入"
    ),

    会计场景代码_公允价值损益类货币型资产_每日计提红利(
        DictCode.会计场景代码, "1522", "公允价值损益类货币型资产-每日计提红利"
    ),

    会计场景代码_公允价值损益类货币型资产_分红除权(
        DictCode.会计场景代码, "1523", "公允价值损益类货币型资产-分红除权"
    ),

    会计场景代码_公允价值损益类货币型资产_红利发放(
        DictCode.会计场景代码, "1524", "公允价值损益类货币型资产-红利发放"
    ),

    会计场景代码_公允价值损益类货币型资产_红利再投(
        DictCode.会计场景代码, "1525", "公允价值损益类货币型资产-红利再投"
    ),

    会计场景代码_公允价值损益类货币型资产_赎回到期(
        DictCode.会计场景代码, "1526", "公允价值损益类货币型资产-赎回/到期"
    ),

    会计场景代码_公允价值损益类货币型资产_到期赎回到账(
        DictCode.会计场景代码, "1527", "公允价值损益类货币型资产-到期/赎回到账"
    ),

    会计场景代码_公允价值损益类货币型资产_卖出转仓(
        DictCode.会计场景代码, "1528", "公允价值损益类货币型资产-卖出转仓"
    ),

    会计场景代码_公允价值损益类净值型资产_申购划款(
        DictCode.会计场景代码, "1508", "公允价值损益类净值型资产-申购划款"
    ),

    会计场景代码_公允价值损益类净值型资产_申购确认(
        DictCode.会计场景代码, "1509", "公允价值损益类净值型资产-申购确认"
    ),

    会计场景代码_公允价值损益类净值型资产_买入(
        DictCode.会计场景代码, "1510", "公允价值损益类净值型资产-买入"
    ),

    会计场景代码_公允价值损益类净值型资产_每日公允价值变动(
        DictCode.会计场景代码, "1511", "公允价值损益类净值型资产-每日公允价值变动"
    ),

    会计场景代码_公允价值损益类净值型资产_分红除权(
        DictCode.会计场景代码, "1513", "公允价值损益类净值型资产-分红除权"
    ),

    会计场景代码_公允价值损益类净值型资产_分红到账(
        DictCode.会计场景代码, "1514", "公允价值损益类净值型资产-分红到账"
    ),

    会计场景代码_公允价值损益类净值型资产_红利再投(
        DictCode.会计场景代码, "1515", "公允价值损益类净值型资产-红利再投"
    ),

    会计场景代码_公允价值损益类净值型资产_赎回(
        DictCode.会计场景代码, "1516", "公允价值损益类净值型资产-赎回"
    ),

    会计场景代码_公允价值损益类净值型资产_赎回到账日(
        DictCode.会计场景代码, "1517", "公允价值损益类净值型资产-赎回到账日"
    ),

    会计场景代码_公允价值损益类净值型资产_卖出到期(
        DictCode.会计场景代码, "1518", "公允价值损益类净值型资产-卖出到期"
    ),

    会计场景代码_公允价值损益类债券_买入(
        DictCode.会计场景代码, "1301", "公允价值损益类债券-买入"
    ),

    会计场景代码_公允价值损益类债券_每日计提(
        DictCode.会计场景代码, "1303", "公允价值损益类债券-每日计提"
    ),

    会计场景代码_公允价值损益类债券_每日公允价值变动(
        DictCode.会计场景代码, "1304", "公允价值损益类债券-每日公允价值变动"
    ),

    会计场景代码_公允价值损益类债券_收息(
        DictCode.会计场景代码, "1306", "公允价值损益类债券-收息"
    ),

    会计场景代码_公允价值损益类债券_卖出(
        DictCode.会计场景代码, "1308", "公允价值损益类债券-卖出"
    ),

    会计场景代码_公允价值损益类债券_还本到期(
        DictCode.会计场景代码, "1309", "公允价值损益类债券-还本到期"
    ),

    会计场景代码_公允价值损益类债券_债券转托管(
        DictCode.会计场景代码, "1310", "公允价值损益类债券-债券转托管"
    ),

    会计场景代码_公允价值损益类债券_债转股(
        DictCode.会计场景代码, "1311", "公允价值损益类债券-债转股"
    ),

    会计场景代码_公允价值损益类债券_上市流通(
        DictCode.会计场景代码, "1332", "公允价值损益类债券-上市流通"
    ),

    会计场景代码_股票投资_买入(
        DictCode.会计场景代码, "2401", "股票投资-买入"
    ),

    会计场景代码_股票投资_红利计提(
        DictCode.会计场景代码, "2402", "股票投资-红利计提"
    ),

    会计场景代码_股票投资_每日公允价值变动(
        DictCode.会计场景代码, "2403", "股票投资-每日公允价值变动"
    ),

    会计场景代码_股票投资_收息(
        DictCode.会计场景代码, "2405", "股票投资-收息"
    ),

    会计场景代码_股票投资_卖出(
        DictCode.会计场景代码, "2406", "股票投资-卖出"
    ),

    会计场景代码_活期存款利息_转仓买入(
        DictCode.会计场景代码, "1003", "活期存款利息-转仓买入"
    ),

    会计场景代码_活期存款利息_计提(
        DictCode.会计场景代码, "1004", "活期存款利息-计提"
    ),

    会计场景代码_活期存款利息_结息(
        DictCode.会计场景代码, "1005", "活期存款利息-结息"
    ),

    会计场景代码_活期存款利息_转仓卖出(
        DictCode.会计场景代码, "1006", "活期存款利息-转仓卖出"
    ),

    会计场景代码_活期存款利息_券商保证金账户收息(
        DictCode.会计场景代码, "2301", "活期存款利息-券商保证金账户收息"
    ),

    会计场景代码_活期存款利息_DVP账户收息(
        DictCode.会计场景代码, "2302", "活期存款利息-DVP账户收息"
    ),

    会计场景代码_货币基金及货币型资产_认购申请(
        DictCode.会计场景代码, "1601", "货币基金及货币型资产-认购申请"
    ),

    会计场景代码_货币基金及货币型资产_认购确认(
        DictCode.会计场景代码, "1602", "货币基金及货币型资产-认购确认"
    ),

    会计场景代码_货币基金及货币型资产_认购返款(
        DictCode.会计场景代码, "1603", "货币基金及货币型资产-认购返款"
    ),

    会计场景代码_货币基金及货币型资产_申购(
        DictCode.会计场景代码, "1604", "货币基金及货币型资产-申购"
    ),

    会计场景代码_货币基金及货币型资产_申购确认(
        DictCode.会计场景代码, "1605", "货币基金及货币型资产-申购确认"
    ),

    会计场景代码_货币基金及货币型资产_转仓买入(
        DictCode.会计场景代码, "1606", "货币基金及货币型资产-转仓买入"
    ),

    会计场景代码_货币基金及货币型资产_每日红利计提(
        DictCode.会计场景代码, "1607", "货币基金及货币型资产-每日红利计提"
    ),

    会计场景代码_货币基金及货币型资产_现金分红(
        DictCode.会计场景代码, "1608", "货币基金及货币型资产-现金分红"
    ),

    会计场景代码_货币基金及货币型资产_红利再投(
        DictCode.会计场景代码, "1609", "货币基金及货币型资产-红利再投"
    ),

    会计场景代码_货币基金及货币型资产_赎回确认(
        DictCode.会计场景代码, "1610", "货币基金及货币型资产-赎回确认"
    ),

    会计场景代码_货币基金及货币型资产_赎回到账(
        DictCode.会计场景代码, "1611", "货币基金及货币型资产-赎回到账"
    ),

    会计场景代码_货币基金及货币型资产_转仓卖出(
        DictCode.会计场景代码, "1612", "货币基金及货币型资产-转仓卖出"
    ),

    会计场景代码_货币基金及货币型资产_申购返款(
        DictCode.会计场景代码, "1613", "货币基金及货币型资产-申购返款"
    ),

    会计场景代码_货币基金及货币型资产_份额调增(
        DictCode.会计场景代码, "1614", "货币基金及货币型资产-份额调增"
    ),

    会计场景代码_货币基金及货币型资产_份额调减(
        DictCode.会计场景代码, "1615", "货币基金及货币型资产-份额调减"
    ),

    会计场景代码_货币基金及货币型资产_返款利息确认(
        DictCode.会计场景代码, "1616", "货币基金及货币型资产-返款利息确认"
    ),

    会计场景代码_货币基金及货币型资产_基金转换入交易(
        DictCode.会计场景代码, "1617", "货币基金及货币型资产-基金转换入交易"
    ),

    会计场景代码_货币基金及货币型资产_基金转换出交易(
        DictCode.会计场景代码, "1618", "货币基金及货币型资产-基金转换出交易"
    ),

    会计场景代码_货币基金及货币型资产_基金拆分(
        DictCode.会计场景代码, "1619", "货币基金及货币型资产-基金拆分"
    ),

    会计场景代码_货币基金及货币型资产_基金合并(
        DictCode.会计场景代码, "1620", "货币基金及货币型资产-基金合并"
    ),

    会计场景代码_利率互换_交易日表外登记(
        DictCode.会计场景代码, "1801", "利率互换-交易日表外登记"
    ),

    会计场景代码_利率互换_每日公允价值变动(
        DictCode.会计场景代码, "1802", "利率互换-每日公允价值变动"
    ),

    会计场景代码_利率互换_期间收取利息(
        DictCode.会计场景代码, "1803", "利率互换-期间收取利息"
    ),

    会计场景代码_利率互换_期间支付利息(
        DictCode.会计场景代码, "1804", "利率互换-期间支付利息"
    ),

    会计场景代码_利率互换_终止到期收取利息(
        DictCode.会计场景代码, "1805", "利率互换-终止到期收取利息"
    ),

    会计场景代码_利率互换_终止到期支付利息(
        DictCode.会计场景代码, "1806", "利率互换-终止到期支付利息"
    ),

    会计场景代码_买断式逆回购_起息(
        DictCode.会计场景代码, "1407", "买断式逆回购-起息"
    ),

    会计场景代码_买断式逆回购_利息计提(
        DictCode.会计场景代码, "1408", "买断式逆回购-利息计提"
    ),

    会计场景代码_买断式逆回购_到期(
        DictCode.会计场景代码, "1409", "买断式逆回购-到期"
    ),

    会计场景代码_买断式逆回购_期间债券还本派息(
        DictCode.会计场景代码, "1413", "买断式逆回购-期间债券还本派息"
    ),

    会计场景代码_买断式正回购_起息(
        DictCode.会计场景代码, "1410", "买断式正回购-起息"
    ),

    会计场景代码_买断式正回购_利息计提(
        DictCode.会计场景代码, "1411", "买断式正回购-利息计提"
    ),

    会计场景代码_买断式正回购_到期(
        DictCode.会计场景代码, "1412", "买断式正回购-到期"
    ),

    会计场景代码_买断式正回购_期间债券还本派息(
        DictCode.会计场景代码, "1414", "买断式正回购-期间债券还本派息"
    ),

    会计场景代码_收益型资产_买入(
        DictCode.会计场景代码, "1501", "收益型资产-买入"
    ),

    会计场景代码_收益型资产_利息计提(
        DictCode.会计场景代码, "1502", "收益型资产-利息计提"
    ),

    会计场景代码_收益型资产_收息(
        DictCode.会计场景代码, "1503", "收益型资产-收息"
    ),

    会计场景代码_收益型资产_还本到期(
        DictCode.会计场景代码, "1504", "收益型资产-还本到期"
    ),

    会计场景代码_收益型资产_卖出(
        DictCode.会计场景代码, "1507", "收益型资产-卖出"
    ),

    会计场景代码_摊余成本类债券_买入(
        DictCode.会计场景代码, "1313", "摊余成本类债券-买入"
    ),

    会计场景代码_摊余成本类债券_每日计提摊销(
        DictCode.会计场景代码, "1314", "摊余成本类债券-每日计提摊销"
    ),

    会计场景代码_摊余成本类债券_收息(
        DictCode.会计场景代码, "1315", "摊余成本类债券-收息"
    ),

    会计场景代码_摊余成本类债券_卖出(
        DictCode.会计场景代码, "1316", "摊余成本类债券-卖出"
    ),

    会计场景代码_摊余成本类债券_还本到期(
        DictCode.会计场景代码, "1317", "摊余成本类债券-还本到期"
    ),

    会计场景代码_摊余成本类债券_债券转托管(
        DictCode.会计场景代码, "1318", "摊余成本类债券-债券转托管"
    ),

    会计场景代码_摊余成本类债券_债转股(
        DictCode.会计场景代码, "1319", "摊余成本类债券-债转股"
    ),

    会计场景代码_摊余成本类债券_上市流通(
        DictCode.会计场景代码, "1333", "摊余成本类债券-上市流通"
    ),

    会计场景代码_通道费_计提(
        DictCode.会计场景代码, "1701", "通道费-计提"
    ),

    会计场景代码_通道费_定期支付(
        DictCode.会计场景代码, "1702", "通道费-定期支付"
    ),

    会计场景代码_通道费_回款时支付(
        DictCode.会计场景代码, "1703", "通道费-回款时支付"
    ),

    会计场景代码_推介费计提(
        DictCode.会计场景代码, "3005", "推介费计提"
    ),

    会计场景代码_费用支付_推介费(
        DictCode.会计场景代码, "3006", "费用支付-推介费"
    ),

    会计场景代码_交易费用支付(
        DictCode.会计场景代码, "3001", "交易费用支付"
    ),

    会计场景代码_交易费用转仓转入(
        DictCode.会计场景代码, "3002", "交易费用转仓转入"
    ),

    会计场景代码_交易费用转仓转出(
        DictCode.会计场景代码, "3004", "交易费用转仓转出"
    ),

    会计场景代码_债券转托管费用支付(
        DictCode.会计场景代码, "3003", "债券转托管费用支付"
    ),

    会计场景代码_外汇损益换汇处理(
        DictCode.会计场景代码, "2101", "外汇损益换汇处理"
    ),

    会计场景代码_外汇掉期_交易日表外登记(
        DictCode.会计场景代码, "2201", "外汇掉期-交易日表外登记"
    ),

    会计场景代码_外汇掉期_每日公允价值变动(
        DictCode.会计场景代码, "2202", "外汇掉期-每日公允价值变动"
    ),

    会计场景代码_外汇掉期_近端交割日资金清算(
        DictCode.会计场景代码, "2204", "外汇掉期-近端交割日资金清算"
    ),

    会计场景代码_外汇掉期_日终汇兑损益确认(
        DictCode.会计场景代码, "2205", "外汇掉期-日终汇兑损益确认"
    ),

    会计场景代码_外汇掉期_远端交割日资金清算(
        DictCode.会计场景代码, "2206", "外汇掉期-远端交割日资金清算"
    ),

    会计场景代码_外汇掉期_远端交割日确认价差收入(
        DictCode.会计场景代码, "2207", "外汇掉期-远端交割日确认价差收入"
    ),

    会计场景代码_外汇掉期_远端交割日结转公允价值变动(
        DictCode.会计场景代码, "2208", "外汇掉期-远端交割日结转公允价值变动"
    ),

    会计场景代码_外汇即期_每日公允价值变动(
        DictCode.会计场景代码, "1901", "外汇即期-每日公允价值变动 "
    ),

    会计场景代码_外汇即期_交割日资金清算(
        DictCode.会计场景代码, "1902", "外汇即期-交割日资金清算"
    ),

    会计场景代码_外汇即期_交割日结转公允价值变动(
        DictCode.会计场景代码, "1903", "外汇即期-交割日结转公允价值变动"
    ),

    会计场景代码_外汇即期_日终汇兑损益确认(
        DictCode.会计场景代码, "1904", "外汇即期-日终汇兑损益确认"
    ),

    会计场景代码_外汇即期_交易日表外登记(
        DictCode.会计场景代码, "1905", "外汇即期-交易日表外登记"
    ),

    会计场景代码_外汇远期_交易日表外登记(
        DictCode.会计场景代码, "1906", "外汇远期-交易日表外登记"
    ),

    会计场景代码_外汇远期_每日公允价值变动(
        DictCode.会计场景代码, "2001", "外汇远期-每日公允价值变动"
    ),

    会计场景代码_外汇远期_交割日资金清算(
        DictCode.会计场景代码, "2003", "外汇远期-交割日资金清算"
    ),

    会计场景代码_外汇远期_交割日结转公允价值变动(
        DictCode.会计场景代码, "2004", "外汇远期-交割日结转公允价值变动"
    ),

    会计场景代码_外汇远期_日终汇兑损益确认(
        DictCode.会计场景代码, "2005", "外汇远期-日终汇兑损益确认"
    ),

    会计场景代码_应收款项转逾期(
        DictCode.会计场景代码, "2801", "应收款项转逾期"
    ),

    会计场景代码_应收款项转仓转入(
        DictCode.会计场景代码, "2802", "应收款项转仓转入"
    ),

    会计场景代码_应收款项转仓转出(
        DictCode.会计场景代码, "2803", "应收款项转仓转出"
    ),

    会计场景代码_逾期款收款(
        DictCode.会计场景代码, "2901", "逾期款收款"
    ),

    会计场景代码_逾期款转入(
        DictCode.会计场景代码, "2902", "逾期款转入"
    ),

    会计场景代码_逾期款转出(
        DictCode.会计场景代码, "2903", "逾期款转出"
    ),

    会计场景代码_增值税估计_直投_利息收入(
        DictCode.会计场景代码, "2601", "增值税估计-直投-利息收入"
    ),

    会计场景代码_增值税估计_通道_利息收入(
        DictCode.会计场景代码, "2602", "增值税估计-通道-利息收入"
    ),

    会计场景代码_增值税估计_直投_红利收入(
        DictCode.会计场景代码, "2603", "增值税估计-直投-红利收入"
    ),

    会计场景代码_增值税估计_通道_红利收入(
        DictCode.会计场景代码, "2604", "增值税估计-通道-红利收入"
    ),

    会计场景代码_增值税估计_直投_公允价值变动损益(
        DictCode.会计场景代码, "2605", "增值税估计-直投-公允价值变动损益"
    ),

    会计场景代码_增值税估计_通道_公允价值变动损益(
        DictCode.会计场景代码, "2606", "增值税估计-通道-公允价值变动损益"
    ),

    会计场景代码_增值税确认_直投_确认利息收入税(
        DictCode.会计场景代码, "2607", "增值税确认-直投-确认利息收入税"
    ),

    会计场景代码_增值税确认_通道_确认利息收入税(
        DictCode.会计场景代码, "2608", "增值税确认-通道-确认利息收入税"
    ),

    会计场景代码_增值税确认_直投_确认价差收入税(
        DictCode.会计场景代码, "2609", "增值税确认-直投-确认价差收入税"
    ),

    会计场景代码_增值税确认_通道_确认价差收入税(
        DictCode.会计场景代码, "2610", "增值税确认-通道-确认价差收入税"
    ),

    会计场景代码_增值税确认_直投_确认红利入税(
        DictCode.会计场景代码, "2611", "增值税确认-直投-确认红利入税"
    ),

    会计场景代码_增值税确认_通道_确认红利入税(
        DictCode.会计场景代码, "2612", "增值税确认-通道-确认红利入税"
    ),

    会计场景代码_增值税估计_附加税(
        DictCode.会计场景代码, "2613", "增值税估计-附加税"
    ),

    会计场景代码_确认增值税附加(
        DictCode.会计场景代码, "2614", "确认增值税附加"
    ),

    会计场景代码_增值税缴纳_交税处理(
        DictCode.会计场景代码, "2615", "增值税缴纳-交税处理"
    ),

    会计场景代码_增值税缴纳_退税处理(
        DictCode.会计场景代码, "2616", "增值税缴纳-退税处理"
    ),

    会计场景代码_增值税计提_直投_应交利息收入税(
        DictCode.会计场景代码, "2618", "增值税计提-直投-应交利息收入税"
    ),

    会计场景代码_增值税计提_通道_应交利息收入税(
        DictCode.会计场景代码, "2619", "增值税计提-通道-应交利息收入税"
    ),

    会计场景代码_增值税计提_直投_应交红利收入税(
        DictCode.会计场景代码, "2620", "增值税计提-直投-应交红利收入税"
    ),

    会计场景代码_增值税计提_通道_应交红利收入税(
        DictCode.会计场景代码, "2621", "增值税计提-通道-应交红利收入税"
    ),

    会计场景代码_债券借贷_借出(
        DictCode.会计场景代码, "2501", "债券借贷-借出"
    ),

    会计场景代码_债券借贷_借出费计提(
        DictCode.会计场景代码, "2502", "债券借贷-借出费计提"
    ),

    会计场景代码_债券借贷_借出期间收息还本(
        DictCode.会计场景代码, "2503", "债券借贷-借出期间收息还本"
    ),

    会计场景代码_债券借贷_借出到期_收取费用(
        DictCode.会计场景代码, "2504", "债券借贷-借出到期-收取费用"
    ),

    会计场景代码_债券借贷_借出到期_现金交割_债券过户(
        DictCode.会计场景代码, "2506", "债券借贷-借出到期-现金交割-债券过户"
    ),

    会计场景代码_债券借贷_借出到期_非现金交割_还券(
        DictCode.会计场景代码, "2507", "债券借贷-借出到期-非现金交割-还券"
    ),

    会计场景代码_债券借贷_借入(
        DictCode.会计场景代码, "2508", "债券借贷-借入"
    ),

    会计场景代码_债券借贷_借入费计提(
        DictCode.会计场景代码, "2509", "债券借贷-借入费计提"
    ),

    会计场景代码_债券借贷_借入期间标的债券收息(
        DictCode.会计场景代码, "2510", "债券借贷-借入期间标的债券收息"
    ),

    会计场景代码_债券借贷_借入期间标的债券付息(
        DictCode.会计场景代码, "2511", "债券借贷-借入期间标的债券付息"
    ),

    会计场景代码_债券借贷_借入到期_支付费用(
        DictCode.会计场景代码, "2512", "债券借贷-借入到期-支付费用"
    ),

    会计场景代码_债券借贷_借入到期_非现金交割_还券(
        DictCode.会计场景代码, "2513", "债券借贷-借入到期-非现金交割-还券"
    ),

    会计场景代码_债券借贷_借入债券卖出(
        DictCode.会计场景代码, "2514", "债券借贷-借入债券卖出"
    ),

    会计场景代码_债券借贷_借入债券利息计提(
        DictCode.会计场景代码, "2515", "债券借贷-借入债券利息计提"
    ),

    会计场景代码_债券借贷_借入券卖出后重估(
        DictCode.会计场景代码, "2516", "债券借贷-借入券卖出后重估"
    ),

    会计场景代码_债券借贷_借入券卖出后收息(
        DictCode.会计场景代码, "2517", "债券借贷-借入券卖出后收息"
    ),

    会计场景代码_债券借贷_借入券卖出后还本付息(
        DictCode.会计场景代码, "2518", "债券借贷-借入券卖出后还本付息"
    ),

    会计场景代码_债券借贷_借入债券卖出后购回(
        DictCode.会计场景代码, "2519", "债券借贷-借入债券卖出后购回"
    ),

    会计场景代码_债券借贷_借入到期_现金交割_还券(
        DictCode.会计场景代码, "2520", "债券借贷-借入到期-现金交割-还券"
    ),

    会计场景代码_债券借贷_融入债券卖出后购回(
        DictCode.会计场景代码, "2521", "债券借贷-融入债券卖出后购回"
    ),

    会计场景代码_债券借贷_融入到期_本方券交割(
        DictCode.会计场景代码, "2522", "债券借贷-融入到期-本方券交割"
    ),

    会计场景代码_债券借贷_融入费计提(
        DictCode.会计场景代码, "2509", "债券借贷-融入费计提"
    ),

    会计场景代码_债券借贷_融出费计提(
        DictCode.会计场景代码, "2502", "债券借贷-融出费计提"
    ),

    会计场景代码_中签交易_信用中签(
        DictCode.会计场景代码, "1330", "中签交易(信用中签)"
    ),

    会计场景代码_承销商买入(
        DictCode.会计场景代码, "1331", "承销商买入"
    ),

    会计场景代码_质押式逆回购_起息(
        DictCode.会计场景代码, "1401", "质押式逆回购-起息"
    ),

    会计场景代码_质押式逆回购_计提(
        DictCode.会计场景代码, "1402", "质押式逆回购-计提"
    ),

    会计场景代码_质押式逆回购_到期(
        DictCode.会计场景代码, "1403", "质押式逆回购-到期"
    ),

    会计场景代码_质押式正回购_起息(
        DictCode.会计场景代码, "1404", "质押式正回购-起息"
    ),

    会计场景代码_质押式正回购_计提(
        DictCode.会计场景代码, "1405", "质押式正回购-计提"
    ),

    会计场景代码_质押式正回购_到期(
        DictCode.会计场景代码, "1406", "质押式正回购-到期"
    ),

    会计场景代码_摊余成本类重分类为损益类(
        DictCode.会计场景代码, "1335", "摊余成本类重分类为损益类"
    ),

    会计场景代码_摊余成本类重分类为综合收益类(
        DictCode.会计场景代码, "1336", "摊余成本类重分类为综合收益类"
    ),

    会计场景代码_综合收益类重分类为摊余成本类(
        DictCode.会计场景代码, "1337", "综合收益类重分类为摊余成本类"
    ),

    会计场景代码_综合收益类重分类为损益类(
        DictCode.会计场景代码, "1338", "综合收益类重分类为损益类"
    ),

    会计场景代码_损益类重分类为摊余成本类(
        DictCode.会计场景代码, "1339", "损益类重分类为摊余成本类"
    ),

    会计场景代码_损益类重分类为综合收益类(
        DictCode.会计场景代码, "1340", "损益类重分类为综合收益类"
    ),

    会计场景代码_银证转账_银转证(
        DictCode.会计场景代码, "1001", "银证转账-银转证"
    ),

    会计场景代码_银证转账_证转银(
        DictCode.会计场景代码, "1002", "银证转账-证转银"
    ),

    会计场景代码_费用支付_交易场所费用支付(
        DictCode.会计场景代码, "1704", "费用支付-交易场所费用支付"
    ),

    会计场景代码_费用支付_其他费用支付_银行手续费(
        DictCode.会计场景代码, "1705", "费用支付-其他费用支付-银行手续费"
    ),

    会计场景代码_费用支付_其他费用支付_其他费用(
        DictCode.会计场景代码, "1706", "费用支付-其他费用支付-其他费用"
    ),

    会计场景代码_资金划款_债券类资产买入(
        DictCode.会计场景代码, "2701", "资金划款-债券类资产买入"
    ),

    会计场景代码_资金收款_债券类资产卖出(
        DictCode.会计场景代码, "2702", "资金收款-债券类资产卖出"
    ),

    会计场景代码_资金收款_摊余成本类债券收息(
        DictCode.会计场景代码, "2703", "资金收款-摊余成本类债券收息"
    ),

    会计场景代码_资金收款_摊余成本类债券还本(
        DictCode.会计场景代码, "2704", "资金收款-摊余成本类债券还本"
    ),

    会计场景代码_资金划款_计划类资产买入(
        DictCode.会计场景代码, "2705", "资金划款-计划类资产买入"
    ),

    会计场景代码_资金收款_计划类资产卖出(
        DictCode.会计场景代码, "2706", "资金收款-计划类资产卖出"
    ),

    会计场景代码_资金收款_公允价值损益类债券收息(
        DictCode.会计场景代码, "2707", "资金收款-公允价值损益类债券收息"
    ),

    会计场景代码_资金收款_公允价值综合收益类债券收息(
        DictCode.会计场景代码, "2708", "资金收款-公允价值综合收益类债券收息"
    ),

    会计场景代码_资金收款_收益型资产收息(
        DictCode.会计场景代码, "2709", "资金收款-收益型资产收息"
    ),

    会计场景代码_资金收款_公允价值损益类债券还本(
        DictCode.会计场景代码, "2710", "资金收款-公允价值损益类债券还本"
    ),

    会计场景代码_资金收款_综合收益类债券还本(
        DictCode.会计场景代码, "2711", "资金收款-综合收益类债券还本"
    ),

    会计场景代码_资金收款_收益型资产还本(
        DictCode.会计场景代码, "2715", "资金收款-收益型资产还本"
    ),

    会计场景代码_资金划款_质押式逆回购首期(
        DictCode.会计场景代码, "2716", "资金划款-质押式逆回购首期"
    ),

    会计场景代码_资金收款_质押式逆回购到期(
        DictCode.会计场景代码, "2717", "资金收款-质押式逆回购到期"
    ),

    会计场景代码_资金收款_质押式正回购首期(
        DictCode.会计场景代码, "2718", "资金收款-质押式正回购首期"
    ),

    会计场景代码_资金划款_质押式正回购到期(
        DictCode.会计场景代码, "2719", "资金划款-质押式正回购到期"
    ),

    会计场景代码_资金划款_买断式逆回购首期(
        DictCode.会计场景代码, "2720", "资金划款-买断式逆回购首期"
    ),

    会计场景代码_资金收款_买断式逆回购期间债券派息(
        DictCode.会计场景代码, "2721", "资金收款-买断式逆回购期间债券派息"
    ),

    会计场景代码_资金收款_买断式逆回购到期(
        DictCode.会计场景代码, "2722", "资金收款-买断式逆回购到期"
    ),

    会计场景代码_资金收款_买断式正回购首期(
        DictCode.会计场景代码, "2723", "资金收款-买断式正回购首期"
    ),

    会计场景代码_资金收款_买断式正回购到期(
        DictCode.会计场景代码, "2724", "资金收款-买断式正回购到期"
    ),

    会计场景代码_资金收款_同业借款还本到期(
        DictCode.会计场景代码, "2725", "资金收款-同业借款还本到期"
    ),

    会计场景代码_资金收款_同业借款中间收息(
        DictCode.会计场景代码, "2726", "资金收款-同业借款中间收息"
    ),

    会计场景代码_资金收款_存放同业到期_卖出(
        DictCode.会计场景代码, "2732", "资金收款-存放同业到期/卖出"
    ),

    会计场景代码_资金收款_存放同业收息(
        DictCode.会计场景代码, "2733", "资金收款-存放同业收息"
    ),

    会计场景代码_资金收款_存放同业还本_到期(
        DictCode.会计场景代码, "2734", "资金收款-存放同业还本/到期"
    ),

    会计场景代码_资金划款_收益型产品赎回到期(
        DictCode.会计场景代码, "8003", "资金划款-收益型产品赎回到期"
    ),

    会计场景代码_资金划款_收益型产品支付客户收益(
        DictCode.会计场景代码, "8006", "资金划款-收益型产品支付客户收益"
    ),

    会计场景代码_资金划款_净值型产品赎回到期(
        DictCode.会计场景代码, "8016", "资金划款-净值型产品赎回到期"
    ),

    会计场景代码_资金划款_货币型产品赎回到期(
        DictCode.会计场景代码, "8036", "资金划款-货币型产品赎回到期"
    ),

    会计场景代码_综合收益类债券_买入(
        DictCode.会计场景代码, "1320", "综合收益类债券-买入"
    ),

    会计场景代码_综合收益类债券_每日计提摊销(
        DictCode.会计场景代码, "1321", "综合收益类债券-每日计提摊销"
    ),

    会计场景代码_综合收益类债券_每日公允价值变动(
        DictCode.会计场景代码, "1322", "综合收益类债券-每日公允价值变动"
    ),

    会计场景代码_综合收益类债券_收息(
        DictCode.会计场景代码, "1324", "综合收益类债券-收息"
    ),

    会计场景代码_综合收益类债券_卖出(
        DictCode.会计场景代码, "1325", "综合收益类债券-卖出"
    ),

    会计场景代码_综合收益类债券_还本到期(
        DictCode.会计场景代码, "1326", "综合收益类债券-还本到期"
    ),

    会计场景代码_综合收益类债券_债券转托管(
        DictCode.会计场景代码, "1327", "综合收益类债券-债券转托管"
    ),

    会计场景代码_综合收益类债券_债转股(
        DictCode.会计场景代码, "1328", "综合收益类债券-债转股"
    ),

    会计场景代码_综合收益类债券_上市流通(
        DictCode.会计场景代码, "1334", "综合收益类债券-上市流通"
    ),

    会计场景代码_公允价值损益类债券_还本付息(
        DictCode.会计场景代码, "9901", "公允价值损益类债券-还本付息"
    ),

    会计场景代码_摊余成本类_还本付息(
        DictCode.会计场景代码, "9902", "摊余成本类-还本付息"
    ),

    会计场景代码_综合收益类债券_还本付息(
        DictCode.会计场景代码, "9903", "综合收益类债券-还本付息"
    ),

    会计场景代码_摊余成本类_计划资产_还本付息(
        DictCode.会计场景代码, "9904", "摊余成本类-计划资产-还本付息"
    ),

    会计场景代码_产品_预期收益型_客户收益计提(
        DictCode.会计场景代码, "8004", "产品_预期收益型_客户收益计提"
    ), 会计场景代码_资金划款_存放同业起息(
        DictCode.会计场景代码, "2731", "资金划款-存放同业起息"
    ),
    会计场景代码_手工凭证(
        DictCode.会计场景代码, "0", "手工凭证"
    ),
    /**
     * 数据类型_下拉框
     */
    数据类型_下拉框(
        DictCode.元素数据类型, "P", "下拉框"
    ),
    /**
     * 数据类型_数值型
     */
    数据类型_数值型(
        DictCode.元素数据类型, "N", "数值型"
    ),
    /**
     * 买入
     */
    交易方向_买入(
        DictCode.交易方向, "T01", "买入"
    ),
    /**
     * 卖出
     */
    交易方向_卖出(
        DictCode.交易方向, "T02", "卖出"
    ),
    /**
     * 行权
     */
    交易方向_行权(
        DictCode.交易方向, "T03", "行权"
    ),
    /**
     * 申购
     */
    交易方向_申购(
        DictCode.交易方向, "T04", "申购"
    ),
    /**
     * 申购确认
     */
    交易方向_申购确认(
        DictCode.交易方向, "T05", "申购确认"
    ),
    /**
     * 赎回
     */
    交易方向_赎回(
        DictCode.交易方向, "T06", "赎回"
    ),
    /**
     * 到期
     */
    交易方向_到期(
        DictCode.交易方向, "T07", "到期"
    ),
    /**
     * 还本
     */
    交易方向_还本(
        DictCode.交易方向, "T08", "还本"
    ),
    /**
     * 收息
     */
    交易方向_收息(
        DictCode.交易方向, "T09", "收息"
    ),
    /**
     * 付费
     */
    交易方向_付费(
        DictCode.交易方向, "T10", "付费"
    ),
    /**
     * 现金分红
     */
    交易方向_现金分红(
        DictCode.交易方向, "T11", "现金分红"
    ),
    /**
     * 红利再投
     */
    交易方向_红利再投(
        DictCode.交易方向, "T12", "红利再投"
    ),
    /**
     * 除权登记
     */
    交易方向_除权登记(
        DictCode.交易方向, "T13", "除权登记"
    ),
    /**
     * 外汇即期
     */
    交易方向_外汇即期(
        DictCode.交易方向, "T14", "外汇即期"
    ),
    /**
     * 外汇远期
     */
    交易方向_外汇远期(
        DictCode.交易方向, "T15", "外汇远期"
    ),
    /**
     * 外汇掉期
     */
    交易方向_外汇掉期(
        DictCode.交易方向, "T16", "外汇掉期"
    ),
    /**
     * 利率互换
     */
    交易方向_利率互换(
        DictCode.交易方向, "T17", "利率互换"
    ),
    /**
     * 认购确认
     */
    交易方向_认购确认(
        DictCode.交易方向, "T18", "认购确认"
    ),
    /**
     * 赎回确认
     */
    交易方向_赎回确认(
        DictCode.交易方向, "T19", "赎回确认"
    ),
    /**
     * 转入
     */
    交易方向_转入(
        DictCode.交易方向, "T20", "转入"
    ),
    /**
     * 转出
     */
    交易方向_转出(
        DictCode.交易方向, "T21", "转出"
    ),
    /**
     * 收息到账
     */
    交易方向_收息到账(
        DictCode.交易方向, "T22", "收息到账"
    ),
    /**
     * 还本到账
     */
    交易方向_还本到账(
        DictCode.交易方向, "T23", "还本到账"
    ),
    /**
     * 赎回到账
     */
    交易方向_赎回到账(
        DictCode.交易方向, "T24", "赎回到账"
    ),
    /**
     * 应收款项转入
     */
    交易方向_应收款项转入(
        DictCode.交易方向, "T25", "应收款项转入"
    ),
    /**
     * 应收款项转出
     */
    交易方向_应收款项转出(
        DictCode.交易方向, "T26", "应收款项转出"
    ),
    /**
     * 卖空债券结息
     */
    交易方向_卖空债券结息(
        DictCode.交易方向, "T30", "卖空债券结息"
    ),
    /**
     * 卖空债券结息
     */
    交易方向_卖空债券还本(
        DictCode.交易方向, "T33", "卖空债券还本"
    ),
    /**
     * 应收款项转出
     */
    交易方向_资产重分类(
        DictCode.交易方向, "T35", "资产重分类"
    ),
    /**
     * 债券借贷本方券交割
     */
    交易方向_债券借贷本方券交割(
        DictCode.交易方向, "T37", "债券借贷本方券交割"
    ),
    /**
     * 产品认购
     */
    交易方向_产品认购(
        DictCode.交易方向, "C1", "产品认购"
    ),
    /**
     * 产品申购
     */
    交易方向_产品申购(
        DictCode.交易方向, "C2", "产品申购"
    ),
    /**
     * 份额强增
     */
    交易方向_份额强增(
        DictCode.交易方向, "C3", "份额强增"
    ),
    /**
     * 产品赎回
     */
    交易方向_产品赎回(
        DictCode.交易方向, "C4", "产品赎回"
    ),
    /**
     * 产品到期
     */
    交易方向_产品到期(
        DictCode.交易方向, "C5", "产品到期"
    ),
    /**
     * 份额强减
     */
    交易方向_份额强减(
        DictCode.交易方向, "C6", "份额强减"
    ),
    /**
     * 中间付息
     */
    交易方向_中间付息(
        DictCode.交易方向, "C7", "中间付息"
    ),
    /**
     * 产品除权登记
     */
    交易方向_产品除权登记(
        DictCode.交易方向, "C8", "产品除权登记"
    ),
    /**
     * 产品现金分红
     */
    交易方向_产品现金分红(
        DictCode.交易方向, "C9", "产品现金分红"
    ),
    /**
     * 产品红利转投
     */
    交易方向_产品红利转投(
        DictCode.交易方向, "C10", "产品红利转投"
    ),
    /**
     * 产品付费
     */
    交易方向_产品付费(
        DictCode.交易方向, "C11", "产品付费"
    ),
    /**
     * 税费缴税
     */
    交易方向_税费缴税(
        DictCode.交易方向, "C12", "税费缴税"
    ),
    /**
     * 附加税费
     */
    交易方向_税费退税(
        DictCode.交易方向, "C13", "税费退税"
    ),
    /**
     * 产品到期分红
     */
    交易方向_产品到期分红(
        DictCode.交易方向, "C14", "产品到期分红"
    ),
    /**
     * 产品到期分红
     */
    交易方向_赎回收益确认(
        DictCode.交易方向, "C15", "赎回收益确认"
    ),
    /*
     * * 融入债券收息
     */
    交易方向_融入债券收息(
        DictCode.交易方向, "T28", "融入债券收息"
    ),
    /**
     * 融入债券利息返还
     */
    交易方向_融入债券利息返还(
        DictCode.交易方向, "T29", "融入债券利息返还"
    ),
    /**
     * 融入债券还本
     */
    交易方向_融入债券还本(
        DictCode.交易方向, "T31", "融入债券还本"
    ),
    /**
     * 融入债券本金返还
     */
    交易方向_融入债券本金返还(
        DictCode.交易方向, "T32", "融入债券本金返还"
    ),
    /**
     * 融入债券卖出
     */
    交易方向_融入债券卖出(
        DictCode.交易方向, "T34", "融入债券卖出"
    ),
    /**
     * 融入债券购回
     */
    交易方向_融入债券购回(
        DictCode.交易方向, "T36", "融入债券购回"
    ),
    /**
     * 行权回售
     */
    交易方向_行权回售(
        DictCode.交易方向, "T39", "行权回售"
    ),
    /**
     * 行权赎回
     */
    交易方向_行权赎回(
        DictCode.交易方向, "T40", "行权赎回"
    ),
    /**
     * 净值
     */
    收益类型_净值(
        DictCode.收益类型, "01", "净值"
    ),
    /**
     * 预期收益
     */
    收益类型_预期收益(
        DictCode.收益类型, "02", "预期收益"
    ),
    /**
     * 货币
     */
    收益类型_货币(
        DictCode.收益类型, "03", "货币"
    ),
    /**
     * ACT/360
     */
    计息基础_A_360(
        DictCode.计息基础, "A/360", "A/360"
    ),
    /**
     * ACT/365
     */
    计息基础_A_365(
        DictCode.计息基础, "A/365", "A/365"
    ),
    /**
     * A/A
     */
    计息基础_A_A_B_COUP(
        DictCode.计息基础, "A/A_B_COUP", "A/A_B_COUP"
    ),
    /**
     * A/A
     */
    计息基础_A_A_B_DAY(
        DictCode.计息基础, "A/A_B_DAY", "A/A_B_DAY"
    ),
    /**
     * A/365F
     */
    计息基础_A_365F(
        DictCode.计息基础, "A/365F", "A/365F"
    ),
    /**
     * 30/360
     */
    计息基础_30_360(
        DictCode.计息基础, "30/360", "30/360"
    ),
    /**
     * 债券类资产_A_A
     */
    计息基础_债券类资产_A_A(
        DictCode.计息基础_债券类资产, "A/A", "A/A"
    ),
    /**
     * 债券类资产_A_360
     */
    计息基础_债券类资产_A_360(
        DictCode.计息基础_债券类资产, "A/360", "A/360"
    ),
    /**
     * 债券类资产_A_365
     */
    计息基础_债券类资产_A_365(
        DictCode.计息基础_债券类资产, "A/365", "A/365"
    ),
    /**
     * 债券类资产_A_365F
     */
    计息基础_债券类资产_A_365F(
        DictCode.计息基础_债券类资产, "A/365F", "A/365F"
    ),
    /**
     * 债券类资产_30_360
     */
    计息基础_债券类资产_30_360(
        DictCode.计息基础_债券类资产, "30/360", "30/360"
    ),

    /**
     * 频率单位_日
     */
    频率单位_日(
        DictCode.频率, "01", "日"
    ),
    /**
     * 频率单位_周
     */
    频率单位_周(
        DictCode.频率, "02", "周"
    ),

    /**
     * 频率单位_月
     */
    频率单位_月(
        DictCode.频率, "03", "月"
    ),
    /**
     * 频率单位_季
     */
    频率单位_季(
        DictCode.频率, "04", "季"
    ),
    /**
     * 频率单位_年
     */
    频率单位_年(
        DictCode.频率, "05", "年"
    ),
    /**
     * 频率单位_半年
     */
    频率单位_半年(
        DictCode.频率, "06", "半年"
    ),
    /**
     * 频率单位_到期一次
     */
    频率单位_到期一次(
        DictCode.频率, "07", "到期一次"
    ),
    /**
     * 频率单位_不规则
     */
    频率单位_不规则(
        DictCode.频率, "08", "不规则"
    ),
    /**
     * 推算方法_起息日向后
     */
    推算方法_起息日向后(
        DictCode.推算方式, "01", "起息日向后"
    ),
    /**
     * 推算方法_到期日向前
     */
    推算方法_到期日向前(
        DictCode.推算方式, "02", "到期日向前"
    ),
    /**
     * 推算方法_首次支付日
     */
    推算方法_首次付息日(
        DictCode.推算方式, "03", "首次支付日"
    ),
    /**
     * 业务类型_拆借交易
     */
    业务类型_拆借交易(
        DictCode.业务类型, "01", "拆借交易"
    ),
    /**
     * 业务类型_债券交易
     */
    业务类型_债券交易(
        DictCode.业务类型, "02", "债券交易"
    ),
    /**
     * 业务类型_存款类资产交易
     */
    业务类型_存款类资产交易(
        DictCode.业务类型, "03", "存款类资产交易"
    ),
    /**
     * 业务类型_债券质押式回购交易
     */
    业务类型_债券质押式回购交易(
        DictCode.业务类型, "04", "债券质押式回购交易"
    ),
    /**
     * 业务类型_债券买断式回购交易
     */
    业务类型_债券买断式回购交易(
        DictCode.业务类型, "05", "债券买断式回购交易"
    ),
    /**
     * 业务类型_货币基金交易
     */
    业务类型_货币基金交易(
        DictCode.业务类型, "06", "货币基金交易（货基、类货基资产交易）"
    ),
    /**
     * 业务类型_非货币基金交易
     */
    业务类型_非货币基金交易(
        DictCode.业务类型, "07", "非货币基金交易（非货基、非类货基资产交易）"
    ),
    /**
     * 业务类型_权益类资产交易
     */
    业务类型_权益类资产交易(
        DictCode.业务类型, "08", "权益类资产交易"
    ),
    /**
     * 业务类型_计划类资产交易
     */
    业务类型_计划类资产交易(
        DictCode.业务类型, "09", "计划类资产交易"
    ),
    /**
     * 业务类型_外汇即期交易
     */
    业务类型_外汇即期交易(
        DictCode.业务类型, "10", "外汇即期交易"
    ),
    /**
     * 业务类型_外汇远期交易
     */
    业务类型_外汇远期交易(
        DictCode.业务类型, "11", "外汇远期交易"
    ),
    /**
     * 业务类型_外汇掉期交易
     */
    业务类型_外汇掉期交易(
        DictCode.业务类型, "12", "外汇掉期交易"
    ),
    /**
     * 业务类型_利率互换交易
     */
    业务类型_利率互换交易(
        DictCode.业务类型, "13", "利率互换交易"
    ),
    /**
     * 业务类型_债券借贷交易
     */
    业务类型_债券借贷交易(
        DictCode.业务类型, "14", "债券借贷交易"
    ),
    /**
     * 业务类型_活期存款交易
     */
    业务类型_活期存款交易(
        DictCode.业务类型, "15", "活期存款交易"
    ),
    /**
     * 业务类型_增值税交易
     */
    业务类型_增值税交易(
        DictCode.业务类型, "16", "增值税交易"
    ),
    /**
     * 业务类型_TA交易
     */
    业务类型_TA交易(
        DictCode.业务类型, "17", "TA交易"
    ),
    /**
     * 业务类型_费用交易
     */
    业务类型_费用交易(
        DictCode.业务类型, "18", "费用交易"
    ),
    /**
     * 指令交易
     */
    业务类型_指令交易(
        DictCode.业务类型, "19", "指令交易"
    ),
    /**
     * 业务类型_预期型TA交易
     */
    业务类型_预期型TA交易(
        DictCode.业务类型, "27", "预期型TA交易"
    ),
    // /**
    // * 交易所债券交易
    // */
    // 业务类型_交易所债券交易(
    // DictCode.业务类型, "20", "交易所债券交易"
    // ),
    /**
     * 货币型TA交易
     */
    业务类型_货币型TA交易(
        DictCode.业务类型, "21", "货币型TA交易"
        ),
    /**
     * 买断式回购预处理
     */
    业务类型_买断式回购预处理(
        DictCode.业务类型, "22", "买断式回购预处理"
        ),
    /**
     * 手工凭证交易
     */
    业务类型_手工凭证交易(
        DictCode.业务类型, "23", "手工凭证交易"
        ),
    /**
     * 债券交易预处理
     */
    业务类型_债券交易预处理(
        DictCode.业务类型, "24", "债券交易预处理"
        ),
    /**
     * 计划类资产预交易
     */
    业务类型_计划类资产预交易(
        DictCode.业务类型, "25", "计划类资产预交易"
        ),
    /**
     * 拆借预交易
     */
    业务类型_拆借预交易(
        DictCode.业务类型, "26", "拆借预交易"
        ),
    /**
     * 存款资产预交易
     */
    业务类型_存款资产预交易(
        DictCode.业务类型, "28", "存款资产预交易"
        ),
    /**
     * 债券借贷标的债券交易
     */
    业务类型_债券借贷标的债券交易(
        DictCode.业务类型, "29", "债券借贷标的债券交易"
        ),
    /**
     * 资产重分类
     */
    业务类型_资产重分类(
        DictCode.业务类型, "30", "资产重分类"
        ),
    /**
     * 账套类别_账套模板
     */
    账套类别_账套模板(
        DictCode.账套类别, "01", "账套模板"
        ),
    /**
     * 账套类别_理财账套
     */
    账套类别_理财账套(
        DictCode.账套类别, "02", "理财账套"
        ),
    /**
     * 金融产品类型_债券
     */
    金融产品类型_债券(
        DictCode.金融产品类型, "F01", "债券"
        ),
    /**
     * 金融产品类型_债券质押式正回购
     */
    金融产品类型_债券质押式正回购(
        DictCode.金融产品类型, "F02", "债券质押式正回购"
        ),
    /**
     * 金融产品类型_债券质押式逆回购
     */
    金融产品类型_债券质押式逆回购(
        DictCode.金融产品类型, "F03", "债券质押式逆回购"
        ),
    /**
     * 金融产品类型_债券买断式正回购
     */
    金融产品类型_债券买断式正回购(
        DictCode.金融产品类型, "F04", "债券买断式正回购"
        ),
    /**
     * 金融产品类型_债券买断式逆回购
     */
    金融产品类型_债券买断式逆回购(
        DictCode.金融产品类型, "F05", "债券买断式逆回购"
        ),
    /**
     * 金融产品类型_基金
     */
    金融产品类型_基金(
        DictCode.金融产品类型, "F06", "基金"
        ),
    /**
     * 金融产品类型_存款
     */
    金融产品类型_存款(
        DictCode.金融产品类型, "F07", "存款"
        ),
    /**
     * 金融产品类型_拆入
     */
    金融产品类型_拆入(
        DictCode.金融产品类型, "F08", "拆入"
        ),
    /**
     * 金融产品类型_拆出
     */
    金融产品类型_拆出(
        DictCode.金融产品类型, "F09", "拆出"
        ),
    /**
     * 金融产品类型_股票
     */
    金融产品类型_股票(
        DictCode.金融产品类型, "F10", "股票"
        ),
    /**
     * 金融产品类型_即期
     */
    金融产品类型_即期(
        DictCode.金融产品类型, "F11", "即期"
        ),
    /**
     * 金融产品类型_远期
     */
    金融产品类型_远期(
        DictCode.金融产品类型, "F12", "远期"
        ),
    /**
     * 金融产品类型_掉期
     */
    金融产品类型_掉期(
        DictCode.金融产品类型, "F13", "掉期"
        ),
    /**
     * 金融产品类型_利率互换
     */
    金融产品类型_利率互换(
        DictCode.金融产品类型, "F14", "利率互换"
        ),
    /**
     * 金融产品类型_债券借贷
     */
    金融产品类型_债券借贷(
        DictCode.金融产品类型, "F15", "债券借贷"
        ),
    /**
     * 金融产品类型_理财产品
     */
    金融产品类型_理财产品(
        DictCode.金融产品类型, "F16", "理财产品"
        ),
    /**
     * 金融产品类型_计划类资产
     */
    金融产品类型_计划类资产(
        DictCode.金融产品类型, "F17", "计划类资产"
        ),
    /**
     * 金融产品类型_投资组合
     */
    金融产品类型_投资组合(
        DictCode.金融产品类型, "F18", "投资组合"
        ),
    /**
     * 金融产品类型_资金账户
     */
    金融产品类型_资金账户(
        DictCode.金融产品类型, "F20", "资金账户"
        ),
    /**
     * 金融产品类型_同业借款
     */
    金融产品类型_同业借款(
        DictCode.金融产品类型, "F21", "同业借款"
        ),
    /**
     * 金融产品类型_理财子产品
     */
    金融产品类型_理财子产品(
        DictCode.金融产品类型, "F22", "理财子产品"
        ),
    /**
     * 金融产品类型_债券借贷融入
     */
    金融产品类型_债券借贷融入(
        DictCode.金融产品类型, "F23", "债券借贷融入"
        ),
    /**
     * 金融产品类型_债券借贷融出
     */
    金融产品类型_债券借贷融出(
        DictCode.金融产品类型, "F24", "债券借贷融出"
        ),
    /**
     * 金融产品类型_融入债券
     */
    金融产品类型_融入债券(
        DictCode.金融产品类型, "F25", "融入债券"
        ),
    /**
     * 金融产品类型_税额
     */
    金融产品类型_税额(
        DictCode.金融产品类型, "C07", "税额"
        ),
    /**
     * 金融产品类型_固定管理费
     */
    金融产品类型_固定管理费(
        DictCode.金融产品类型, "C03", "固定管理费"
        ),
    /**
     * 金融产品类型_浮动管理费
     */
    金融产品类型_浮动管理费(
        DictCode.金融产品类型, "C04", "浮动管理费"
        ),
    /**
     * 金融产品类型_托管费
     */
    金融产品类型_托管费(
        DictCode.金融产品类型, "C05", "托管费"
        ),
    /**
     * 金融产品类型_销售费
     */
    金融产品类型_销售费(
        DictCode.金融产品类型, "C06", "销售费"
        ),
    /**
     * 金融产品类型_其他
     */
    金融产品类型_其他(
        DictCode.金融产品类型, "F19", "其他"
        ),
    /**
     * 金融产品类型_外包服务费
     */
    金融产品类型_外包服务费(
        DictCode.金融产品类型, "C09", "外包服务费"
        ),
    /**
     * 金融产品类型_代销费
     */
    金融产品类型_代销费(
        DictCode.金融产品类型, "C10", "代销费"
        ),
    /**
     * 金融产品类型_交易费用
     */
    金融产品类型_交易费用(
        DictCode.金融产品类型, "C11", "交易费用"
        ),
    /**
     * 业务表_结算指令表
     */
    业务表_结算指令表(
        DictCode.业务表, "01", "结算指令表"
        ),
    /**
     * 业务表_金融产品表
     */
    业务表_金融产品表(
        DictCode.业务表, "02", "金融产品表"
        ),

    /**
     * 余额方向_贷方
     */
    余额方向_贷方(
        DictCode.余额方向, "C", "贷方"
        ),
    /**
     * 余额方向_借方
     */
    余额方向_借方(
        DictCode.余额方向, "D", "借方"
        ),
    /**
     * 余额方向_借贷双方
     */
    余额方向_借贷双方(
        DictCode.余额方向, "B", "借贷双方"
        ),
    /**
     * 借贷方向_贷
     */
    借贷方向_贷(
        DictCode.借贷方向, "C", "贷"
        ),
    /**
     * 借贷方向_借
     */
    借贷方向_借(
        DictCode.借贷方向, "D", "借"
        ),
    /**
     * 匹配类型_任务代码_业务类型
     */
    匹配类型_任务代码_业务类型(
        DictCode.匹配类型, "01", "任务代码_业务类型"
        ),
    /**
     * 匹配类型_任务代码_科目性质
     */
    匹配类型_任务代码_科目性质(
        DictCode.匹配类型, "02", "任务代码_科目性质"
        ),
    /**
     * 匹配类型_任务代码_会计场景
     */
    匹配类型_任务代码_会计场景(
        DictCode.匹配类型, "03", "任务代码_会计场景"
        ),
    /**
     * 任务代码_批处理任务组SEQ
     */
    匹配类型_任务代码_批处理任务组SEQ(
        DictCode.匹配类型, "04", "任务代码_批处理任务组SEQ"
        ),
    /**
     * 匹配类型_任务代码_跑批规则
     */
    匹配类型_任务代码_跑批规则(
        DictCode.匹配类型, "05", "任务代码_跑批规则"
        ),
    /**
     * 匹配类型_任务代码_是否全量
     */
    匹配类型_任务代码_是否全量(
        DictCode.匹配类型, "06", "任务代码_是否全量"
        ),
    /**
     * 匹配类型_任务代码_计提用成本会计场景
     */
    匹配类型_任务代码_计提用成本会计场景(
        DictCode.匹配类型, "07", "任务代码_计提用成本会计场景"
        ),
    /**
     * 匹配类型_任务代码_计提现金流类型
     */
    匹配类型_任务代码_计提现金流类型(
        DictCode.匹配类型, "08", "任务代码_计提现金流类型"
        ),
    /**
     * 匹配类型_任务代码_表分区场景
     */
    匹配类型_任务代码_表分区场景(
        DictCode.匹配类型, "09", "任务代码_表分区场景"
        ),
    /**
     * 是否_是
     */
    是否_是(
        DictCode.是否, "Y", "是"
        ),
    /**
     * 是否_否
     */
    是否_否(
        DictCode.是否, "N", "否"
        ),
    /**
     * 境内外_境内
     */
    境内外_境内(
        DictCode.境内外, "01", "境内"
        ),
    /**
     * 境内外_境外
     */
    境内外_境外(
        DictCode.境内外, "02", "境外"
        ),
    /**
     * 行内行外_行内
     */
    行内行外_行内(
        DictCode.行内行外, "01", "行内"
        ),
    /**
     * 行内行外_行外
     */
    行内行外_行外(
        DictCode.行内行外, "02", "行外"
        ),
    /**
     * 标的_信息
     */
    标的_信息(
        DictCode.标的, "RST_FINPRODUCT", "信息"
        ),
    /**
     * 标的_现金流计划
     */
    标的_现金流计划(
        DictCode.标的, "RST_CASH_PLAN", "现金流计划"
        ),
    /**
     * 标的_现金流支付规则
     */
    标的_现金流支付规则(
        DictCode.标的, "RST_CASH_PAYRULE", "现金流支付规则"
        ),
    /**
     * 标的_现金流计算规则
     */
    标的_现金流计算规则(
        DictCode.标的, "RST_CASH_CALCRULE", "现金流计算规则"
        ),
    /**
     * 标的_业绩报酬计提计划
     */
    标的_业绩报酬计提计划(
        DictCode.标的, "RST_PERF_REWARD_ACCRSCHE", "业绩报酬计提计划"
        ),
    /**
     * 标的_业绩报酬计提规则
     */
    标的_业绩报酬计提规则(
        DictCode.标的, "RST_PERF_REWARD_RULE", "业绩报酬计提规则"
        ),
    /**
     * 标的_业绩报酬计算规则
     */
    标的_业绩报酬计算规则(
        DictCode.标的, "RST_PERF_REWARD_CALC_RULE", "业绩报酬计酸规则"
        ),

    /**
     * 凭证类型_日终
     */
    凭证类型_日终(
        DictCode.凭证类型, "01", "日终"
        ),
    /**
     * 凭证类型_实时
     */
    凭证类型_实时(
        DictCode.凭证类型, "02", "实时"
        ),
    /**
     * 凭证类型_实时
     */
    凭证类型_手工(
        DictCode.凭证类型, "03", "手工"
        ),
    /**
     * 交易状态_初始
     */
    交易状态_初始(
        DictCode.交易状态, "01", "初始"
        ),
    /**
     * 交易状态_修改
     */
    交易状态_修改(
        DictCode.交易状态, "02", "修改"
        ),
    /**
     * 交易状态_撤销
     */
    交易状态_撤销(
        DictCode.交易状态, "03", "撤销"
        ),
    /**
     * 估值方法_市值法
     */
    估值方法_市值法(
        DictCode.估值方法, "01", "市值法"
        ),
    /**
     * 估值方法_成本法
     */
    估值方法_成本法(
        DictCode.估值方法, "02", "成本法"
        ),
    /**
     * 估值方法_市值成本孰低法
     */
    估值方法_市值成本孰低法(
        DictCode.估值方法, "03", "市值成本孰低法"
        ),
    /**
     * 估值方法_摊余成本法
     */
    估值方法_摊余成本法(
        DictCode.估值方法, "04", "摊余成本法"
        ),
    /**
     * 估值市价_收盘价
     */
    估值市价_收盘价(
        DictCode.估值市价, "01", "收盘价"
        ),
    /**
     * 估值市价_平均价
     */
    估值市价_平均价(
        DictCode.估值市价, "02", "平均价"
        ),
    /**
     * 估值市价_最高价
     */
    估值市价_最高价(
        DictCode.估值市价, "03", "最高价"
        ),
    /**
     * 估值市价_最低价
     */
    估值市价_最低价(
        DictCode.估值市价, "04", "最低价"
        ),
    /**
     * 估值市价_买一价
     */
    估值市价_买一价(
        DictCode.估值市价, "05", "买一价"
        ),
    /**
     * 估值市价_卖一价
     */
    估值市价_卖一价(
        DictCode.估值市价, "06", "卖一价"
        ),
    /**
     * 估值市价_管理人报价
     */
    估值市价_管理人报价(
        DictCode.估值市价, "07", "管理人报价"
        ),
    /**
     * 估值市价_中债登
     */
    估值市价_中债登(
        DictCode.估值市价, "CBC", "中债登"
        ),
    /**
     * 估值市价_中证登
     */
    估值市价_中证登(
        DictCode.估值市价, "CSD", "中证登"
        ),
    /**
     * 估值市价_上清所
     */
    估值市价_上清所(
        DictCode.估值市价, "SCH", "上清所"
        ),
    /**
     * 估值日期_行情日_1
     */
    估值日期_行情日减1(
        DictCode.估值日期, "01", "行情日_1"
        ),
    /**
     * 估值日期_行情日
     */
    估值日期_行情日(
        DictCode.估值日期, "02", "行情日"
        ),
    /**
     * 估值日期_行情日+1
     */
    估值日期_行情日加1(
        DictCode.估值日期, "03", "行情日+1"
        ),
    /**
     * 投资目的_以摊余成本计量_AC
     */
    投资目的_以摊余成本计量AC(
        DictCode.投资目的, "AC", "以摊余成本计量（AC）"
        ),
    /**
     * 投资目的_以公允价值计量且其变动计入当期损益_FVTPL
     */
    投资目的_以公允价值计量且其变动计入当期损益FVTPL(
        DictCode.投资目的, "FVTPL", "以公允价值计量且其变动计入当期损益（FVTPL）"
        ),
    /**
     * 投资目的_以公允价值计量且其变动计入其他综合收益_FVOCI
     */
    投资目的_以公允价值计量且其变动计入其他综合收益FVOCI(
        DictCode.投资目的, "FVOCI", "以公允价值计量且其变动计入其他综合收益（FVOCI）"
        ),
    /**
     * 基金类型_货币基金
     */
    基金类型_货币基金(
        DictCode.基金类型, "01", "货币基金"
        ),
    /**
     * 基金类型_债券基金
     */
    基金类型_债券基金(
        DictCode.基金类型, "02", "债券基金"
        ),
    /**
     * 基金类型_股票基金
     */
    基金类型_股票基金(
        DictCode.基金类型, "03", "股票基金"
        ),
    /**
     * 基金类型_混合基金
     */
    基金类型_混合基金(
        DictCode.基金类型, "04", "混合基金"
        ),
    /**
     * 基金类型_其他公募基金
     */
    基金类型_其他公募基金(
        DictCode.基金类型, "05", "其他公募基金"
        ),
    /**
     * 基金类型_私募基金
     */
    基金类型_私募基金(
        DictCode.基金类型, "06", "私募基金"
        ),
    /**
     * 基金类型_ETF指数基金
     */
    基金类型_ETF指数基金(
        DictCode.基金类型, "07", "ETF指数基金"
        ),
    /**
     * 基金类型_LOF
     */
    基金类型_LOF(
        DictCode.基金类型, "08", "LOF"
        ),
    /**
     * 估值交易市场_银行间
     */
    估值交易市场_银行间(
        DictCode.估值交易市场, "01", "银行间"
        ),
    /**
     * 估值交易市场_上交所
     */
    估值交易市场_上交所(
        DictCode.估值交易市场, "03", "上交所"
        ),
    /**
     * 估值交易市场_深交所
     */
    估值交易市场_深交所(
        DictCode.估值交易市场, "04", "深交所"
        ),
    /**
     * 估值交易市场_商业银行柜台交易
     */
    估值交易市场_商业银行柜台交易(
        DictCode.估值交易市场, "02", "商业银行柜台交易"
        ),
    /**
     * 估值交易市场_机构间私募系统
     */
    估值交易市场_机构间私募系统(
        DictCode.估值交易市场, "05", "机构间私募系统"
        ),
    /**
     * 估值交易市场_理财直接融资工具平台
     */
    估值交易市场_理财直接融资工具平台(
        DictCode.估值交易市场, "06", "理财直接融资工具平台"
        ),
    /**
     * 估值交易市场_其他场外
     */
    估值交易市场_其他场外(
        DictCode.估值交易市场, "07", "其他场外"
        ),
    /**
     * 估值交易市场_交易所
     */
    估值交易市场_交易所(
        DictCode.估值交易市场, "08", "交易所"
        ),
    /**
     * 估值交易市场_场外
     */
    估值交易市场_场外(
        DictCode.估值交易市场, "09", "场外"
        ),
    /**
     * 计费基数类型_期初净值
     */
    计费基数类型_期初净值(
        DictCode.基数类型, "01", "期初净值"
        ),
    /**
     * 计费基数类型_期末净值
     */
    计费基数类型_期末净值(
        DictCode.基数类型, "02", "期末净值"
        ),
    /**
     * 计费基数类型_资产净值
     */
    计费基数类型_资产净值(
        DictCode.基数类型, "03", "资产净值"
        ),
    /**
     * 计费基数类型_实收资本
     */
    计费基数类型_实收资本(
        DictCode.基数类型, "04", "实收资本"
        ),
    /**
     * 计费基数类型_净资产
     */
    计费基数类型_净资产(
        DictCode.基数类型, "05", "净资产"
        ),
    /**
     * 计费基数类型_持有份额
     */
    计费基数类型_持有份额(
        DictCode.基数类型, "06", "持有份额"
        ),
    /**
     * 计费基数类型_存续本金
     */
    计费基数类型_存续本金(
        DictCode.基数类型, "07", "存续本金"
        ),
    /**
     * 计费基数类型_资产规模
     */
    计费基数类型_资产规模(
        DictCode.基数类型, "08", "资产规模"
        ),

    /**
     * 息票品种_附息
     */
    息票品种_附息(
        DictCode.息票品种, "01", "附息"
        ),
    /**
     * 息票品种_贴现
     */
    息票品种_贴现(
        DictCode.息票品种, "02", "贴现"
        ),
    /**
     * 息票品种_零息
     */
    息票品种_零息(
        DictCode.息票品种, "03", "零息"
        ),
    /**
     * 息票品种_利随本清
     */
    息票品种_利随本清(
        DictCode.息票品种, "04", "利随本清"
        ),
    /**
     * 利率类型_固定利率
     */
    利率类型_固定利率(
        DictCode.利率类型, "01", "固定利率"
        ),
    /**
     * 利率类型_浮动利率
     */
    利率类型_浮动利率(
        DictCode.利率类型, "02", "浮动利率"
        ),
    /**
     * 计费基数日期类型_当日
     */
    计费基数日期类型_当日(
        DictCode.计费基数日期类型, "01", "当日"
        ),
    /**
     * 计费基数日期类型_前一日
     */
    计费基数日期类型_前一日(
        DictCode.计费基数日期类型, "02", "前一日"
        ),
    /**
     * 计费基数日期类型_前一工作日
     */
    计费基数日期类型_前一工作日(
        DictCode.计费基数日期类型, "03", "前一工作日"
        ),
    /**
     * 计费基数日期类型_上一开放区间结束日
     */
    计费基数日期类型_上一开放区间结束日(
        DictCode.计费基数日期类型, "04", "上一开放区间结束日"
        ),
    /**
     * 一次性费用类型_经手费
     */
    一次性费用类型_经手费(
        DictCode.一次性费用类型, "B01", "经手费"
        ),
    /**
     * 一次性费用类型_印花税
     */
    一次性费用类型_印花税(
        DictCode.一次性费用类型, "B02", "印花税"
        ),
    /**
     * 一次性费用类型_证管费
     */
    一次性费用类型_证管费(
        DictCode.一次性费用类型, "B03", "证管费"
        ),
    /**
     * 一次性费用类型_过户费
     */
    一次性费用类型_过户费(
        DictCode.一次性费用类型, "B04", "过户费"
        ),
    /**
     * 一次性费用类型_佣金
     */
    一次性费用类型_佣金(
        DictCode.一次性费用类型, "B05", "佣金"
        ),
    /**
     * 一次性费用类型_交易手续费
     */
    一次性费用类型_交易手续费(
        DictCode.一次性费用类型, "B06", "交易手续费"
        ),
    /**
     * 一次性费用类型_结算费
     */
    一次性费用类型_结算费(
        DictCode.一次性费用类型, "B07", "结算费"
        ),
    /**
     * 一次性费用类型_结算手续费
     */
    一次性费用类型_结算手续费(
        DictCode.一次性费用类型, "B08", "结算手续费"
        ),
    /**
     * 一次性费用类型_通道费
     */
    一次性费用类型_通道费(
        DictCode.一次性费用类型, "B09", "通道费"
        ),
    /**
     * 一次性费用类型_通道管理费
     */
    一次性费用类型_通道管理费(
        DictCode.一次性费用类型, "B10", "通道管理费"
        ),
    /**
     * 一次性费用类型_通道销售费
     */
    一次性费用类型_通道销售费(
        DictCode.一次性费用类型, "B11", "通道销售费"
        ),
    /**
     * 一次性费用类型_通道托管费
     */
    一次性费用类型_通道托管费(
        DictCode.一次性费用类型, "B12", "通道托管费"
        ),
    /**
     * 一次性费用类型_通道托管费
     */
    一次性费用类型_其他费用(
        DictCode.一次性费用类型, "B99", "其他费用"
        ),
    /**
     * 指令类型_银证转账_银转证
     */
    指令类型_银证转账_银转证(
        DictCode.指令类型, "1001", "银证转账-银转证"
        ),
    /**
     * 指令类型_银证转账_证转银
     */
    指令类型_银证转账_证转银(
        DictCode.指令类型, "1002", "银证转账-证转银"
        ),

    /**
     * 指令类型_活期存款利息_买入
     */
    指令类型_活期存款利息_买入(
        DictCode.指令类型, "N1003", "活期存款利息-买入（转仓）"
        ),
    /**
     * 指令类型_活期存款利息_结息
     */
    指令类型_活期存款利息_结息(
        DictCode.指令类型, "N1005", "活期存款利息-结息"
        ),
    /**
     * 指令类型_活期存款利息_卖出
     */
    指令类型_活期存款利息_卖出(
        DictCode.指令类型, "N1006", "活期存款利息-卖出（转仓）"
        ),

    /**
     * 指令类型_资金交收_债券类资产买入_资金交收日
     */
    指令类型_资金交收_债券类资产买入_资金交收日(
        DictCode.指令类型, "2701", "资金交收-债券类资产买入（资金交收日）"
        ),
    /**
     * 指令类型_资金交收_计划类资产买入_资金交收日
     */
    指令类型_资金交收_计划类资产买入_资金交收日(
        DictCode.指令类型, "2705", "资金交收-计划类资产买入（资金交收日）"
        ),
    /**
     * 指令类型_资金交收_计划类资产卖出_资金到账
     */
    指令类型_资金交收_计划类资产卖出_资金到账(
        DictCode.指令类型, "2706", "资金交收-计划类资产卖出-资金到账"
        ),
    /**
     * 指令类型_资金交收_债券类资产卖出_资金到账
     */
    指令类型_资金交收_债券类资产卖出_资金到账(
        DictCode.指令类型, "2702", "资金交收-债券类资产卖出-资金到账"
        ),

    /**
     * 指令类型_资金交收_质押式逆回购首期_资金到账
     */
    指令类型_资金交收_质押式逆回购首期_资金到账(
        DictCode.指令类型, "2716", "资金交收-质押式逆回购首期-资金到账"
        ),
    /**
     * 指令类型_资金交收_质押式逆回购到期_资金到账
     */
    指令类型_资金交收_质押式逆回购到期_资金到账(
        DictCode.指令类型, "2717", "资金交收-质押式逆回购到期-资金到账"
        ),
    /**
     * 指令类型_资金交收_质押式正回购首期_资金到账
     */
    指令类型_资金交收_质押式正回购首期_资金到账(
        DictCode.指令类型, "2718", "资金交收-质押式正回购首期-资金到账"
        ),
    /**
     * 指令类型_资金交收_质押式正回购到期_资金到账
     */
    指令类型_资金交收_质押式正回购到期_资金到账(
        DictCode.指令类型, "2719", "资金交收-质押式正回购到期-资金到账"
        ),
    /**
     * 指令类型_资金交收_买断式逆回购首期_资金到账
     */
    指令类型_资金交收_买断式逆回购首期_资金到账(
        DictCode.指令类型, "2720", "资金交收-买断式逆回购首期-资金到账"
        ),
    /**
     * 指令类型_资金交收_买断式逆回购派息_资金到账
     */
    指令类型_资金交收_买断式逆回购派息_资金到账(
        DictCode.指令类型, "2721", "资金交收-买断式逆回购派息-资金到账"
        ),
    /**
     * 指令类型_资金交收_买断式逆回购到期_资金到账
     */
    指令类型_资金交收_买断式逆回购到期_资金到账(
        DictCode.指令类型, "2722", "资金交收-买断式逆回购到期-资金到账"
        ),
    /**
     * 指令类型_资金交收_买断式正回购首期_资金到账
     */
    指令类型_资金交收_买断式正回购首期_资金到账(
        DictCode.指令类型, "2723", "资金交收-买断式正回购首期-资金到账"
        ),
    /**
     * 指令类型_资金交收_买断式正回购到期_资金到账
     */
    指令类型_资金交收_买断式正回购到期_资金到账(
        DictCode.指令类型, "2724", "资金交收-买断式正回购到期-资金到账"
        ),
    /**
     * 指令类型_公允价值损益类_货币基金_认购申请
     */
    指令类型_公允价值损益类_货币基金_认购申请(
        DictCode.指令类型, "1601", "公允价值损益类-货币基金-认购申请"
        ),
    /**
     * 指令类型_公允价值损益类_货币基金_认购返款
     */
    指令类型_公允价值损益类_货币基金_认购返款(
        DictCode.指令类型, "1603", "公允价值损益类-货币基金-认购返款"
        ),
    /**
     * 指令类型_公允价值损益类_货币基金_返款利息确认
     */
    指令类型_公允价值损益类_货币基金_返款利息确认(
        DictCode.指令类型, "1616", "公允价值损益类-货币基金-返款利息确认"
        ),
    /**
     * 指令类型_公允价值损益类_货币基金_申购
     */
    指令类型_公允价值损益类_货币基金_申购(
        DictCode.指令类型, "1604", "公允价值损益类-货币基金-申购"
        ),
    /**
     * 指令类型_公允价值损益类_货币基金_申购返款
     */
    指令类型_公允价值损益类_货币基金_申购返款(
        DictCode.指令类型, "1613", "公允价值损益类-货币基金-申购返款"
        ),
    /**
     * 指令类型_公允价值损益类_货币基金_赎回_收款
     */
    指令类型_公允价值损益类_货币基金_赎回_收款(
        DictCode.指令类型, "1611", "公允价值损益类-货币基金-赎回-收款"
        ),
    /**
     * 指令类型_非货币基金_交易性_认购申请
     */
    指令类型_非货币基金_交易性_认购申请(
        DictCode.指令类型, "1621", "非货币基金（交易性）-认购申请"
        ),
    /**
     * 指令类型_非货币基金_交易性_认购返款
     */
    指令类型_非货币基金_交易性_认购返款(
        DictCode.指令类型, "1623", "非货币基金（交易性）-认购返款"
        ),
    /**
     * 指令类型_非货币基金_交易性_返款利息确认
     */
    指令类型_非货币基金_交易性_返款利息确认(
        DictCode.指令类型, "1624", "非货币基金（交易性）-返款利息确认"
        ),
    /**
     * 指令类型_非货币基金_申购划款
     */
    指令类型_非货币基金_申购划款(
        DictCode.指令类型, "1625", "非货币基金-申购划款"
        ),
    /**
     * 指令类型_计划类净值型资产_申购划款
     */
    指令类型_计划类净值型资产_申购划款(
        DictCode.指令类型, "1508", "计划类净值型资产-申购划款"
        ),
    /**
     * 指令类型_非货币基金_交易性_申购返款
     */
    指令类型_非货币基金_交易性_申购返款(
        DictCode.指令类型, "1627", "非货币基金（交易性）-申购返款"
        ),
    /**
     * 指令类型_非货币基金_赎回到账
     */
    指令类型_非货币基金_赎回到账(
        DictCode.指令类型, "1635", "非货币基金-赎回到账"
        ),
    /**
     * 指令类型_计划类净值型资产_赎回到账
     */
    指令类型_计划类净值型资产_赎回到账(
        DictCode.指令类型, "1517", "计划类净值型资产-赎回到账"
        ),
    /**
     * 指令类型_费用支付_交易场所费用支付
     */
    指令类型_费用支付_交易场所费用支付(
        DictCode.指令类型, "1704", "费用支付-交易场所费用支付"
        ),
    /**
     * 指令类型_费用支付_其他费用支付_银行手续费
     */
    指令类型_费用支付_其他费用支付_银行手续费(
        DictCode.指令类型, "1705", "费用支付-其他费用支付-银行手续费"
        ),
    /**
     * 指令类型_费用支付_其他费用支付_其他费用
     */
    指令类型_费用支付_其他费用支付_其他费用(
        DictCode.指令类型, "1706", "费用支付-其他费用支付-其他费用"
        ),
    /**
     * 指令类型_预期收益型产品_产品赎回到期_产品本金交易_支付
     */
    指令类型_预期收益型产品_产品赎回到期_产品本金交易_支付(
        DictCode.指令类型, "8003", "预期收益型产品-产品赎回到期（产品本金交易）-支付"
        ),
    /**
     * 指令类型_预期收益型产品_支付客户收益
     */
    指令类型_预期收益型产品_支付客户收益(
        DictCode.指令类型, "8006", "预期收益型产品-支付客户收益"
        ),
    /**
     * 指令类型_净值型产品_产品赎回到期_支付
     */
    指令类型_净值型产品_产品赎回到期_支付(
        DictCode.指令类型, "8016", "净值型产品-产品赎回到期-支付"
        ),
    /**
     * 资金划款-货币型产品赎回到期
     */
    指令类型_资金划款_货币型产品赎回到期(
        DictCode.指令类型, "8036", "资金划款-货币型产品赎回到期"
        ),
    /**
     * 指令类型_货币型产品_产品认购申购_收取
     */
    指令类型_货币型产品_产品认购申购_收取(
        DictCode.指令类型, "N8031", "货币型产品_产品认购申购_收取"
        ),

    /**
     * 指令类型_货币型产品_产品分红
     */
    指令类型_货币型产品_产品分红(
        DictCode.指令类型, "N8033", "货币型产品_产品分红"
        ),

    /**
     * 指令类型_货币型产品_产品赎回到期_本金确认
     */
    指令类型_货币型产品_产品赎回到期_本金确认(
        DictCode.指令类型, "N8035", "货币型产品_产品赎回到期_本金确认"
        ),

    /**
     * 指令类型_预期收益型产品_产品赎回到期
     */
    指令类型_预期收益型产品_产品赎回到期(
        DictCode.指令类型, "N8002", "预期收益型产品_产品赎回到期"
        ),
    /**
     * 指令类型_预期收益型产品_兑付客户收益
     */
    指令类型_预期收益型产品_兑付客户收益(
        DictCode.指令类型, "N8005", "预期收益型产品_兑付客户收益"
        ),

    /**
     * 指令类型_货币型产品_产品到期分红
     */
    指令类型_货币型产品_产品到期分红(
        DictCode.指令类型, "N8037", "货币型产品_产品到期分红"
        ),

    /**
     * 指令类型_公允价值损益类_计划类_净值型_申购_划款
     */
    指令类型_公允价值损益类_计划类_净值型_申购_划款(
        DictCode.指令类型, "1508", "公允价值损益类-计划类（净值型）-申购（划款）"
        ),
    /**
     * 指令类型_公允价值损益类_计划类_净值型_赎回到账日
     */
    指令类型_公允价值损益类_计划类_净值型_赎回到账日(
        DictCode.指令类型, "1517", "公允价值损益类-计划类（净值型）-赎回到账日"
        ),
    /**
     * 指令类型_净值型产品-产品认购申购-收取
     */
    指令类型_净值型产品_产品认购申购_收取(
        DictCode.指令类型, "N8011", "净值型产品-产品认购申购-收取"
        ),
    /**
     * 指令类型_预期收益型产品-产品认购申购-收取
     */
    指令类型_预期收益型产品_产品认购申购_收取(
        DictCode.指令类型, "N8001", "预期收益型产品-产品认购申购-收取"
        ),
    /**
     * 指令类型_净值型产品_产品现金分红_支付
     */
    指令类型_净值型产品_产品现金分红_支付(
        DictCode.指令类型, "N8013", "净值型产品-产品现金分红-支付"
        ),
    /**
     * 指令类型_净值型产品_产品赎回到期
     */
    指令类型_净值型产品_产品赎回到期(
        DictCode.指令类型, "N8015", "净值型产品-产品赎回到期"
        ),
    /**
     * 指令类型_产品销售服务费_支付
     */
    指令类型_产品销售服务费_支付(
        DictCode.指令类型, "N8102", "产品销售服务费-支付"
        ),
    /**
     * 指令类型_产品托管费_支付
     */
    指令类型_产品托管费_支付(
        DictCode.指令类型, "N8108", "产品托管费-支付"
        ),
    /**
     * 指令类型_产品资产管理费_支付
     */
    指令类型_产品资产管理费_支付(
        DictCode.指令类型, "N8104", "产品资产管理费-支付"
        ),
    /**
     * 指令类型_产品超额管理费_支付
     */
    指令类型_产品超额管理费_支付(
        DictCode.指令类型, "N8106", "产品超额管理费-支付"
        ),
    /**
     * 指令类型_产品管理费贴补_支付
     */
    指令类型_产品管理费贴补_支付(
        DictCode.指令类型, "N8109", "产品管理费贴补-支付"
        ),
    /**
     * 指令类型_产品代销费_支付
     */
    指令类型_产品代销费_支付(
        DictCode.指令类型, "N8111", "产品代销费-支付"
        ),
    /**
     * 指令类型_产品外包服务费_支付
     */
    指令类型_产品外包服务费_支付(
        DictCode.指令类型, "N8113", "产品外包服务费-支付"
        ),
    /**
     * 指令类型_产品其他费用_支付
     */
    指令类型_产品其他费用_支付(
        DictCode.指令类型, "N8115", "产品其他费用-支付"
        ),
    /**
     * 指令类型_公允价值损益类债券资产买入
     */
    指令类型_公允价值损益类债券资产买入(
        DictCode.指令类型, "N1301", "公允价值损益类债券资产买入"
        ),
    /**
     * 指令类型_摊余成本类债券资产买入
     */
    指令类型_摊余成本类债券资产买入(
        DictCode.指令类型, "N1313", "摊余成本类债券资产买入"
        ),
    /**
     * 指令类型_综合收益类债券资产买入
     */
    指令类型_综合收益类债券资产买入(
        DictCode.指令类型, "N1320", "综合收益类债券资产买入"
        ),
    /**
     * 指令类型_摊余成本类计划资产资产买入
     */
    指令类型_摊余成本类计划资产资产买入(
        DictCode.指令类型, "N1501", "摊余成本类计划资产资产买入"
        ),
    /**
     * 指令类型_公允价值损益类债券资产_收息到账
     */
    指令类型_公允价值损益类债券资产_收息到账(
        DictCode.指令类型, "N2707", "公允价值损益类债券资产-收息到账"
        ),
    /**
     * 指令类型_摊余成本类债券资产_收息到账
     */
    指令类型_摊余成本类债券资产_收息到账(
        DictCode.指令类型, "N2703", "摊余成本类债券资产-收息到账"
        ),
    /**
     * 指令类型_指令类型_综合收益类债券资产_收息到账
     */
    指令类型_综合收益类债券资产_收息到账(
        DictCode.指令类型, "N2708", "综合收益类债券资产-收息到账"
        ),
    /**
     * 指令类型_摊余成本类计划资产资产_收息到账
     */
    指令类型_摊余成本类计划资产资产_收息到账(
        DictCode.指令类型, "N2709", "摊余成本类计划资产资产-收息到账"
        ),
    /**
     * 指令类型_公允价值损益类债券资产卖出
     */
    指令类型_公允价值损益类债券资产卖出(
        DictCode.指令类型, "N1308", "公允价值损益类债券资产卖出"
        ),

    /**
     * 指令类型_摊余成本类债券资产卖出
     */
    指令类型_摊余成本类债券资产卖出(
        DictCode.指令类型, "N1316", "摊余成本类债券资产卖出"
        ),
    /**
     * 指令类型_综合收益类债券资产卖出
     */
    指令类型_综合收益类债券资产卖出(
        DictCode.指令类型, "N1325", "综合收益类债券资产卖出"
        ),
    /**
     * 指令类型_摊余成本类计划资产资产卖出
     */
    指令类型_摊余成本类计划资产资产卖出(
        DictCode.指令类型, "N1507", "摊余成本类计划资产资产卖出"
        ),
    /**
     * 指令类型_公允价值损益类债券资产_还本到账
     */
    指令类型_公允价值损益类债券资产_还本到账(
        DictCode.指令类型, "N2710", "公允价值损益类债券资产-还本到账"
        ),
    /**
     * 指令类型_摊余成本类债券资产_还本到账
     */
    指令类型_摊余成本类债券资产_还本到账(
        DictCode.指令类型, "N2704", "摊余成本类债券资产-还本到账"
        ),
    /**
     * 指令类型_综合收益类债券资产_还本到账
     */
    指令类型_综合收益类债券资产_还本到账(
        DictCode.指令类型, "N2711", "综合收益类债券资产-还本到账"
        ),
    /**
     * 指令类型_摊余成本类计划资产资产_还本到账
     */
    指令类型_摊余成本类计划资产资产_还本到账(
        DictCode.指令类型, "N2715", "摊余成本类计划资产资产-还本到账"
        ),
    /**
     * 指令类型_公允价值损益类_货币基金_认购确认
     */
    指令类型_公允价值损益类_货币基金_认购确认(
        DictCode.指令类型, "N1602", "公允价值损益类-货币基金-认购确认"
        ),
    /**
     * 指令类型_公允价值损益类_货币基金_申购确认
     */
    指令类型_公允价值损益类_货币基金_申购确认(
        DictCode.指令类型, "N1605", "公允价值损益类-货币基金-申购确认"
        ),
    /**
     * 指令类型_非货币基金_交易性_认购确认
     */
    指令类型_非货币基金_交易性_认购确认(
        DictCode.指令类型, "N1622", "非货币基金（交易性）-认购确认"
        ),
    /**
     * 指令类型_非货币基金及净值型资产_申购确认
     */
    指令类型_非货币基金及净值型资产_申购确认(
        DictCode.指令类型, "N1626", "非货币基金及净值型资产-申购确认"
        ),
    /**
     * 指令类型_货币基金及货币型资产_转仓买入
     */
    指令类型_货币基金及货币型资产_转仓买入(
        DictCode.指令类型, "N1606", "货币基金及货币型资产-转仓买入"
        ),
    /**
     * 指令类型_非货币基金_交易性_买入
     */
    指令类型_非货币基金及净值型资产_转仓买入(
        DictCode.指令类型, "N1628", "非货币基金及净值型资产-转仓买入"
        ),
    /**
     * 指令类型_公允价值损益类_货币基金_赎回_确认
     */
    指令类型_公允价值损益类_货币基金_赎回_确认(
        DictCode.指令类型, "N1610", "公允价值损益类-货币基金-赎回-确认"
        ),
    /**
     * 指令类型_非货币基金及净值型资产_赎回确认
     */
    指令类型_非货币基金及净值型资产_赎回确认(
        DictCode.指令类型, "N1634", "非货币基金及净值型资产-赎回确认"
        ),
    /**
     * 指令类型_非货币基金及净值型资产_现金分红
     */
    指令类型_非货币基金及净值型资产_现金分红(
        DictCode.指令类型, "N1632", "非货币基金及净值型资产-现金分红"
        ),
    
    /**
     * 指令类型_货币基金_现金分红
     */
    指令类型_公允价值损益类_货币基金_现金分红(
        DictCode.指令类型, "N1608", "公允价值损益类-货币基金-现金分红"
        ),

    /**
     * 指令类型_货币基金及货币型资产_转仓卖出
     */
    指令类型_货币基金及货币型资产_转仓卖出(
        DictCode.指令类型, "N1612", "货币基金及货币型资产-转仓卖出"
        ),
    /**
     * 指令类型_非货币基金及净值型资产_转仓卖出
     */
    指令类型_非货币基金及净值型资产_转仓卖出(
        DictCode.指令类型, "N1638", "非货币基金及净值型资产-转仓卖出"
        ),

    /**
     * 指令类型_拆放同业_同业借款_买入
     */
    指令类型_拆放同业_同业借款_买入(
        DictCode.指令类型, "N1105", "拆放同业（同业借款）买入"
        ),
    /**
     * 指令类型_拆放同业_转仓卖出
     */
    指令类型_拆放同业_转仓卖出(
        DictCode.指令类型, "N1109", "拆放同业-转仓卖出"
        ),
    /**
     * 指令类型_拆入_起息
     */
    指令类型_拆入_起息(
        DictCode.指令类型, "N1201", "拆入-起息"
        ),
    /**
     * 指令类型_资金收款_同业借款还本到期
     */
    指令类型_资金收款_同业借款_还本到期(
        DictCode.指令类型, "2725", "资金收款-同业借款还本到期"
        ),
    /**
     * 指令类型_资金收款_同业借款_中间收息
     */
    指令类型_资金收款_同业借款_中间收息(
        DictCode.指令类型, "2726", "资金收款-同业借款中间收息"
        ),
    
    /**
     * 指令类型_资金收款_同业借款_卖出
     */
    指令类型_资金收款_同业借款_卖出(
        DictCode.指令类型, "2728", "资金收款-同业借款卖出"
        ),
    
    /**
     * 指令类型_资金收款_拆入起息
     */
    指令类型_资金收款_拆入起息(
        DictCode.指令类型, "2729", "资金收款-拆入起息"
        ),
    /**
     * 指令类型_资金收款_同业借款_买入
     */
    指令类型_资金收款_同业借款_买入(
        DictCode.指令类型, "2727", "资金收款-同业借款买入"
        ),
    
    
    /**
     * 指令类型_拆分同业_中间收息
     */
    指令类型_拆分同业_中间收息(
        DictCode.指令类型, "N1108", "拆分同业-中间收息"
        ),
    
    /**
     * 指令类型_存放同业_一般款项_买入
     */
    指令类型_存放同业_一般款项_买入(
        DictCode.指令类型, "N1101", "存放同业（一般款项）买入"
        ),
    /**
     * 指令类型_资金收款_存放同业_收息
     */
    指令类型_资金收款_存放同业_收息(
        DictCode.指令类型, "N2733", "资金收款-存放同业收息"
        ),
    /**
     * 指令类型_存放同业_一般款项_收息
     */
    指令类型_存放同业_一般款项_收息(
        DictCode.指令类型, "N1103", "存放同业（一般款项）收息"
        ),
    /**
     * 指令类型_存放同业_还本到期
     */
    指令类型_存放同业_还本到期(
        DictCode.指令类型, "N1110", "存放同业-还本/到期"
        ),
    /**
     * 指令类型_存放同业_一般款项_到期卖出
     */
    指令类型_存放同业_一般款项_到期卖出(
        DictCode.指令类型, "N1104", "存放同业（一般款项）到期卖出"
        ),
    /**
     * 指令类型_资金收款_存放同业_卖出
     */
    指令类型_资金收款_存放同业_卖出(
        DictCode.指令类型, "2732", "资金收款-存放同业卖出"
        ),
    /**
     * 指令类型_资金收款_存放同业_收息
     */
    指令类型_资金收款_存放同业_起息(
        DictCode.指令类型, "2731", "资金划款-存放同业起息"
        ),
    /**
     * 指令类型_资金收款_存放同业_还本到期
     */
    指令类型_资金收款_存放同业_还本到期(
        DictCode.指令类型, "N2734", "资金收款-存放同业还本/到期"
        ),
    /**
     * 指令类型_拆放同业_到期
     */
    指令类型_拆放同业_到期(
        DictCode.指令类型, "N1107", "拆放同业-到期"
        ),
    /**
     * 指令类型_拆放同业_拆入到期
     */
    指令类型_拆放同业_拆入到期(
        DictCode.指令类型, "N1203", "拆入-到期"
        ),
    /**
     * 指令类型_拆放同业_拆入到期
     */
    指令类型_资金划款_拆放同业_拆入到期(
        DictCode.指令类型, "2730", "资金划款-拆入到期"
        ),
    /**
     * 指令类型_质押式逆回购_起息
     */
    指令类型_质押式逆回购_起息(
        DictCode.指令类型, "N1401", "质押式逆回购_起息"
        ),
    /**
     * 指令类型_质押式逆回购_到期
     */
    指令类型_质押式逆回购_到期(
        DictCode.指令类型, "N1403", "质押式逆回购_到期"
        ),

    /**
     * 指令类型_质押式正回购_起息
     */
    指令类型_质押式正回购_起息(
        DictCode.指令类型, "N1404", "质押式正回购_起息"
        ),
    /**
     * 指令类型_质押式正回购_到期
     */
    指令类型_质押式正回购_到期(
        DictCode.指令类型, "N1406", "质押式正回购_到期"
        ),

    /**
     * 指令类型_买断式逆回购_起息
     */
    指令类型_买断式逆回购_起息(
        DictCode.指令类型, "N1407", "买断式逆回购_起息"
        ),

    /**
     * 指令类型_买断式逆回购_派息
     */
    指令类型_买断式逆回购_派息(
        DictCode.指令类型, "N1413", "买断式逆回购_派息"
        ),

    /**
     * 指令类型_买断式逆回购_到期
     */
    指令类型_买断式逆回购_到期(
        DictCode.指令类型, "N1409", "买断式逆回购_到期"
        ),

    /**
     * 指令类型_买断式正回购_起息
     */
    指令类型_买断式正回购_起息(
        DictCode.指令类型, "N1410", "买断式正回购_起息"
        ),

    /**
     * 指令类型_买断式正回购_到期
     */
    指令类型_买断式正回购_到期(
        DictCode.指令类型, "N1412", "买断式正回购_到期"
        ),

    /**
     * 指令类型_增值税缴纳_缴纳日_增值税缴纳
     */
    指令类型_增值税缴纳_缴纳日_增值税缴纳(
        DictCode.指令类型, "N2615", "增值税缴纳_缴纳日_增值税缴纳"
        ),
    /**
     * 指令类型_增值税缴纳_退税日_退税
     */
    指令类型_增值税缴纳_退税日_退税(
        DictCode.指令类型, "N2616", "增值税缴纳_退税日_退税"
        ),

    /**
     * 指令类型_投资类费用_交易费用_支付
     */
    指令类型_投资类费用_交易费用_支付(
        DictCode.指令类型, "N3001", "投资类费用_交易费用_支付"
        ),

    /**
     * 指令类型_应收款项_转仓转入
     */
    指令类型_应收款项_转仓转入(
        DictCode.指令类型, "N2802", "应收款项转仓转入"
        ),

    /**
     * 指令类型_应收款项_转仓转出
     */
    指令类型_应收款项_转仓转出(
        DictCode.指令类型, "N2803", "应收款项转仓转出"
        ),
    /**
     * 指令类型_债券借贷_融出到期
     */
    指令类型_债券借贷_融出到期(
        DictCode.指令类型, "N2507", "债券借贷_融出到期"
        ),
    /**
     * 指令类型_债券借贷_融入到期
     */
    指令类型_债券借贷_融入到期(
        DictCode.指令类型, "N2513", "债券借贷_融入到期"
        ),
    /**
     * 指令类型_债券借贷_融入期间标的债券收息
     */
    指令类型_债券借贷_融入期间标的债券收息(
        DictCode.指令类型, "N2510", "债券借贷_融入期间标的债券收息"
        ),
    /**
     * 指令类型_债券借贷_融入期间标的债券付息
     */
    指令类型_债券借贷_融入期间标的债券付息(
        DictCode.指令类型, "N2511", "债券借贷_融入期间标的债券付息"
        ),
    /**
     * 指令类型_债券借贷_融入债券卖出
     */
    指令类型_债券借贷_融入债券卖出(
        DictCode.指令类型, "N2514", "债券借贷_融入债券卖出"
        ),

    /**
     * 指令类型_债券借贷_融入债券卖出后收息
     */
    指令类型_债券借贷_融入债券卖出后收息(
        DictCode.指令类型, "N2517", "债券借贷_融入债券卖出后收息"
        ),

    /**
     * 指令类型_债券借贷_融入期间标的债券还本
     */
    指令类型_债券借贷_融入期间标的债券还本(
        DictCode.指令类型, "N2518", "债券借贷_融入期间标的债券还本"
        ),
    /**
     * 指令类型_债券借贷_融入债券卖出后还本
     */
    指令类型_债券借贷_融入债券卖出后还本(
        DictCode.指令类型, "N2519", "债券借贷_融入债券卖出后还本"
        ),
    /**
     * 指令类型_债券借贷_融入期间标的券本金支付
     */
    指令类型_债券借贷_融入期间标的券本金支付(
        DictCode.指令类型, "N2520", "债券借贷_融入期间标的券本金支付"
        ),
    /**
     * 指令类型_债券借贷_融入债券卖出后购回
     */
    指令类型_债券借贷_融入债券卖出后购回(
        DictCode.指令类型, "N2521", "债券借贷_融入债券卖出后购回"
        ),

    // /**
    // * 指令类型_
    // */
    // 指令类型_(
    // DictCode.指令类型, "", ""
    // ),

    /**
     * 交易对手类型_内部交易对手
     */
    交易对手类型_内部交易对手(
        DictCode.交易对手类型, "01", "内部交易对手"
    ),
    /**
     * 交易对手类型_外部交易对手
     */
    交易对手类型_外部交易对手(
        DictCode.交易对手类型, "02", "外部交易对手"
    ),
    // /**
    // * 资金账户类型_理财专户
    // */
    // 资金账户类型_理财专户(
    // DictCode.资金账户类型, "01", "理财专户"
    // ),
    // /**
    // * 资金账户类型_理财托管户
    // */
    // 资金账户类型_理财托管户(
    // DictCode.资金账户类型, "02", "理财托管户"
    // ),
    // /**
    // * 资金账户类型_资产管理费账户
    // */
    // 资金账户类型_资产管理费账户(
    // DictCode.资金账户类型, "03", "资产管理费账户"
    // ),
    // /**
    // * 资金账户类型_销售服务费账户
    // */
    // 资金账户类型_销售服务费账户(
    // DictCode.资金账户类型, "04", "销售服务费账户"
    // ),
    // /**
    // * 资金账户类型_托管费账户
    // */
    // 资金账户类型_托管费账户(
    // DictCode.资金账户类型, "05", "托管费账户"
    // ),
    // /**
    // * 资金账户类型_交易费用账户
    // */
    // 资金账户类型_交易费用账户(
    // DictCode.资金账户类型, "06", "交易费用账户"
    // ),
    //
    // /**
    // * 资金账户类型_其他费用账户
    // */
    // 资金账户类型_其他费用账户(
    // DictCode.资金账户类型, "07", "其他费用账户"
    // ),
    // /**
    // * 资金账户类型_资金结算户
    // */
    // 资金账户类型_资金结算户(
    // DictCode.资金账户类型, "08", "资金结算户"
    // ),
    // /**
    // * 资金账户类型_结算保证金户
    // */
    // 资金账户类型_结算保证金户(
    // DictCode.资金账户类型, "09", "结算保证金户"
    // ),
    // /**
    // * 资金账户类型_对手方账户
    // */
    // 资金账户类型_对手方账户(
    // DictCode.资金账户类型, "11", "对手方账户 "
    // ),
    // /**
    // * 资金账户类型_通道资金账户
    // */
    // 资金账户类型_通道资金账户(
    // DictCode.资金账户类型, "12", "通道资金账户"
    // ),
    // /**
    // * 资金账户类型_行内过渡户
    // */
    // 资金账户类型_行内过渡户(
    // DictCode.资金账户类型, "13", "行内过渡户"
    // ),
    // /**
    // * 资金账户类型_增值税户
    // */
    // 资金账户类型_增值税户(
    // DictCode.资金账户类型, "14", "增值税户"
    // ),
    /**
     * 资金账户类型_托管户
     */
    资金账户类型_托管户(
        DictCode.资金账户类型, "A01", "托管户"
    ),
    /**
     * 资金账户类型_通道账户
     */
    资金账户类型_通道账户(
        DictCode.资金账户类型, "A02", "通道账户"
    ),
    /**
     * 资金账户类型_待清算款
     */
    资金账户类型_待清算款(
        DictCode.资金账户类型, "A03", "待清算款"
    ),
    // /**
    // * 资金账户类型_待清算账户
    // */
    // 资金账户类型_待清算账户(
    // DictCode.资金账户类型, "A03", "待清算账户"
    // ),
    /**
     * 资金账户类型_结算备付金（券商保证金）
     */
    资金账户类型_结算备付金(
        DictCode.资金账户类型, "A04", "结算备付金"
    ),
    /**
     * 资金账户类型_资金结算账户
     */
    资金账户类型_资金结算账户(
        DictCode.资金账户类型, "A05", "资金结算账户"
    ),
    /**
     * 资金账户类型_附加税户
     */
    资金账户类型_附加税户(
        DictCode.资金账户类型, "15", "附加税户"
    ),
    // /**
    // * 核算主体类别_理财产品
    // */
    // 核算主体类别_理财产品(
    // DictCode.核算主体类别, "F16", "理财产品"
    // ),
    // /**
    // * 核算主体类别_投资组合
    // */
    // 核算主体类别_投资组合(
    // DictCode.核算主体类别, "F18", "投资组合"
    // ),
    // /**
    // * 核算主体类别_部门
    // */
    // 核算主体类别_部门(
    // DictCode.核算主体类别, "03", "部门"
    // ),

    /**
     * 分层类别_理财产品
     */
    分层类别_理财产品(
        DictCode.分层类别, "01", "理财产品"
    ),
    /**
     * 分层类别_周期型产品
     */
    分层类别_周期型产品(
        DictCode.分层类别, "02", "周期型产品"
    ),
    /**
     * 分层类别_投资组合
     */
    分层类别_投资组合(
        DictCode.分层类别, "03", "投资组合"
    ),
    /**
     * 特殊核算模型_普通分层核算
     */
    特殊核算模型_普通分层核算(
        DictCode.特殊核算模型, "01", "普通分层核算"
    ),
    /**
     * 特殊核算模型_收益分层核算
     */
    特殊核算模型_收益分层核算(
        DictCode.特殊核算模型, "02", "收益分层核算"
    ),
    /**
     * 币种_人民币_CNY
     */
    币种_人民币_CNY(
        DictCode.币种, "CNY", "人民币(CNY)"
    ),
    /**
     * 币种_港元_HKD
     */
    币种_港元_HKD(
        DictCode.币种, "HKD", "港元(HKD)"
    ),
    /**
     * 币种_美元_USD
     */
    币种_美元_USD(
        DictCode.币种, "USD", "美元(USD)"
    ),
    /**
     * 币种_欧元_EUR
     */
    币种_欧元_EUR(
        DictCode.币种, "EUR", "欧元(EUR)"
    ),
    /**
     * 币种_日元_JPY
     */
    币种_日元_JPY(
        DictCode.币种, "JPY", "日元(JPY)"
    ),
    /**
     * 币种_澳门元_MOP
     */
    币种_澳门元_MOP(
        DictCode.币种, "MOP", "澳门元(MOP)"
    ),
    /**
     * 币种_瑞士法郎_CHF
     */
    币种_瑞士法郎_CHF(
        DictCode.币种, "CHF", "瑞士法郎(CHF)"
    ),
    /**
     * 币种_英镑_GBP
     */
    币种_英镑_GBP(
        DictCode.币种, "GBP", "英镑(GBP)"
    ),
    /**
     * 币种_俄罗斯卢布_RUB
     */
    币种_俄罗斯卢布_RUB(
        DictCode.币种, "RUB", "俄罗斯卢布(RUB)"
    ),
    /**
     * 币种_加拿大元_CAD
     */
    币种_加拿大元_CAD(
        DictCode.币种, "CAD", "加拿大元(CAD)"
    ),
    /**
     * 币种_丹麦克朗_DKK
     */
    币种_丹麦克朗_DKK(
        DictCode.币种, "DKK", "丹麦克朗(DKK)"
    ),
    /**
     * 币种_澳大利亚元_AUD
     */
    币种_澳大利亚元_AUD(
        DictCode.币种, "AUD", "澳大利亚元(AUD)"
    ),
    /**
     * 币种_瑞典克朗_SEK
     */
    币种_瑞典克朗_SEK(
        DictCode.币种, "SEK", "瑞典克朗(SEK)"
    ),
    /**
     * 币种_新加坡元_SGD
     */
    币种_新加坡元_SGD(
        DictCode.币种, "SGD", "新加坡元(SGD)"
    ),
    /**
     * 币种_新台币_TWD
     */
    币种_新台币_TWD(
        DictCode.币种, "TWD", "新台币(TWD)"
    ),
    /**
     * 科目类别_资产类
     */
    科目类别_资产类(
        DictCode.科目类型, "01", "资产类"
    ),
    /**
     * 科目类别_负债类
     */
    科目类别_负债类(
        DictCode.科目类型, "02", "负债类"
    ),
    /**
     * 科目类别_资产负债共同类
     */
    科目类别_资产负债共同类(
        DictCode.科目类型, "03", "资产负债共同类"
    ),
    /**
     * 科目类别_所有者权益类
     */
    科目类别_所有者权益类(
        DictCode.科目类型, "04", "所有者权益类"
    ),
    /**
     * 科目类别_损益类
     */
    科目类别_损益类(
        DictCode.科目类型, "05", "损益类"
    ),
    /**
     * 科目类别_表外科目
     */
    科目类别_表外科目(
        DictCode.科目类型, "06", "表外科目"
    ),
    /**
     * 科目类别_登记簿类
     */
    科目类别_登记簿类(
        DictCode.科目类型, "07", "登记簿类"
    ),

    /**
     * 收付方向_收入
     */
    收付方向_收入(
        DictCode.收付方向, "01", "收入"
    ),
    /**
     * 收付方向_支出
     */
    收付方向_支出(
        DictCode.收付方向, "02", "支出"
    ),
    /**
     * 交易流通场所_银行间债券市场
     */
    交易流通场所_银行间债券市场(
        DictCode.交易流通场所, "01", "银行间债券市场"
    ),
    /**
     * 交易流通场所_商业银行柜台市场
     */
    交易流通场所_商业银行柜台市场(
        DictCode.交易流通场所, "02", "商业银行柜台市场"
    ),
    /**
     * 交易流通场所_上海证券交易所
     */
    交易流通场所_上海证券交易所(
        DictCode.交易流通场所, "03", "上海证券交易所"
    ),
    /**
     * 交易流通场所_深圳证券交易所
     */
    交易流通场所_深圳证券交易所(
        DictCode.交易流通场所, "04", "深圳证券交易所"
    ),
    /**
     * 交易流通场所_全国中小企业股份转让系统
     */
    交易流通场所_全国中小企业股份转让系统(
        DictCode.交易流通场所, "05", "全国中小企业股份转让系统"
    ),
    /**
     * 交易流通场所_上海期货交易所
     */
    交易流通场所_上海期货交易所(
        DictCode.交易流通场所, "06", "上海期货交易所"
    ),
    /**
     * 交易流通场所_郑州商品交易所
     */
    交易流通场所_郑州商品交易所(
        DictCode.交易流通场所, "07", "郑州商品交易所"
    ),
    /**
     * 交易流通场所_大连商品交易所
     */
    交易流通场所_大连商品交易所(
        DictCode.交易流通场所, "08", "大连商品交易所"
    ),
    /**
     * 交易流通场所_中国金融期货交易所
     */
    交易流通场所_中国金融期货交易所(
        DictCode.交易流通场所, "09", "中国金融期货交易所"
    ),
    /**
     * 交易流通场所_上海黄金交易所
     */
    交易流通场所_上海黄金交易所(
        DictCode.交易流通场所, "10", "上海黄金交易所"
    ),
    /**
     * 交易流通场所_区域性产权_资产交易市场
     */
    交易流通场所_区域性产权_资产交易市场(
        DictCode.交易流通场所, "11", "区域性产权/资产交易市场"
    ),
    /**
     * 交易流通场所_区域性商品交易所
     */
    交易流通场所_区域性商品交易所(
        DictCode.交易流通场所, "12", "区域性商品交易所"
    ),
    /**
     * 交易流通场所_区域性贵金属交易所
     */
    交易流通场所_区域性贵金属交易所(
        DictCode.交易流通场所, "13", "区域性贵金属交易所"
    ),
    /**
     * 交易流通场所_艺术品市场
     */
    交易流通场所_艺术品市场(
        DictCode.交易流通场所, "14", "艺术品市场"
    ),
    /**
     * 交易流通场所_基金市场
     */
    交易流通场所_基金市场(
        DictCode.交易流通场所, "15", "基金市场"
    ),
    /**
     * 交易流通场所_信托市场
     */
    交易流通场所_信托市场(
        DictCode.交易流通场所, "16", "信托市场"
    ),
    /**
     * 交易流通场所_全国银行间同业拆借市场
     */
    交易流通场所_全国银行间同业拆借市场(
        DictCode.交易流通场所, "17", "全国银行间同业拆借市场"
    ),
    /**
     * 交易流通场所_上海票据交易所
     */
    交易流通场所_上海票据交易所(
        DictCode.交易流通场所, "18", "上海票据交易所"
    ),
    /**
     * 交易流通场所_其他交易流通场所
     */
    交易流通场所_其他交易流通场所(
        DictCode.交易流通场所, "99", "其他交易流通场所"
    ),
    /**
     * 发行方式_封闭式
     */
    发行方式_封闭式(
        DictCode.发行方式, "01", "封闭式"
    ),
    /**
     * 发行方式_开放式
     */
    发行方式_开放式(
        DictCode.发行方式, "02", "开放式"
    ),
    /**
     * 现金流一级类型_本金
     */
    现金流一级类型_本金(
        DictCode.现金流一级类型, "01", "本金"
    ),
    /**
     * 现金流一级类型_利息
     */
    现金流一级类型_利息(
        DictCode.现金流一级类型, "02", "利息"
    ),
    /**
     * 现金流一级类型_费用
     */
    现金流一级类型_费用(
        DictCode.现金流一级类型, "03", "费用"
    ),
    /**
     * 现金流一级类型_税额
     */
    现金流一级类型_税额(
        DictCode.现金流一级类型, "04", "税额"
    ),
    /**
     * 现金流一级类型_行权
     */
    现金流一级类型_行权(
        DictCode.现金流一级类型, "05", "行权"
    ),
    /**
     * 现金流二级类型_本金
     */
    现金流二级类型_本金(
        DictCode.现金流二级类型, "C01", "本金"
    ),
    /**
     * 现金流二级类型_利息
     */
    现金流二级类型_利息(
        DictCode.现金流二级类型, "C02", "利息"
    ),
    /**
     * 现金流二级类型_固定管理费
     */
    现金流二级类型_固定管理费(
        DictCode.现金流二级类型, "C03", "固定管理费"
    ),
    /**
     * 现金流二级类型_浮动管理费
     */
    现金流二级类型_浮动管理费(
        DictCode.现金流二级类型, "C04", "浮动管理费"
    ),
    /**
     * 现金流二级类型_托管费
     */
    现金流二级类型_托管费(
        DictCode.现金流二级类型, "C05", "托管费"
    ),
    /**
     * 现金流二级类型_销售费
     */
    现金流二级类型_销售费(
        DictCode.现金流二级类型, "C06", "销售费"
    ),
    /**
     * 现金流二级类型_税额
     */
    现金流二级类型_税额(
        DictCode.现金流二级类型, "C07", "税额"
    ),

    /**
     * 现金流二级类型_行权
     */
    现金流二级类型_行权(
        DictCode.现金流二级类型, "C08", "行权"
    ),
    /**
     * 现金流二级类型_外包服务费
     */
    现金流二级类型_外包服务费(
        DictCode.现金流二级类型, "C09", "外包服务费"
    ),
    /**
     * 现金流二级类型_代销费
     */
    现金流二级类型_代销费(
        DictCode.现金流二级类型, "C10", "代销费"
    ),

    /**
     * 计算类型_固定利率
     */
    计算类型_固定利率(
        DictCode.计算类型, "01", "固定利率"
    ),
    /**
     * 计算类型_浮动利率
     */
    计算类型_浮动利率(
        DictCode.计算类型, "02", "浮动利率"
    ),
    /**
     * 计算类型_万份收益
     */
    计算类型_万份收益(
        DictCode.计算类型, "03", "万份收益"
    ),
    /**
     * 计算类型_净值
     */
    计算类型_净值(
        DictCode.计算类型, "04", "净值"
    ),
    /**
     * 跑批规则_按账套日最初执行
     */
    跑批规则_按账套日最初执行(
        DictCode.跑批规则, "01", "按账套日最初执行"
    ),
    /**
     * 跑批规则_按入账日最后执行
     */
    跑批规则_按入账日最后执行(
        DictCode.跑批规则, "02", "按入账日最后执行"
    ),
    /**
     * 跑批规则_按账套日最后执行
     */
    跑批规则_按账套日最后执行(
        DictCode.跑批规则, "03", "按账套日最后执行"
    ),
    /**
     * 跑批规则_按账套日最初执行
     */
    跑批规则_最初执行(
        DictCode.跑批规则, "04", "最初执行"
    ),
    /**
     * 交易场所类别_场内
     */
    交易场所类别_场内(
        DictCode.交易场所类别, "01", "场内"
    ),
    /**
     * 交易场所类别_场外
     */
    交易场所类别_场外(
        DictCode.交易场所类别, "02", "场外"
    ),
    /**
     * 营业日准则_向前调整
     */
    营业日准则_向前调整(
        DictCode.营业日准则, "01", "向前调整"
    ),
    /**
     * 营业日准则_向后调整
     */
    营业日准则_向后调整(
        DictCode.营业日准则, "02", "向后调整"
    ),
    /**
     * 营业日准则_调整的向后调整
     */
    营业日准则_调整的向后调整(
        DictCode.营业日准则, "03", "调整的向后调整"
    ),
    /**
     * 营业日准则_不调整
     */
    营业日准则_不调整(
        DictCode.营业日准则, "04", "不调整"
    ),
    /**
     * 支付方式_红利再投
     */
    支付方式_红利再投(
        DictCode.支付方式, "01", "红利再投"
    ),
    /**
     * 支付方式_现金
     */
    支付方式_现金(
        DictCode.支付方式, "02", "现金"
    ),
    /**
     * 现金流单位_百元法
     */
    现金流单位_百元法(
        DictCode.现金流单位, "01", "百元法"
    ),
    /**
     * 现金流单位_总额
     */
    现金流单位_总额(
        DictCode.现金流单位, "02", "总额"
    ),
    /**
     * 债券核算分类_银行间国债
     */
    债券核算分类_银行间国债(
        DictCode.债券核算分类, "YH001", "银行间国债"
    ),
    /**
     * 债券核算分类_银行间地方债
     */
    债券核算分类_银行间地方债(
        DictCode.债券核算分类, "YH002", "银行间地方债"
    ),
    /**
     * 债券核算分类_银行间企业债
     */
    债券核算分类_银行间企业债(
        DictCode.债券核算分类, "YH003", "银行间企业债"
    ),
    /**
     * 债券核算分类_银行间短期融资券
     */
    债券核算分类_银行间短期融资券(
        DictCode.债券核算分类, "YH004", "银行间短期融资券"
    ),
    /**
     * 债券核算分类_银行间超短期融资券
     */
    债券核算分类_银行间超短期融资券(
        DictCode.债券核算分类, "YH005", "银行间超短期融资券"
    ),
    /**
     * 债券核算分类_银行间中期票据
     */
    债券核算分类_银行间中期票据(
        DictCode.债券核算分类, "YH006", "银行间中期票据"
    ),
    /**
     * 
     */
    债券核算分类_银行间金融债(
        DictCode.债券核算分类, "YH007", "银行间金融债"
    ),
    /**
     * 
     */
    债券核算分类_银行间政策性金融债(
        DictCode.债券核算分类, "YH008", "银行间政策性金融债"
    ),
    /**
     * 债券核算分类_银行间央行票据
     */
    债券核算分类_银行间央行票据(
        DictCode.债券核算分类, "YH009", "银行间央行票据"
    ),
    /**
     * 债券核算分类_银行间次级债
     */
    债券核算分类_银行间次级债(
        DictCode.债券核算分类, "YH010", "银行间次级债"
    ),
    /**
     * 债券核算分类_银行间可分离债
     */
    债券核算分类_银行间可分离债(
        DictCode.债券核算分类, "YH011", "银行间可分离债"
    ),
    /**
     * 债券核算分类_银行间私募债
     */
    债券核算分类_银行间私募债(
        DictCode.债券核算分类, "YH012", "银行间私募债"
    ),
    /**
     * 债券核算分类_银行间其他债券
     */
    债券核算分类_银行间其他债券(
        DictCode.债券核算分类, "YH013", "银行间其他债券"
    ),
    /**
     * 债券核算分类_银行间资产证券
     */
    债券核算分类_银行间资产证券(
        DictCode.债券核算分类, "YH014", "银行间资产证券"
    ),
    /**
     * 债券核算分类_银行间其他金融债
     */
    债券核算分类_银行间其他金融债(
        DictCode.债券核算分类, "YH015", "银行间其他金融债"
    ),
    /**
     * 债券核算分类_银行间商业银行债
     */
    债券核算分类_银行间商业银行债(
        DictCode.债券核算分类, "YH001", "银行间商业银行债"
    ),
    /**
     * 债券核算分类_银行间同业存单
     */
    债券核算分类_银行间同业存单(
        DictCode.债券核算分类, "YH017", "银行间同业存单"
    ),
    /**
     * 债券核算分类_上海国债
     */
    债券核算分类_上海国债(
        DictCode.债券核算分类, "SH001", "上海国债"
    ),
    /**
     * 债券核算分类_上海地方债
     */
    债券核算分类_上海地方债(
        DictCode.债券核算分类, "SH002", "上海地方债"
    ),
    /**
     * 债券核算分类_上海企业债
     */
    债券核算分类_上海企业债(
        DictCode.债券核算分类, "SH003", "上海企业债"
    ),
    /**
     * 债券核算分类_上海短期融资券
     */
    债券核算分类_上海短期融资券(
        DictCode.债券核算分类, "SH004", "上海短期融资券"
    ),
    /**
     * 债券核算分类_上海超短期融资券
     */
    债券核算分类_上海超短期融资券(
        DictCode.债券核算分类, "SH005", "上海超短期融资券"
    ),
    /**
     * 债券核算分类_上海中期票据
     */
    债券核算分类_上海中期票据(
        DictCode.债券核算分类, "SH006", "上海中期票据"
    ),
    /**
     * 债券核算分类_上海可转换债
     */
    债券核算分类_上海可转换债(
        DictCode.债券核算分类, "SH007", "上海可转换债"
    ),
    /**
     * 债券核算分类_上海可交换公司债
     */
    债券核算分类_上海可交换公司债(
        DictCode.债券核算分类, "SH008", "上海可交换公司债"
    ),
    /**
     * 债券核算分类_上海金融债
     */
    债券核算分类_上海金融债(
        DictCode.债券核算分类, "SH009", "上海金融债"
    ),
    /**
     * 债券核算分类_上海政策性金融债
     */
    债券核算分类_上海政策性金融债(
        DictCode.债券核算分类, "SH010", "上海政策性金融债"
    ),
    /**
     * 债券核算分类_上海次级债
     */
    债券核算分类_上海次级债(
        DictCode.债券核算分类, "SH011", "上海次级债"
    ),
    /**
     * 债券核算分类_上海可分离债
     */
    债券核算分类_上海可分离债(
        DictCode.债券核算分类, "SH012", "上海可分离债"
    ),
    /**
     * 债券核算分类_上海私募债
     */
    债券核算分类_上海私募债(
        DictCode.债券核算分类, "SH013", "上海私募债"
    ),
    /**
     * 债券核算分类_上海其他债券
     */
    债券核算分类_上海其他债券(
        DictCode.债券核算分类, "SH014", "上海其他债券"
    ),
    /**
     * 债券核算分类_上海资产证券
     */
    债券核算分类_上海资产证券(
        DictCode.债券核算分类, "SH015", "上海资产证券"
    ),
    /**
     * 债券核算分类_上海其他金融债
     */
    债券核算分类_上海其他金融债(
        DictCode.债券核算分类, "SH016", "上海其他金融债"
    ),
    /**
     * 债券核算分类_上海商业银行债
     */
    债券核算分类_上海商业银行债(
        DictCode.债券核算分类, "SH017", "上海商业银行债"
    ),
    /**
     * 债券核算分类_上海优先股
     */
    债券核算分类_上海优先股(
        DictCode.债券核算分类, "SH018", "上海优先股"
    ),
    /**
     * 债券核算分类_深圳国债
     */
    债券核算分类_深圳国债(
        DictCode.债券核算分类, "SZ001", "深圳国债"
    ),
    /**
     * 债券核算分类_深圳地方债
     */
    债券核算分类_深圳地方债(
        DictCode.债券核算分类, "SZ002", "深圳地方债"
    ),
    /**
     * 债券核算分类_深圳企业债
     */
    债券核算分类_深圳企业债(
        DictCode.债券核算分类, "SZ003", "深圳企业债"
    ),
    /**
     * 债券核算分类_深圳短期融资券
     */
    债券核算分类_深圳短期融资券(
        DictCode.债券核算分类, "SZ004", "深圳短期融资券"
    ),
    /**
     * 债券核算分类_深圳超短期融资券
     */
    债券核算分类_深圳超短期融资券(
        DictCode.债券核算分类, "SZ005", "深圳超短期融资券"
    ),
    /**
     * 债券核算分类_深圳中期票据
     */
    债券核算分类_深圳中期票据(
        DictCode.债券核算分类, "SZ006", "深圳中期票据"
    ),
    /**
     * 债券核算分类_深圳可转换债
     */
    债券核算分类_深圳可转换债(
        DictCode.债券核算分类, "SZ007", "深圳可转换债"
    ),
    /**
     * 债券核算分类_深圳可交换公司债
     */
    债券核算分类_深圳可交换公司债(
        DictCode.债券核算分类, "SZ008", "深圳可交换公司债"
    ),
    /**
     * 债券核算分类_深圳金融债
     */
    债券核算分类_深圳金融债(
        DictCode.债券核算分类, "SZ009", "深圳金融债"
    ),
    /**
     * 债券核算分类_深圳政策性金融债
     */
    债券核算分类_深圳政策性金融债(
        DictCode.债券核算分类, "SZ010", "深圳政策性金融债"
    ),
    /**
     * 债券核算分类_深圳次级债
     */
    债券核算分类_深圳次级债(
        DictCode.债券核算分类, "SZ011", "深圳次级债"
    ),
    /**
     * 债券核算分类_深圳可分离债
     */
    债券核算分类_深圳可分离债(
        DictCode.债券核算分类, "SZ012", "深圳可分离债"
    ),
    /**
     * 债券核算分类_深圳私募债
     */
    债券核算分类_深圳私募债(
        DictCode.债券核算分类, "SZ013", "深圳私募债"
    ),
    /**
     * 债券核算分类_深圳其他债券
     */
    债券核算分类_深圳其他债券(
        DictCode.债券核算分类, "SZ014", "深圳其他债券"
    ),
    /**
     * 债券核算分类_深圳资产证券
     */
    债券核算分类_深圳资产证券(
        DictCode.债券核算分类, "SZ015", "深圳资产证券"
    ),
    /**
     * 债券核算分类_深圳其他金融债
     */
    债券核算分类_深圳其他金融债(
        DictCode.债券核算分类, "SZ016", "深圳其他金融债"
    ),
    /**
     * 债券核算分类_深圳商业银行债
     */
    债券核算分类_深圳商业银行债(
        DictCode.债券核算分类, "SZ017", "深圳商业银行债"
    ),
    /**
     * 债券核算分类_深圳优先股
     */
    债券核算分类_深圳优先股(
        DictCode.债券核算分类, "SZ018", "深圳优先股"
    ),
    /**
     * 债券核算分类_境外国债
     */
    债券核算分类_境外国债(
        DictCode.债券核算分类, "JW001", "境外国债"
    ),
    /**
     * 债券核算分类_境外其他债券
     */
    债券核算分类_境外其他债券(
        DictCode.债券核算分类, "JW002", "境外其他债券"
    ),
    /**
     * 债券核算分类_其他理财直接融资工具
     */
    债券核算分类_其他理财直接融资工具(
        DictCode.债券核算分类, "LC001", "其他理财直接融资工具"
    ),
    /**
     * 债券核算分类_其他机构间私募投资
     */
    债券核算分类_其他机构间私募投资(
        DictCode.债券核算分类, "JG001", "其他机构间私募投资"
    ),
    /**
     * 债券类型_超短期融资券
     */
    债券类型_超短期融资券(
        DictCode.债券类型, "001", "超短期融资券"
    ),
    /**
     * 债券类型_次级债券
     */
    债券类型_次级债券(
        DictCode.债券类型, "002", "次级债券"
    ),
    /**
     * 债券类型_地方债
     */
    债券类型_地方债(
        DictCode.债券类型, "003", "地方债"
    ),
    /**
     * 债券类型_短期融资券
     */
    债券类型_短期融资券(
        DictCode.债券类型, "004", "短期融资券"
    ),
    /**
     * 债券类型_国债
     */
    债券类型_国债(
        DictCode.债券类型, "005", "国债"
    ),
    /**
     * 债券类型_机构间私募投资
     */
    债券类型_机构间私募投资(
        DictCode.债券类型, "006", "机构间私募投资"
    ),
    /**
     * 债券类型_金融债券
     */
    债券类型_金融债券(
        DictCode.债券类型, "007", "金融债券"
    ),
    /**
     * 债券类型_可分离债券
     */
    债券类型_可分离债券(
        DictCode.债券类型, "008", "可分离债券"
    ),
    /**
     * 债券类型_可交换公司债券
     */
    债券类型_可交换公司债券(
        DictCode.债券类型, "009", "可交换公司债券"
    ),
    /**
     * 债券类型_可转换债券
     */
    债券类型_可转换债券(
        DictCode.债券类型, "010", "可转换债券"
    ),
    /**
     * 债券类型_理财直融融资工具
     */
    债券类型_理财直融融资工具(
        DictCode.债券类型, "011", "理财直融融资工具"
    ),
    /**
     * 债券类型_其他金融债
     */
    债券类型_其他金融债(
        DictCode.债券类型, "012", "其他金融债"
    ),
    /**
     * 债券类型_其他债券
     */
    债券类型_其他债券(
        DictCode.债券类型, "013", "其他债券"
    ),
    /**
     * 债券类型_企业债券
     */
    债券类型_企业债券(
        DictCode.债券类型, "014", "企业债券"
    ),
    /**
     * 债券类型_商业银行债
     */
    债券类型_商业银行债(
        DictCode.债券类型, "015", "商业银行债"
    ),
    /**
     * 债券类型_私募债券
     */
    债券类型_私募债券(
        DictCode.债券类型, "016", "私募债券"
    ),
    /**
     * 债券类型_同业存单
     */
    债券类型_同业存单(
        DictCode.债券类型, "017", "同业存单"
    ),
    /**
     * 债券类型_央行票据
     */
    债券类型_央行票据(
        DictCode.债券类型, "018", "央行票据"
    ),
    /**
     * 债券类型_优先股
     */
    债券类型_优先股(
        DictCode.债券类型, "019", "优先股"
    ),
    /**
     * 债券类型_政策性金融债
     */
    债券类型_政策性金融债(
        DictCode.债券类型, "020", "政策性金融债"
    ),
    /**
     * 债券类型_中期票据
     */
    债券类型_中期票据(
        DictCode.债券类型, "021", "中期票据"
    ),
    /**
     * 债券类型_资产证券
     */
    债券类型_资产证券(
        DictCode.债券类型, "022", "资产证券"
    ),
    /**
     * 资产类型_债券类资产
     */
    资产类型_债券类资产(
        DictCode.资产类型, "01", "债券类资产"
    ),
    /**
     * 资产类型_计划类资产
     */
    资产类型_计划类资产(
        DictCode.资产类型, "02", "计划类资产"
    ),
    /**
     * 拆借核算分类_拆放境内银行业存款类金融机构
     */
    拆借核算分类_拆放境内银行业存款类金融机构(
        DictCode.拆借核算分类, "01", "拆放境内银行业存款类金融机构"
    ),
    /**
     * 拆借核算分类_拆放境内银行业非存款类金融机构
     */
    拆借核算分类_拆放境内银行业非存款类金融机构(
        DictCode.拆借核算分类, "02", "拆放境内银行业非存款类金融机构"
    ),
    /**
     * 拆借核算分类_拆放境内证券业金融机构
     */
    拆借核算分类_拆放境内证券业金融机构(
        DictCode.拆借核算分类, "03", "拆放境内证券业金融机构"
    ),
    /**
     * 拆借核算分类_拆放境内保险业金融机构
     */
    拆借核算分类_拆放境内保险业金融机构(
        DictCode.拆借核算分类, "04", "拆放境内保险业金融机构"
    ),
    /**
     * 拆借核算分类_拆放境内交易及结算类金融机构
     */
    拆借核算分类_拆放境内交易及结算类金融机构(
        DictCode.拆借核算分类, "05", "拆放境内交易及结算类金融机构"
    ),
    /**
     * 拆借核算分类_拆放境内金融控股公司
     */
    拆借核算分类_拆放境内金融控股公司(
        DictCode.拆借核算分类, "06", "拆放境内金融控股公司"
    ),
    /**
     * 拆借核算分类_拆放境内其他金融机构
     */
    拆借核算分类_拆放境内其他金融机构(
        DictCode.拆借核算分类, "07", "拆放境内其他金融机构"
    ),
    /**
     * 拆借核算分类_拆放境内特殊目的载体_SPV
     */
    拆借核算分类_拆放境内特殊目的载体_SPV(
        DictCode.拆借核算分类, "08", "拆放境内特殊目的载体（SPV）"
    ),
    /**
     * 拆借核算分类_拆放境外其他金融机构
     */
    拆借核算分类_拆放境外存款类金融机构(
        DictCode.拆借核算分类, "09", "拆放境外存款类金融机构"
    ),
    /**
     * 拆借核算分类_拆放境外其他金融机构
     */
    拆借核算分类_拆放境外其他金融机构(
        DictCode.拆借核算分类, "10", "拆放境外其他金融机构"
    ),
    /**
     * 清算速度_T加0
     */
    清算速度_T加0(
        DictCode.清算速度, "01", "T+0"
    ),
    /**
     * 清算速度_T加1
     */
    清算速度_T加1(
        DictCode.清算速度, "02", "T+1"
    ),
    /**
     * 分红频率_按日
     */
    分红频率_按日(
        DictCode.分红频率, "01", "按日"
    ),
    /**
     * 分红频率_按月
     */
    分红频率_按月(
        DictCode.分红频率, "02", "按月"
    ),
    /**
     * 损益结转频率_日
     */
    损益结转频率_日(
        DictCode.损益结转频率, "D", "日"
    ),
    /**
     * 损益结转频率_月
     */
    损益结转频率_月(
        DictCode.损益结转频率, "M", "月"
    ),
    /**
     * 损益结转频率_季度
     */
    损益结转频率_季度(
        DictCode.损益结转频率, "Q", "季度"
    ),
    /**
     * 损益结转频率_半年
     */
    损益结转频率_半年(
        DictCode.损益结转频率, "HY", "半年"
    ),
    /**
     * 损益结转频率_年
     */
    损益结转频率_年(
        DictCode.损益结转频率, "Y", "年"
    ),
    /**
     * 证券品种_债券
     */
    证券品种_债券(
        DictCode.证券品种, "01", "债券"
    ),
    /**
     * 证券品种_基金
     */
    证券品种_基金(
        DictCode.证券品种, "02", "基金"
    ),
    /**
     * 计提类型_高频
     */
    计提类型_高频(
        DictCode.计提类型, "01", "高频"
    ),
    /**
     * 计提类型_固定频率
     */
    计提类型_固定频率(
        DictCode.计提类型, "02", "固定频率"
    ),

    /**
     * 生成方式_接口接入
     */
    生成方式_接口接入(
        DictCode.生成方式, "01", "接口接入"
    ),

    /**
     * 生成方式_画面录入
     */
    生成方式_画面录入(
        DictCode.生成方式, "02", "画面录入"
    ),

    /**
     * 生成方式_批处理生成
     */
    生成方式_批处理生成(
        DictCode.生成方式, "03", "批处理生成"
    ),
    /**
     * 生成方式_接口接入
     */
    估值舍入规则_四舍五入(
        DictCode.估值舍入规则, "03", "四舍五入"
    ),
    /**
     * 分组代码_损益平准交_未实现对应查询科目
     */
    分组代码_损益平准交_未实现对应查询科目(
        DictCode.分组代码, "SYPZJWSX_KMCX", "损益平准交_未实现对应查询科目"
    ),
    /**
     * 分组代码_公允价值变动损益对应查询科目
     */
    分组代码_公允价值变动损益对应查询科目(
        DictCode.分组代码, "GYJZBD_KMCX", "公允价值变动损益对应查询科目"
    ),
    /**
     * 分组代码_成本类对应科目查询
     */
    分组代码_成本类对应科目查询(
        DictCode.分组代码, "CBL_KMCX", "成本类对应科目查询"
    ),
    /**
     * 分组代码_非摊余成本对应科目
     */
    分组代码_非摊余成本对应科目(
        DictCode.分组代码, "ACOUT_KMCX", "非摊余成本对应科目"
    ),
    /**
     * 分组代码_非公允价值对应科目
     */
    分组代码_非公允价值对应科目(
        DictCode.分组代码, "FVTPLOUT_KMCX", "非公允价值对应科目"
    ),
    /**
     * 分组代码_非综合收益对应科目
     */
    分组代码_非综合收益对应科目(
        DictCode.分组代码, "FVOCIOUT_KMCX", "非综合收益对应科目"
    ),
    /**
     * 分组代码_摊余成本对应科目
     */
    分组代码_摊余成本对应科目(
        DictCode.分组代码, "AC_KMCX", "摊余成本对应科目"
    ),
    /**
     * 分组代码_公允价值对应科目
     */
    分组代码_公允价值对应科目(
        DictCode.分组代码, "FVTPL_KMCX", "公允价值对应科目"
    ),
    /**
     * 分组代码_综合收益对应科目
     */
    分组代码_综合收益对应科目(
        DictCode.分组代码, "FVOCI_KMCX", "综合收益对应科目"
    ),
    /**
     * 分组代码_现金类对应科目查询
     */
    分组代码_现金类对应科目查询(
        DictCode.分组代码, "XJL_KMCX", "现金类对应科目查询"
    ),
    /**
     * 分组代码_公允价值查询对应科目
     */
    分组代码_公允价值查询对应科目(
        DictCode.分组代码, "GYJZBDZC_KMCX", "公允价值查询对应科目"
    ),
    /**
     * 分支类型_应收本金
     */
    分支类型_应收本金(
        DictCode.分支类型, "D01", "应收本金"
    ),
    /**
     * 分支类型_应收利息
     */
    分支类型_应收利息(
        DictCode.分支类型, "D02", "应收利息"
    ),
    /**
     * 估值舍入规则_舍位
     */
    估值舍入规则_舍位(
        DictCode.估值舍入规则, "02", "舍位"
    ),

    /**
     * 估值舍入规则_批处理生成
     */
    估值舍入规则_进位(
        DictCode.估值舍入规则, "01", "进位"
    ),
    /**
     * 文件类型_估值表
     */
    文件类型_估值表(
        DictCode.文件类型, "01", "估值表"
    ),
    /**
     * 文件类型_余额表
     */
    文件类型_余额表(
        DictCode.文件类型, "02", "余额表"
    ),
    /**
     * 文件类型_操作手册
     */
    文件类型_操作手册(
        DictCode.文件类型, "03", "操作手册"
    ),
    /**
     * 文件类型_余额表
     */
    文件类型_净值确认下发附件(
        DictCode.文件类型, "04", "净值确认下发附件"
    ),
    /**
     * 文件类型_估值表对账文件
     */
    文件类型_估值表对账文件(
        DictCode.文件类型, "05", "估值表对账文件"
    ),
    /**
     * 文件类型_余额表对账文件
     */
    文件类型_余额表对账文件(
        DictCode.文件类型, "06", "余额表对账文件"
    ),
    /**
     * 文件类型_估值表对账结果文件-本系统对比对方系统
     */
    文件类型_估值表对账结果文件_本系统对比对方系统(
        DictCode.文件类型, "07", "估值表对账结果文件-本系统对比对方系统"
    ),
    /**
     * 文件类型_估值表对账结果文件-对方系统对比本系统
     */
    文件类型_估值表对账结果文件_对方系统对比本系统(
        DictCode.文件类型, "08", "估值表对账结果文件-对方系统对比本系统"
    ),
    /**
     * 文件类型_余额表对账结果文件-本系统对比对方系统
     */
    文件类型_余额表对账结果文件_本系统对比对方系统(
        DictCode.文件类型, "09", "余额表对账结果文件-本系统对比对方系统"
    ),
    /**
     * 文件类型_余额表对账结果文件-对方系统对比本系统
     */
    文件类型_余额表对账结果文件_对方系统对比本系统(
        DictCode.文件类型, "10", "余额表对账结果文件-对方系统对比本系统"
    ),
    /**
     * 募集方式_公募
     */
    募集方式_公募(
        DictCode.募集方式, "1", "公募"
    ),
    /**
     * 募集方式_私募
     */
    募集方式_私募(
        DictCode.募集方式, "2", "私募"
    ),
    /**
     * 科目级别_1级
     */
    科目级别_1级(
        DictCode.科目级别, "1", "1级"
    ),
    /**
     * 科目级别_2级
     */
    科目级别_2级(
        DictCode.科目级别, "2", "2级"
    ),
    /**
     * 科目级别_3级
     */
    科目级别_3级(
        DictCode.科目级别, "3", "3级"
    ),
    /**
     * 科目级别_4级
     */
    科目级别_4级(
        DictCode.科目级别, "4", "4级"
    ),

    /**
     * 账套配置表参数项_批处理是否全量
     */
    账套配置表参数项_批处理是否全量(
        DictCode.账套配置表参数项, "IS_ENTIRE", "批处理是否全量"
    ),
    /**
     * 账套配置表参数项_是否分币核算
     */
    账套配置表参数项_是否分币核算(
        DictCode.账套配置表参数项, "IS_DIFF_CCY", "是否分币核算"
    ),
    /**
     * 账套配置表参数项_交易凭证是否合并
     */
    账套配置表参数项_交易凭证是否合并(
        DictCode.账套配置表参数项, "IS_COMB_TRA_VOUC", "交易凭证是否合并"
    ),
    /**
     * 账套配置表参数项_补账凭证是否合并
     */
    账套配置表参数项_补账凭证是否合并(
        DictCode.账套配置表参数项, "IS_COMB_SUP_VOUC", "补账凭证是否合并"
    ),
    /**
     * 账套配置表参数项_补账分录是否合并
     */
    账套配置表参数项_补账分录是否合并(
        DictCode.账套配置表参数项, "IS_COMB_SUP_REC", "补账分录是否合并"
    ),
    /**
     * 账套配置表参数项_分红尾差处理方式
     */
    账套配置表参数项_分红尾差处理方式(
        DictCode.账套配置表参数项, "BONUS_TAIL_MODE", "分红尾差处理方式"
    ),
    /**
     * 账套配置表参数项_活期存款是否计提
     */
    账套配置表参数项_活期存款是否计提(
        DictCode.账套配置表参数项, "DEPOSIT_ACCOUT", "活期存款是否计提"
    ),
    /**
     * 账套配置表参数项_损益结转频率
     */
    账套配置表参数项_损益结转频率(
        DictCode.账套配置表参数项, "CARRYOVER_CYCLE", "损益结转频率"
    ),

    /**
     * 账套配置表参数项_本期利润损益结转频率
     */
    账套配置表参数项_本期利润损益结转频率(
        DictCode.账套配置表参数项, "UP_CARRYOVER_CYCLE", "本期利润损益结转频率"
    ),

    /**
     * 账套配置表参数项_损益平准金结转频率
     */
    账套配置表参数项_损益平准金结转频率(
        DictCode.账套配置表参数项, "PAL_CARRYOVER_CYCLE", "损益平准金结转频率"
    ),
    /**
     * 账套配置表参数项_产品费用计提方式_固定管理费
     */
    账套配置表参数项_产品费用计提方式_固定管理费(
        DictCode.账套配置表参数项, "PRD_FEE_ACCR_TYPE_C03", "产品费用计提方式_固定管理费"
    ),
    /**
     * 账套配置表参数项_产品费用计提方式_浮动管理费
     */
    账套配置表参数项_产品费用计提方式_浮动管理费(
        DictCode.账套配置表参数项, "PRD_FEE_ACCR_TYPE_C04", "产品费用计提方式_浮动管理费"
    ),
    /**
     * 账套配置表参数项_
     */
    账套配置表参数项_产品费用计提方式_托管费(
        DictCode.账套配置表参数项, "PRD_FEE_ACCR_TYPE_C05", "产品费用计提方式_托管费"
    ),
    /**
     * 账套配置表参数项_产品费用计提方式_销售费
     */
    账套配置表参数项_产品费用计提方式_销售费(
        DictCode.账套配置表参数项, "PRD_FEE_ACCR_TYPE_C06", "产品费用计提方式_销售费"
    ),
    /**
     * 账套配置表参数项_产品费用计提方式_外包服务费
     */
    账套配置表参数项_产品费用计提方式_外包服务费(
        DictCode.账套配置表参数项, "PRD_FEE_ACCR_TYPE_C09", "产品费用计提方式_外包服务费"
    ),
    /**
     * 账套配置表参数项_产品费用计提方式_代销费
     */
    账套配置表参数项_产品费用计提方式_代销费(
        DictCode.账套配置表参数项, "PRD_FEE_ACCR_TYPE_C10", "产品费用计提方式_代销费"
    ),
    /**
     * 账套配置表参数项_回购计提方式_质押式
     */
    账套配置表参数项_回购计提方式_质押式(
        DictCode.账套配置表参数项, "REPO_ACCR_TYPE_F02_F03", "回购计提方式_质押式"
    ),
    /**
     * 账套配置表参数项_回购计提方式_买断式
     */
    账套配置表参数项_回购计提方式_买断式(
        DictCode.账套配置表参数项, "REPO_ACCR_TYPE_F04_F05", "回购计提方式_买断式"
    ),
    /**
     * 账套配置表参数项_拆借计提方式
     */
    账套配置表参数项_拆借计提方式(
        DictCode.账套配置表参数项, "DL_ACCR_TYPE", "拆借计提方式"
    ),
    /**
     * 账套配置表参数项_存款计提方式
     */
    账套配置表参数项_存款计提方式(
        DictCode.账套配置表参数项, "DEPO_ACCR_TYPE", "存款计提方式"
    ),
    /**
     * 账套配置表参数项_产品利息计提方式
     */
    账套配置表参数项_产品利息计提方式(
        DictCode.账套配置表参数项, "PRD_INT_ACCR_TYPE", "产品利息计提方式"
    ),
    /**
     * 账套配置表参数项_产品是否本系统计提
     */
    账套配置表参数项_产品是否本系统计提(
        DictCode.账套配置表参数项, "IS_PRD_INT_ACCR", "产品是否本系统计提"
    ),
    /**
     * 账套配置表参数项_估值表模板
     */
    账套配置表参数项_估值表模板(
        DictCode.账套配置表参数项, "VALUATION_TEMPLATE", "估值表模板"
    ),

    /**
     * 分红尾差处理方式_无需处理
     */
    分红尾差处理方式_无需处理(
        DictCode.分红尾差处理方式, "01", "无需处理"
    ),
    /**
     * 分红尾差处理方式_确认为当期损益
     */
    分红尾差处理方式_确认为当期损益(
        DictCode.分红尾差处理方式, "02", "确认为当期损益"
    ),
    /**
     * 收益标识_非保本浮动
     */
    收益标识_非保本浮动(
        DictCode.收益标识, "03", "非保本浮动"
    ),
    /**
     * 收益标识_保本浮动
     */
    收益标识_保本浮动(
        DictCode.收益标识, "02", "保本浮动"
    ),
    /**
     * 收益标识_保本
     */
    收益标识_保本(
        DictCode.收益标识, "01", "保本"
    ),
    /**
     * 计提规则_区间累计
     */
    计提规则_区间累计(
        DictCode.计提规则, "1", "区间累计"
    ),
    /**
     * 计提规则_每日计提
     */
    计提规则_每日计提(
        DictCode.计提规则, "2", "每日计提"
    ),
    /**
     * 账套配置表参数项_估值小数位处理方式
     */
    账套配置表参数项_估值小数位处理方式(
        DictCode.账套配置表参数项, "VAL_DEC_TYPE", "估值小数位处理方式"
    ),
    /**
     * 账套配置表参数项_估值小数位位数
     */
    账套配置表参数项_估值小数位位数(
        DictCode.账套配置表参数项, "VAL_DEC_DIGITS", "估值小数位位数"
    ),
    /**
     * 账套配置表参数项_收益率小数位处理方式
     */
    账套配置表参数项_收益率小数位处理方式(
        DictCode.账套配置表参数项, "YEILD_DEC_TYPE", "收益率小数位处理方式"
    ),
    /**
     * 账套配置表参数项_收益率小数位位数
     */
    账套配置表参数项_收益率小数位位数(
        DictCode.账套配置表参数项, "YEILD_DEC_DIGITS", "收益率小数位位数"
    ),
    /**
     * 账套配置表参数项_万份收益小数位位数
     */
    账套配置表参数项_万份收益小数位位数(
        DictCode.账套配置表参数项, "PYEILD_DEC_DIGITS", "万份收益小数位位数"
    ),
    /**
     * 账套配置表参数项_份额小数位位数
     */
    账套配置表参数项_份额小数位位数(
        DictCode.账套配置表参数项, "SHARE_DEC_DIGITS", "份额小数位位数"
    ),
    /**
     * 账套配置表参数项_买断式回购费用处理方式
     */
    账套配置表参数项_收益类型(
        DictCode.账套配置表参数项, "PROFIT_TYPE", "收益类型"
    ),
    /**
     * 账套配置表参数项_银行间质押式回购费用处理方式
     */
    账套配置表参数项_银行间质押式回购费用处理方式(
        DictCode.账套配置表参数项, "IB_C_REP_FEE_EXE_TYPE", "银行间质押式回购费用处理方式"
    ),
    /**
     * 账套配置表参数项_交易所质押式回购费用处理方式
     */
    账套配置表参数项_交易所质押式回购费用处理方式(
        DictCode.账套配置表参数项, "TRA_C_REP_FEE_EXE_TYPE", "交易所质押式回购费用处理方式"
    ),
    /**
     * 账套配置表参数项_银行间买断式回购费用处理方式
     */
    账套配置表参数项_银行间买断式回购费用处理方式(
        DictCode.账套配置表参数项, "IB_O_REP_FEE_EXE_TYPE", "银行间买断式回购费用处理方式"
    ),
    /**
     * 账套配置表参数项_交易所买断式回购费用处理方式
     */
    账套配置表参数项_交易所买断式回购费用处理方式(
        DictCode.账套配置表参数项, "TRA_O_REP_FEE_EXE_TYPE", "交易所买断式回购费用处理方式"
    ),
    /**
     * 账套配置表参数项_债券交易费用损益计入方式
     */
    账套配置表参数项_债券交易费用损益计入方式(
        DictCode.账套配置表参数项, "SEC_DEAL_FEE_SUBJECT", "债券交易费用损益计入方式"
    ),
    /**
     * 账套配置表参数项_债券借贷计提方式
     */
    账套配置表参数项_债券借贷计提方式(
        DictCode.账套配置表参数项, "SECLEND_ACCR_TYPE", "债券借贷计提方式"
    ),
    /**
     * 业绩报酬计算规则_业绩基准
     */
    业绩报酬计算规则_业绩基准(
        DictCode.业绩报酬计算规则, "01", "业绩基准"
    ),
    /**
     * 业绩报酬计算规则_高水位法
     */
    业绩报酬计算规则_高水位法(
        DictCode.业绩报酬计算规则, "02", "高水位法"
    ),
    /**
     * 生效规则_期初
     */
    生效规则_期初(
        DictCode.生效规则, "01", "期初"
    ),
    /**
     * 生效规则_期末
     */
    生效规则_期末(
        DictCode.生效规则, "02", "期末"
    ),
    /**
     * 资产净值日_前一日
     */
    资产净值日_前一日(
        DictCode.资产净值日, "01", "前一日"
    ),
    /**
     * 资产净值日_上一开放日
     */
    资产净值日_上一开放日(
        DictCode.资产净值日, "02", "上一开放日"
    ),
    /**
     * 资产净值日_当日
     */
    资产净值日_当日(
        DictCode.资产净值日, "03", "当日"
    ), 估值来源_中债登_CBC(
        DictCode.估值来源, "CBC", "中债登(CBC)"
    ), 估值来源_中证登_CSD(
        DictCode.估值来源, "CSD", "中证登(CSD)"
    ), 估值来源_上清所_SCH(
        DictCode.估值来源, "SCH", "上清所(SCH)"
    ), 估值来源_专家法_EXP(
        DictCode.估值来源, "EXP", "专家法(EXP)"
    ),
    /**
     * 回购费用处理方式_不计入成本
     */
    回购费用处理方式_不计入成本(
        DictCode.回购费用处理方式, "01", "不计入成本"
    ),
    /**
     * 回购费用处理方式_计入成本
     */
    回购费用处理方式_计入成本(
        DictCode.回购费用处理方式, "02", "计入成本"
    ),
    /**
     * 交易方向_债券派息
     */
    交易方向_债券派息(
        DictCode.交易方向, "T27", "债券派息"
    ),
    /**
     * 买断式正回购_派息
     */
    买断式正回购_派息(
        DictCode.交易方向, "1414", "债券派息"
    ),
    /**
     * 买断式逆回购_派息
     */
    买断式逆回购_派息(
        DictCode.交易方向, "1413", "债券派息"
    ),
    /**
     * 配置方案类型_估值方案
     */
    配置方案类型_估值方案(
        DictCode.配置方案类型, "01", "估值方案"
    ),
    /**
     * 配置方案类型_税务方案
     */
    配置方案类型_税务方案(
        DictCode.配置方案类型, "02", "税务方案"
    ),
    /**
     * 配置方案类型_影子定价方案
     */
    配置方案类型_影子定价方案(
        DictCode.配置方案类型, "03", "影子定价方案"
    ),
    /**
     * 配置方案类型_对账方案
     */
    配置方案类型_估值表对账方案(
        DictCode.配置方案类型, "04", "估值表对账方案"
    ),
    /**
     * 配置方案类型_对账方案
     */
    配置方案类型_余额表对账方案(
        DictCode.配置方案类型, "05", "余额表对账方案"
    ),
    /**
     * 增值税_计算方式_发生额计算
     */
    增值税_计算方式_发生额计算(
        DictCode.增值税_计算方式, "01", "发生额计算"
    ),
    /**
     * 增值税_计算方式_占比计算
     */
    增值税_计算方式_占比计算(
        DictCode.增值税_计算方式, "02", "占比计算"
    ),
    /**
     * 增值税_计算方式_发生额累加
     */
    增值税_计算方式_发生额累加(
        DictCode.增值税_计算方式, "03", "发生额累加"
    ),
    /**
     * 对账状态_未对账
     */
    对账状态_未对账(
        DictCode.对账状态, "0", "未对账"
    ),
    /**
     * 对账状态_已对账
     */
    对账状态_已对账(
        DictCode.对账状态, "1", "已对账"
    ),
    /**
     * 对账结果_对账不一致
     */
    对账结果_对账不一致(
        DictCode.对账结果, "0", "对账不一致"
    ),
    /**
     * 对账结果_对账一致
     */
    对账结果_对账一致(
        DictCode.对账结果, "1", "对账一致"
    ),
    /**
     * 确认状态_未确认
     */
    确认状态_未确认(
        DictCode.确认状态, "0", "未确认"
    ),
    /**
     * 确认状态_已确认
     */
    确认状态_已确认(
        DictCode.确认状态, "1", "已确认"
    ),
    /**
     * 下发状态_未下发
     */
    下发状态_未下发(
        DictCode.下发状态, "0", "未下发"
    ),
    /**
     * 下发状态_下发成功
     */
    下发状态_下发成功(
        DictCode.下发状态, "1", "下发成功"
    ),
    /**
     * 下发状态_下发失败
     */
    下发状态_下发失败(
        DictCode.下发状态, "2", "下发失败"
    ),

    /**
     * 税类型_预估利息收入
     */
    税类型_预估利息收入(
        DictCode.税类型, "TAX0101", "预估利息收入"
    ),
    /**
     * 税类型_利息收入
     */
    税类型_利息收入(
        DictCode.税类型, "TAX0102", "利息收入"
    ),
    /**
     * 税类型_预估红利收入
     */
    税类型_预估红利收入(
        DictCode.税类型, "TAX0201", "预估红利收入"
    ),
    /**
     * 税类型_红利收入
     */
    税类型_红利收入(
        DictCode.税类型, "TAX0202", "红利收入"
    ),
    /**
     * 税类型_预估价差收入
     */
    税类型_预估价差收入(
        DictCode.税类型, "TAX0301", "预估价差收入"
    ),
    /**
     * 税类型_价差收入
     */
    税类型_价差收入(
        DictCode.税类型, "TAX0302", "价差收入"
    ),
    /**
     * 税类型_预估城建税
     */
    税类型_预估城建税(
        DictCode.税类型, "ALT0101", "预估城建税"
    ),
    /**
     * 税类型_城建税
     */
    税类型_城建税(
        DictCode.税类型, "ALT0102", "城建税"
    ),
    /**
     * 税类型_预估教育费
     */
    税类型_预估教育费(
        DictCode.税类型, "ALT0201", "预估教育费"
    ),
    /**
     * 税类型_教育费
     */
    税类型_教育费(
        DictCode.税类型, "ALT0202", "教育费"
    ),
    /**
     * 税类型_预估地方教育费
     */
    税类型_预估地方教育费(
        DictCode.税类型, "ALT0301", "预估地方教育费"
    ),
    /**
     * 税类型_地方教育费
     */
    税类型_地方教育费(
        DictCode.税类型, "ALT0302", "地方教育费"
    ),

    /**
     * 增值税类型_利息收入
     */
    增值税类型_利息收入(
        DictCode.增值税类型, "TAX0102", "利息收入"
    ),
    /**
     * 增值税类型_红利收入
     */
    增值税类型_红利收入(
        DictCode.增值税类型, "TAX0202", "红利收入"
    ),
    /**
     * 增值税类型_价差收入
     */
    增值税类型_价差收入(
        DictCode.增值税类型, "TAX0302", "价差收入"
    ),
    /**
     * 附加税类型_城建税
     */
    附加税类型_城建税(
        DictCode.附加税类型, "ALT0102", "城建税"
    ),
    /**
     * 附加税类型_教育税
     */
    附加税类型_教育税(
        DictCode.附加税类型, "ALT0202", "教育税"
    ),
    /**
     * 附加税类型_地方教育税
     */
    附加税类型_地方教育税(
        DictCode.附加税类型, "ALT0302", "地方教育税"
    ),
    /**
     * 增值税类型2_贷款业务收入
     */
    增值税类型2_贷款业务收入(
        DictCode.增值税类型2, "01", "贷款业务收入"
    ),
    /**
     * 增值税类型2_金融商品转让收入
     */
    增值税类型2_金融商品转让收入(
        DictCode.增值税类型2, "02", "金融商品转让收入"
    ),
    /**
     * 基金核算类型_EFT基金
     */
    基金核算类型_EFT基金(
        DictCode.基金核算类型, "01", "EFT基金"
    ),
    /**
     * 基金核算类型_LOF基金
     */
    基金核算类型_LOF基金(
        DictCode.基金核算类型, "02", "LOF基金"
    ),
    /**
     * 基金核算类型_非货币基金
     */
    基金核算类型_非货币基金(
        DictCode.基金核算类型, "03", "非货币基金"
    ),
    /**
     * 增项减项_计入增项
     */
    增项减项_计入增项(
        DictCode.增项减项, "01", "计入增项"
    ),
    /**
     * 增项减项_计入减项
     */
    增项减项_计入减项(
        DictCode.增项减项, "02", "计入减项"
    ),
    /**
     * 增值税_确认类型_预估计税
     */
    增值税_确认类型_预估计税(
        DictCode.增值税_确认类型, "01", "预估计税"
    ),
    /**
     * 增值税_确认类型_发生计税
     */
    增值税_确认类型_发生计税(
        DictCode.增值税_确认类型, "02", "发生计税"
    ),
    /**
     * 增值税_计税方式_免税
     */
    增值税_计税方式_免税(
        DictCode.增值税_计税方式, "01", "免税"
    ),
    /**
     * 增值税_计税方式_不征税
     */
    增值税_计税方式_不征税(
        DictCode.增值税_计税方式, "02", "不征税"
    ),
    /**
     * 增值税_计税方式_简易计税
     */
    增值税_计税方式_简易计税(
        DictCode.增值税_计税方式, "03", "简易计税"
    ),
    /**
     * 增值税_占比比例_收益占比
     */
    增值税_占比比例_收益占比(
        DictCode.增值税_占比比例, "01", "收益占比"
    ),
    /**
     * 增值税_占比比例_成本占比
     */
    增值税_占比比例_成本占比(
        DictCode.增值税_占比比例, "02", "成本占比"
    ),
    /**
     * 增值税_占比比例_带留存占比
     */
    增值税_占比比例_带留存占比(
        DictCode.增值税_占比比例, "03", "带留存占比"
    ),
    /**
     * 增值税_占比比例_全额占比
     */
    增值税_占比比例_全额占比(
        DictCode.增值税_占比比例, "04", "全额占比"
    ),

    /**
     * 免税收入_36号文件
     */
    免税收入_36号文件(
        DictCode.免税收入类型, "01", "36号文件"
    ),
    /**
     * 免税收入_46号文件
     */
    免税收入_46号文件(
        DictCode.免税收入类型, "02", "46号文件"
    ),
    /**
     * 免税收入_70号文件
     */
    免税收入_70号文件(
        DictCode.免税收入类型, "03", "70号文件"
    ),
    /**
     * 免税收入_国债及地方债
     */
    免税收入_国债及地方债(
        DictCode.免税收入类型, "04", "国债及地方债"
    ),

    /**
     * 复制范围_增值税则表
     */
    复制范围_增值税则表(
        DictCode.复制范围, "01", "增值税则表"
    ),
    /**
     * 复制范围_附加税则表
     */
    复制范围_附加税则表(
        DictCode.复制范围, "02", "附加税则表"
    ),
    /**
     * 复制范围_资产应税信息
     */
    复制范围_资产应税信息(
        DictCode.复制范围, "03", "资产应税信息"
    ),
    /**
     * 复制范围_参数设置
     */
    复制范围_参数设置(
        DictCode.复制范围, "04", "参数设置"
    ),

    /**
     * 增值税资产分类_活期存款_活期存款
     */
    增值税_资产分类_活期存款(
        DictCode.增值税_资产分类, "C01", "活期存款"
    ),
    /**
     * 增值税_资产分类_质押式回购_逆回购
     */
    增值税_资产分类_质押式回购_逆回购(
        DictCode.增值税_资产分类, "G01", "质押式回购-逆回购"
    ),
    /**
     * 增值税_资产分类_买断式回购_逆回购
     */
    增值税_资产分类_买断式回购_逆回购(
        DictCode.增值税_资产分类, "G02", "买断式回购-逆回购"
    ),
    /**
     * 增值税_资产分类_拆借_拆出
     */
    增值税_资产分类_拆借_拆出(
        DictCode.增值税_资产分类, "H01", "拆借-拆出"
    ),
    /**
     * 增值税_资产分类_拆借_同业借款
     */
    增值税_资产分类_拆借_同业借款(
        DictCode.增值税_资产分类, "I01", "拆借-同业借款"
    ),

    /**
     * 生成状态_未生成
     */
    生成状态_未生成(
        DictCode.生成状态, "0", "未生成"
    ),

    /**
     * 生成状态_生成成功
     */
    生成状态_生成成功(
        DictCode.生成状态, "1", "生成成功"
    ),

    /**
     * 生成状态_生成失败
     */
    生成状态_生成失败(
        DictCode.生成状态, "2", "生成失败"
    ),

    /**
     * 生成状态_已生成（无错误凭证）
     */
    生成状态_已生成_无错误凭证(
        DictCode.生成状态, "3", "已生成（无错误凭证）"
    ),

    /**
     * 生成状态_已生成（有错误凭证）
     */
    生成状态_已生成_有错误凭证(
        DictCode.生成状态, "4", "已生成（有错误凭证）"
    ),
    /**
     * 费前费后区分_费前
     */
    费前费后区分_费前(
        DictCode.费前费后区分, "01", "费前"
    ),
    /**
     * 费前费后区分_费后
     */
    费前费后区分_费后(
        DictCode.费前费后区分, "02", "费后"
    ),
    /**
     * 分录类型_正常记账
     */
    分录类型_正常记账(
        DictCode.分录类型, "01", "正常记账"
    ),
    /**
     * 分录类型_单边记账
     */
    分录类型_单边记账(
        DictCode.分录类型, "02", "单边记账"
    ),
    /**
     * 分录类型_同向记账
     */
    分录类型_同向记账(
        DictCode.分录类型, "03", "同向记账"
    ),

    /**
     * 估值表类型_科目明细列表
     */
    估值表类型_科目明细列表(
        DictCode.估值表类型, "01", "科目明细列表"
    ),

    /**
     * 估值表类型_实收资本
     */
    估值表类型_实收资本(
        DictCode.估值表类型, "02", "实收资本"
    ),
    /**
     * 估值表类型_损益平准金未实现
     */
    估值表类型_损益平准金未实现(
        DictCode.估值表类型, "03", "损益平准金未实现"
    ),
    /**
     * 估值表类型_损益平准金已实现
     */
    估值表类型_损益平准金已实现(
        DictCode.估值表类型, "04", "损益平准金已实现"
    ),
    /**
     * 估值表类型_资产类合计
     */
    估值表类型_资产类合计(
        DictCode.估值表类型, "05", "资产类合计"
    ),
    /**
     * 估值表类型_负债类合计
     */
    估值表类型_负债类合计(
        DictCode.估值表类型, "06", "负债类合计"
    ),
    /**
     * 估值表类型_产品资产净值
     */
    估值表类型_产品资产净值(
        DictCode.估值表类型, "07", "产品资产净值"
    ),
    /**
     * 估值表类型_产品单位净值
     */
    估值表类型_产品单位净值(
        DictCode.估值表类型, "08", "产品单位净值"
    ),
    /**
     * 估值表类型_证券投资合计
     */
    估值表类型_证券投资合计(
        DictCode.估值表类型, "09", "证券投资合计"
    ),
    /**
     * 估值表类型_其中股票投资
     */
    估值表类型_其中股票投资(
        DictCode.估值表类型, "10", "其中股票投资"
    ),
    /**
     * 估值表类型_其中债券投资
     */
    估值表类型_其中债券投资(
        DictCode.估值表类型, "11", "其中债券投资"
    ),
    /**
     * 估值表类型_其中基金投资
     */
    估值表类型_其中基金投资(
        DictCode.估值表类型, "12", "其中基金投资"
    ),
    /**
     * 估值表类型_其中权证投资
     */
    估值表类型_其中权证投资(
        DictCode.估值表类型, "13", "其中权证投资"
    ),
    /**
     * 估值表类型_融资业务合计
     */
    估值表类型_融资业务合计(
        DictCode.估值表类型, "14", "融资业务合计"
    ),
    /**
     * 估值表类型_融券业务合计
     */
    估值表类型_融券业务合计(
        DictCode.估值表类型, "15", "融券业务合计"
    ),
    /**
     * 估值表类型_今日可用头寸
     */
    估值表类型_今日可用头寸(
        DictCode.估值表类型, "16", "今日可用头寸"
    ),
    /**
     * 估值表类型_产品累计单位净值
     */
    估值表类型_产品累计单位净值(
        DictCode.估值表类型, "17", "产品累计单位净值"
    ),
    /**
     * 估值表类型_昨日单位净值
     */
    估值表类型_昨日单位净值(
        DictCode.估值表类型, "18", "昨日单位净值"
    ),
    /**
     * 估值表类型_成立以来净值增长率(%)
     */
    估值表类型_成立以来净值增长率(
        DictCode.估值表类型, "19", "成立以来净值增长率(%)"
    ),
    /**
     * 估值表类型_净值年增长率（%）
     */
    估值表类型_净值年增长率(
        DictCode.估值表类型, "20", "净值年增长率（%）"
    ),
    /**
     * 估值表类型_净值季度增长率(%)
     */
    估值表类型_净值季度增长率(
        DictCode.估值表类型, "21", "净值季度增长率(%)"
    ),
    /**
     * 估值表类型_净值月增长率(%)
     */
    估值表类型_净值月增长率(
        DictCode.估值表类型, "22", "净值月增长率(%)"
    ),
    /**
     * 估值表类型_净值周增长率(%)
     */
    估值表类型_净值周增长率(
        DictCode.估值表类型, "23", "净值周增长率(%)"
    ),
    /**
     * 估值表类型_净值日增长率(%)
     */
    估值表类型_净值日增长率(
        DictCode.估值表类型, "24", "净值日增长率(%)"
    ),
    /**
     * 估值表类型_影子价格单位净值
     */
    估值表类型_影子价格单位净值(
        DictCode.估值表类型, "25", "影子价格单位净值"
    ),
    /**
     * 估值表类型_偏离金额
     */
    估值表类型_偏离金额(
        DictCode.估值表类型, "26", "偏离金额"
    ),
    /**
     * 估值表类型_偏离度
     */
    估值表类型_偏离度(
        DictCode.估值表类型, "27", "偏离度"
    ),
    /**
     * 估值表类型_产品本日收益
     */
    估值表类型_产品本日收益(
        DictCode.估值表类型, "28", "产品本日收益"
    ),
    /**
     * 估值表类型_万份收益
     */
    估值表类型_万份收益(
        DictCode.估值表类型, "29", "万份收益"
    ),
    /**
     * 估值表类型_本年累积万份收益
     */
    估值表类型_本年累积万份收益(
        DictCode.估值表类型, "30", "本年累积万份收益"
    ),
    /**
     * 估值表类型_从成立以来累计万份收益
     */
    估值表类型_从成立以来累计万份收益(
        DictCode.估值表类型, "31", "从成立以来累计万份收益"
    ),
    /**
     * 估值表类型_本日年化收益率
     */
    估值表类型_本日年化收益率(
        DictCode.估值表类型, "32", "本日年化收益率"
    ),
    /**
     * 估值表类型_7日年化收益率
     */
    估值表类型_7日年化收益率(
        DictCode.估值表类型, "33", "7日年化收益率"
    ),
    /**
     * 估值表类型_投资组合平均到期日
     */
    估值表类型_投资组合平均到期日(
        DictCode.估值表类型, "34", "投资组合平均到期日"
    ),
    /**
     * 估值表类型_剩余存续期
     */
    估值表类型_剩余存续期(
        DictCode.估值表类型, "35", "剩余存续期"
    ),
    /**
     * 估值表类型_当日客户收益
     */
    估值表类型_当日客户收益(
        DictCode.估值表类型, "36", "当日客户收益"
    ),
    /**
     * 估值表类型_当日客户收益
     */
    估值表类型_累计客户收益(
        DictCode.估值表类型, "37", "累计客户收益"
    ),
    /**
     * 估值表类型_当日客户收益
     */
    估值表类型_当日客户收益率(
        DictCode.估值表类型, "38", "当日客户收益率"
    ),
    /**
     * 估值表类型_分层
     */
    估值表类型_分层(
        DictCode.估值表类型, "00", "分层"
    ),
    /**
     * 公允价值变动计提日类型_交易日
     */
    公允价值变动计提日类型_交易日(
        DictCode.公允价值变动计提日类型, "01", "交易日"
    ),
    /**
     * 公允价值变动计提日类型_交割日
     */
    公允价值变动计提日类型_交割日(
        DictCode.公允价值变动计提日类型, "02", "交割日"
    ),
    /**
     * 期限品种_回购_1天
     */
    期限品种_回购_未知(
        DictCode.期限品种_回购, "R0", "未知"
    ),
    /**
     * 期限品种_回购_1天
     */
    期限品种_回购_1天(
        DictCode.期限品种_回购, "R001", "1天"
    ),
    /**
     * 期限品种_回购_7天
     */
    期限品种_回购_7天(
        DictCode.期限品种_回购, "R007", "7天"
    ),
    /**
     * 期限品种_回购_14天
     */
    期限品种_回购_14天(
        DictCode.期限品种_回购, "R014", "14天"
    ),
    /**
     * 期限品种_回购_21天
     */
    期限品种_回购_21天(
        DictCode.期限品种_回购, "R021", "21天"
    ),
    /**
     * 期限品种_回购_1个月
     */
    期限品种_回购_1个月(
        DictCode.期限品种_回购, "R1M", "1个月"
    ),
    /**
     * 期限品种_回购_2个月
     */
    期限品种_回购_2个月(
        DictCode.期限品种_回购, "R2M", "2个月"
    ),
    /**
     * 期限品种_回购_3个月
     */
    期限品种_回购_3个月(
        DictCode.期限品种_回购, "R3M", "3个月"
    ),
    /**
     * 期限品种_回购_4个月
     */
    期限品种_回购_4个月(
        DictCode.期限品种_回购, "R4M", "4个月"
    ),
    /**
     * 期限品种_回购_6个月
     */
    期限品种_回购_6个月(
        DictCode.期限品种_回购, "R6M", "6个月"
    ),
    /**
     * 期限品种_回购_9个月
     */
    期限品种_回购_9个月(
        DictCode.期限品种_回购, "R9M", "9个月"
    ),
    /**
     * 期限品种_回购_1年
     */
    期限品种_回购_1年(
        DictCode.期限品种_回购, "R1Y", "1年"
    ),
    /**
     * 亏损处理方式_缩减当前份额
     */
    亏损处理方式_缩减当前份额(
        DictCode.亏损处理方式, "01", "缩减当前份额"
    ),
    /**
     * 亏损处理方式_缩减当前份额
     */
    亏损处理方式_延至下期处理(
        DictCode.亏损处理方式, "02", "延至下期处理"
    ),

    /**
     * 基金分红频率_日
     */
    基金分红频率_日(
        DictCode.基金分红频率, "D", "日"
    ),
    /**
     * 基金分红频率_月
     */
    基金分红频率_月(
        DictCode.基金分红频率, "M", "月"
    ),
    /**
     * 基金分红频率_季度
     */
    基金分红频率_季度(
        DictCode.基金分红频率, "Q", "季度"
    ),
    /**
     * 基金分红频率_半年
     */
    基金分红频率_半年(
        DictCode.基金分红频率, "HY", "半年"
    ),
    /**
     * 基金分红频率_年
     */
    基金分红频率_年(
        DictCode.基金分红频率, "Y", "年"
    ),
    /**
     * 计提方式_区间倒减
     */
    计提方式_区间倒减(
        DictCode.计提方式, "01", "区间倒减"
    ),
    /**
     * 计提方式_每日新增
     */
    计提方式_每日新增(
        DictCode.计提方式, "02", "每日新增"
    ),

    /**
     * 行情类型_利率行情
     */
    行情类型_利率行情(
        DictCode.行情类型, "01", "利率行情"
    ),
    /**
     * 行情类型_汇率行情
     */
    行情类型_汇率行情(
        DictCode.行情类型, "02", "汇率行情"
    ),
    /**
     * 行情类型_指数行情
     */
    行情类型_指数行情(
        DictCode.行情类型, "03", "指数行情"
    ),
    /**
     * 基准类型_利率
     */
    基准类型_利率(
        DictCode.基准类型, "01", "利率"
    ),
    /**
     * 基准类型_汇率
     */
    基准类型_汇率(
        DictCode.基准类型, "02", "汇率"
    ),
    /**
     * 基准类型_指数
     */
    基准类型_指数(
        DictCode.基准类型, "03", "指数"
    ),
    /**
     * 基准类型_混合
     */
    基准类型_混合(
        DictCode.基准类型, "04", "混合"
    ),
    /**
     * 重置类型_固定频率重置
     */
    重置类型_固定频率重置(
        DictCode.重置类型, "01", "固定频率重置"
    ),
    /**
     * 重置类型_指定日期重置
     */
    重置类型_指定日期重置(
        DictCode.重置类型, "02", "指定日期重置"
    ),
    /**
     * 重置类型_随调
     */
    重置类型_随调(
        DictCode.重置类型, "03", "随调"
    ),
    /**
     * 重置类型_下个付息期生效
     */
    重置类型_下个付息期生效(
        DictCode.重置类型, "04", "下个付息期生效"
    ),

    /**
     * 期限品种_拆借_隔夜
     */
    期限品种_拆借_隔夜(
        DictCode.期限品种_拆借, "IB0001", "隔夜"
    ),
    /**
     * 期限品种_拆借_7天
     */
    期限品种_拆借_7天(
        DictCode.期限品种_拆借, "IB0007", "7天"
    ),
    /**
     * 期限品种_拆借_14天
     */
    期限品种_拆借_14天(
        DictCode.期限品种_拆借, "IB0014", "14天"
    ),
    /**
     * 期限品种_拆借_21天
     */
    期期限品种_拆借_21天(
        DictCode.期限品种_拆借, "IB0021", "21天"
    ),
    /**
     * 期期限品种_拆借_1个月
     */
    期期限品种_拆借_1个月(
        DictCode.期限品种_拆借, "IB01M", "1个月"
    ),
    /**
     * 期期限品种_拆借_2个月
     */
    期期限品种_拆借_2个月(
        DictCode.期限品种_拆借, "IB02M", "2个月"
    ),
    /**
     * 期期限品种_拆借_3个月
     */
    期期限品种_拆借_3个月(
        DictCode.期限品种_拆借, "IB03M", "3个月"
    ),
    /**
     * 期期限品种_拆借_6个月
     */
    期期限品种_拆借_6个月(
        DictCode.期限品种_拆借, "IB06M", "6个月"
    ),
    
    /**
     * 期期限品种_拆借_9个月
     */
    期期限品种_拆借_9个月(
        DictCode.期限品种_拆借, "IB09M", "9个月"
    ),
    
    /**
     * 期期限品种_拆借_12个月
     */
    期期限品种_拆借_12个月(
        DictCode.期限品种_拆借, "IB12M", "12个月"
    ),
    /**
     * 期期限品种_拆借_1年以上
     */
    期期限品种_拆借_1年以上(
        DictCode.期限品种_拆借, "IB1Y", "1年以上"
    ),

    估值核算业务类型_账套日期(
        DictCode.估值核算业务类型, "V01", "账套日期"
    ), 估值核算业务类型_净值下发确认(
        DictCode.估值核算业务类型, "V02", "净值下发确认"
    ), 估值核算业务类型_手工凭证(
        DictCode.估值核算业务类型, "V03", "手工凭证"
    ), 估值核算业务类型_计划类资产净值信息(
        DictCode.估值核算业务类型, "V04", "计划类资产净值信息"
    ), 估值核算业务类型_债券重分类(
        DictCode.估值核算业务类型, "V05", "债券重分类"
    ), 估值核算业务类型_债券类资产信息(
        DictCode.估值核算业务类型, "V06", "债券类资产信息"
    ), 估值核算业务类型_金融交易删除(
        DictCode.估值核算业务类型, "V07", "金融交易删除"
    ), 估值核算业务类型_账套管理(
        DictCode.估值核算业务类型, "V08", "账套管理"
    ), 估值核算业务类型_账户活期利率删除(
        DictCode.估值核算业务类型, "V09", "账户活期利率"
    ), 估值核算业务类型_基金类资产(
        DictCode.估值核算业务类型, "V10", "基金类资产"
    ), 估值核算业务类型_存款类资产(
        DictCode.估值核算业务类型, "V11", "存款类资产"
    ), 估值核算业务类型_影子定价方案(
        DictCode.估值核算业务类型, "V12", "影子定价方案"
    ), 估值核算业务类型_估值方法方案(
        DictCode.估值核算业务类型, "V13", "估值方法方案"
    ),估值核算业务类型_税务方案(
        DictCode.估值核算业务类型, "V14", "税务方案"
    ),估值核算业务类型_资产摊销(
        DictCode.估值核算业务类型, "V15", "资产摊销"
    ),估值核算业务类型_债券估值行情(
        DictCode.估值核算业务类型, "V16", "债券估值行情"
    ),

    /**
     * 报表期限类型_日报
     */
    报表期限类型_日报(
        DictCode.报表期限类型, "01", "日报"
    ),
    /**
     * 报表期限类型_月报
     */
    报表期限类型_月报(
        DictCode.报表期限类型, "02", "月报"
    ),
    /**
     * 报表期限类型_季报
     */
    报表期限类型_季报(
        DictCode.报表期限类型, "03", "季报"
    ),
    /**
     * 报表期限类型_半年报
     */
    报表期限类型_半年报(
        DictCode.报表期限类型, "04", "半年报"
    ),
    /**
     * 报表期限类型_年报
     */
    报表期限类型_年报(
        DictCode.报表期限类型, "05", "年报"
    ),
    /**
     * 半年_下半年
     */
    半年_下半年(
        DictCode.半年, "02", "下半年"
    ),
    /**
     * 半年_上半年
     */
    半年_上半年(
        DictCode.半年, "01", "上半年"
    ),
    /**
     * 季度_第一季度
     */
    季度_第一季度(
        DictCode.季度, "01", "第一季度"
    ),
    /**
     * 季度_第二季度
     */
    季度_第二季度(
        DictCode.季度, "02", "第二季度"
    ),
    /**
     * 季度_第三季度
     */
    季度_第三季度(
        DictCode.季度, "03", "第三季度"
    ),
    /**
     * 季度_第四季度
     */
    季度_第四季度(
        DictCode.季度, "04", "第四季度"
    ),
    /**
     * 上期维度_环比
     */
    上期维度_环比(
        DictCode.上期维度, "01", "环比"
    ),
    /**
     * 上期维度_同比
     */
    上期维度_同比(
        DictCode.上期维度, "02", "同比"
    ),
    /**
     * 录入方式_手工录入
     */
    录入方式_手工录入(
        DictCode.录入方式, "01", "手工录入"
    ),
    /**
     * 录入方式_系统导入
     */
    录入方式_系统导入(
        DictCode.录入方式, "02", "系统导入"
    ),
    /**
     * 录入方式_自动生成
     */
    录入方式_自动生成(
        DictCode.录入方式, "03", "自动生成"
    ),
    /**
     * 录入方式_批处理生成
     */
    录入方式_批处理生成(
        DictCode.录入方式, "04", "批处理生成"
    ),
    /**
     * 录入方式_接口导入
     */
    录入方式_接口导入(
        DictCode.录入方式, "05", "接口导入"
    ),
    /**
     * 录入方式_销售平台
     */
    录入方式_销售平台(
        DictCode.录入方式, "06", "销售平台"
    ),
    /**
     * 债券交易费用损益计入方式_计入投资收益
     */
    债券交易费用损益计入方式_计入投资收益(
        DictCode.债券交易费用损益计入方式, "01", "计入投资收益"
    ),
    /**
     * 债券交易费用损益计入方式_计入费用支出
     */
    债券交易费用损益计入方式_计入费用支出(
        DictCode.债券交易费用损益计入方式, "02", "计入费用支出"
    ),
    /**
     * 登记托管机构_中央国债登记结算有限责任公司
     */
    登记托管机构_中央国债登记结算有限责任公司(
        DictCode.登记托管机构, "01", "中央国债登记结算有限责任公司"
    ),
    /**
     * 登记托管机构_上海清算所
     */
    登记托管机构_上海清算所(
        DictCode.登记托管机构, "02", "上海清算所"
    ),
    /**
     * 登记托管机构_中国证券登记结算有限责任公司
     */
    登记托管机构_中国证券登记结算有限责任公司(
        DictCode.登记托管机构, "03", "中国证券登记结算有限责任公司"
    ),
    /**
     * 登记托管机构_理财直融工具
     */
    登记托管机构_理财直融工具(
        DictCode.登记托管机构, "04", "理财直融工具"
    ),
    /**
     * 登记托管机构_私募机构
     */
    登记托管机构_私募机构(
        DictCode.登记托管机构, "05", "私募机构"
    ),
    /**
     * 登记托管机构_其他
     */
    登记托管机构_其他(
        DictCode.登记托管机构, "99", "其他"
    ),
    /**
     * 本金收益特征_保本
     */
    本金收益特征_保本(
        DictCode.本金收益特征, "01", "保本"
    ),
    /**
     * 本金收益特征_非保本
     */
    本金收益特征_非保本(
        DictCode.本金收益特征, "02", "非保本"
    ),
    /**
     * 存款类资产类型_存放同业
     */
    存款类资产类型_存放同业(
        DictCode.存款类资产类型, "01", "存放同业"
    ),
    /**
     * 存款核算分类_拆放境内银行业存款类金融机构
     */
    存款核算分类_拆放境内银行业存款类金融机构(
        DictCode.存款核算分类, "01", "拆放境内银行业存款类金融机构"
    ),
    /**
     * 存款核算分类_拆放境内银行业非存款类金融机构
     */
    存款核算分类_拆放境内银行业非存款类金融机构(
        DictCode.存款核算分类, "02", "拆放境内银行业非存款类金融机构"
    ),
    /**
     * 存款核算分类_拆放境内证券业金融机构
     */
    存款核算分类_拆放境内证券业金融机构(
        DictCode.存款核算分类, "03", "拆放境内证券业金融机构"
    ),
    /**
     * 存款核算分类_拆放境内保险业金融机构
     */
    存款核算分类_拆放境内保险业金融机构(
        DictCode.存款核算分类, "04", "拆放境内保险业金融机构"
    ),
    /**
     * 存款核算分类_拆放境内交易及结算类金融机构
     */
    存款核算分类_拆放境内交易及结算类金融机构(
        DictCode.存款核算分类, "05", "拆放境内交易及结算类金融机构"
    ),
    /**
     * 存款核算分类_拆放境内金融控股公司
     */
    存款核算分类_拆放境内金融控股公司(
        DictCode.存款核算分类, "06", "拆放境内金融控股公司"
    ),
    /**
     * 存款核算分类_拆放境内其他金融机构
     */
    存款核算分类_拆放境内其他金融机构(
        DictCode.存款核算分类, "07", "拆放境内其他金融机构"
    ),
    /**
     * 存款核算分类_拆放境内特殊目的载体_SPV
     */
    存款核算分类_拆放境内特殊目的载体_SPV(
        DictCode.存款核算分类, "08", "拆放境内特殊目的载体（SPV）"
    ),
    /**
     * 存款核算分类_拆放境外存款类金融机构
     */
    存款核算分类_拆放境外存款类金融机构(
        DictCode.存款核算分类, "09", "拆放境外存款类金融机构"
    ),
    /**
     * 存款核算分类_拆放境外其他金融机构
     */
    存款核算分类_拆放境外其他金融机构(
        DictCode.存款核算分类, "10", "拆放境外其他金融机构"
    ),
    /**
     * 频率_日
     */
    频率_日(
        DictCode.频率, "01", "日"
    ),
    /**
     * 频率_周
     */
    频率_周(
        DictCode.频率, "02", "周"
    ),
    /**
     * 频率_月
     */
    频率_月(
        DictCode.频率, "03", "月"
    ),
    /**
     * 频率_季
     */
    频率_季(
        DictCode.频率, "04", "季"
    ),
    /**
     * 频率_年
     */
    频率_年(
        DictCode.频率, "05", "年"
    ),
    /**
     * 频率_半年
     */
    频率_半年(
        DictCode.频率, "06", "半年"
    ),
    /**
     * 频率_到期一次
     */
    频率_到期一次(
        DictCode.频率, "07", "到期一次"
    ),
    /**
     * 频率_不规则
     */
    频率_不规则(
        DictCode.频率, "08", "不规则"
    ),
    /**
     * 推算方式_起息日向后
     */
    推算方式_起息日向后(
        DictCode.推算方式, "01", "起息日向后"
    ),
    /**
     * 推算方式_到期日向前
     */
    推算方式_到期日向前(
        DictCode.推算方式, "02", "到期日向前"
    ),
    /**
     * 推算方式_首次支付日
     */
    推算方式_首次支付日(
        DictCode.推算方式, "03", "首次支付日"
    ),
    /**
     * 含权债摊销日_最近行权日
     */
    含权债摊销日_最近行权日(
        DictCode.含权债摊销日, "01", "最近行权日"
    ),
    /**
     * 本金收益特征_最近赎回行权日
     */
    含权债摊销日_最近赎回行权日(
        DictCode.含权债摊销日, "02", "最近赎回行权日"
    ),
    /**
     * 本金收益特征_最近回售行权日
     */
    含权债摊销日_最近回售行权日(
        DictCode.含权债摊销日, "03", "最近回售行权日"
    ),
    /**
     * 本金收益特征_到期日
     */
    含权债摊销日_到期日(
        DictCode.含权债摊销日, "04", "到期日"
    ),
    /**
     * 行权方式_赎回
     */
    行权方式_赎回(
        DictCode.行权方式, "01", "赎回"
    ),
    /**
     * 行权方式_回售
     */
    行权方式_回售(
        DictCode.行权方式, "02", "回售"
    ),
    /**
     * 交易日历_中国银行间交易日历
     */
    交易日历_中国银行间交易日历(
        DictCode.交易日历, "IB", "中国银行间交易日历  "
    ),
    /**
     * 交易日历_上海交易所日历
     */
    交易日历_上海交易所日历(
        DictCode.交易日历, "SH", "上海交易所日历"
    ),
    /**
     * 交易日历_深圳交易所日历
     */
    交易日历_深圳交易所日历(
        DictCode.交易日历, "SZ", "深圳交易所日历"
    ),
    /**
     * 账务处理_1
     */
    账务处理_1(
        DictCode.账务处理, "1", "账务处理1"
    ),
    /**
     * 账务处理_2
     */
    账务处理_2(
        DictCode.账务处理, "2", "账务处理2"
    ),
    /**
     * 申购确认速度_T+0
     */
    申购确认速度_T加0(
        DictCode.申购确认速度, "01", "T+0"
    ),
    /**
     * 申购确认速度_T+1
     */
    申购确认速度_T加1(
        DictCode.申购确认速度, "02", "T+1"
    ),
    /**
     * 申购确认速度_T+0
     */
    赎回确认速度_T加0(
        DictCode.赎回确认速度, "01", "T+0"
    ),
    /**
     * 申购确认速度_T+1
     */
    赎回确认速度_T加1(
        DictCode.赎回确认速度, "02", "T+1"
    ),
    /**
     * 投资目的获取方式_上游提供
     */
    投资目的获取方式_上游提供(
        DictCode.投资目的获取方式, "01", "上游提供"
    ),
    /**
     * 投资目的获取方式_估值方案生成
     */
    投资目的获取方式_估值方案生成(
        DictCode.投资目的获取方式, "02", "估值方案生成"
    ),
    /**
     * 冲减应计利息方式_按比例冲减
     */
    冲减应计利息方式_按比例冲减(
        DictCode.冲减应计利息方式, "01", "按比例冲减"
    ),
    /**
     * 冲减应计利息方式_按实付利息冲减
     */
    冲减应计利息方式_按实付利息冲减(
        DictCode.冲减应计利息方式, "02", "按实付利息冲减"
    ),
    /**
     * 估值模板_理财产品模板
     */
    估值模板_理财产品模板(
        DictCode.估值模板, "01", "理财产品模板"
    ),
    /**
     * 估值模板_基金模板
     */
    估值模板_基金模板(
        DictCode.估值模板, "02", "基金模板"
    ),
    /**
     * 日期维度_汇总
     */
    日期维度_汇总(
        DictCode.日期维度, "01", "汇总"
    ),
    /**
     * 日期维度_年
     */
    日期维度_年(
        DictCode.日期维度, "02", "年"
    ),
    /**
     * 日期维度_季度
     */
    日期维度_季度(
        DictCode.日期维度, "03", "季度"
    ),
    /**
     * 日期维度_月
     */
    日期维度_月(
        DictCode.日期维度, "04", "月"
    ),
    /**
     * 日期维度_日
     */
    日期维度_日(
        DictCode.日期维度, "05", "日"
    ),
    /**
     * 产品维度_汇总
     */
    产品维度_汇总(
        DictCode.产品维度, "01", "汇总"
    ),
    /**
     * 产品维度_本金标识
     */
    产品维度_本金标识(
        DictCode.产品维度, "02", "本金标识"
    ),
    /**
     * 产品维度_产品
     */
    产品维度_产品(
        DictCode.产品维度, "03", "产品"
    ),

    /**
     * 科目名称_已实现未分配损益
     */
    科目名称_已实现未分配损益(
        DictCode.科目名称, "01", "已实现未分配损益"
    ),
    /**
     * 科目名称_应付客户收益)
     */
    科目名称_应付客户收益(
        DictCode.科目名称, "02", "应付客户收益"
    ),
    /**
     * 科目名称_管理费收入
     */
    科目名称_管理费收入(
        DictCode.科目名称, "03", "管理费收入"
    ),
    /**
     * 科目名称_存放托管行资金
     */
    科目名称_存放托管行资金(
        DictCode.科目名称, "04", "存放托管行资金"
    ),
    /**
     * 科目名称_存放中央款项
     */
    科目名称_存放中央款项(
        DictCode.科目名称, "05", "存放中央款项"
    ),
    /**
     * 业务类别_投资收益分配
     */
    业务类别_投资收益分配(
        DictCode.业务类别, "01", "投资收益分配"
    ),
    /**
     * 业务类别_兑付客户收益
     */
    业务类别_兑付客户收益(
        DictCode.业务类别, "02", "兑付客户收益"
    ),
    /**
     * 业务类别_兑付管理费
     */
    业务类别_兑付管理费(
        DictCode.业务类别, "03", "兑付管理费"
    ),
    /**
     * 维护方式_手工维护
     */
    维护方式_手工维护(
        DictCode.维护方式, "01", "手工维护"
    ),
    /**
     * 维护方式_规则匹配
     */
    维护方式_规则匹配(
        DictCode.维护方式, "02", "规则匹配"
    ),

    /**
     * 税务参数类型_金融商品转让
     */
    税务参数类型_金融商品转让(
        DictCode.税务参数类型, "1", "金融商品转让"
    ),

    /**
     * 税务参数类型_持有期间收益
     */
    税务参数类型_持有期间收益(
        DictCode.税务参数类型, "2", "持有期间收益"
    ),

    /**
     * 税务参数类型_附加税
     */
    税务参数类型_附加税(
        DictCode.税务参数类型, "3", "附加税"
    ),

    /**
     * 数据移植模版类型_头寸模版
     */
    数据移植模版类型_头寸模版(
        DictCode.数据移植模版类型, "01", "头寸模版"
    ),
    /**
     * 数据移植模版类型_增值税模版
     */
    数据移植模版类型_增值税模版(
        DictCode.数据移植模版类型, "02", "增值税模版"
    ),
    /**
     * 数据移植模版类型_账务余额模版
     */
    数据移植模版类型_账务余额模版(
        DictCode.数据移植模版类型, "03", "账务余额模版"
    ),
/*    *//**
     * 数据移植模版类型_账务余额(在途债券)模版
     *//*
    数据移植模版类型_账务余额在途债券模版(
        DictCode.数据移植模版类型, "04", "账务余额(在途债券)模版"
    ),*/
    /**
     * 数据移植模版类型_增值税_90号文模版
     */
    数据移植模版类型_增值税_90号文模版(
        DictCode.数据移植模版类型, "05", "增值税_90号文模版"
    ),
    /**
     * 利率结构_单层结构
     */
    利率结构_单层结构(
        DictCode.利率结构, "01", "单层结构"
    ),
    /**
     * 利率结构_多层结构
     */
    利率结构_多层结构(
        DictCode.利率结构, "02", "多层结构"
    ),

    /**
     * 结算状态_结算成功
     */
    结算状态_结算成功(
        DictCode.结算状态, "01", "结算成功"
    ),
    /**
     * 结算状态_结算失败
     */
    结算状态_结算失败(
        DictCode.结算状态, "02", "结算失败"
    ),
    /**
     * 增值税_发生场景_计提
     */
    增值税_发生场景_计提(
        DictCode.增值税_发生场景, "01", "计提"
    ),
    /**
     * 增值税_发生场景_摊销
     */
    增值税_发生场景_摊销(
        DictCode.增值税_发生场景, "02", "摊销"
    ),
    /**
     * 增值税_发生场景_还本暂存
     */
    增值税_发生场景_还本暂存(
        DictCode.增值税_发生场景, "03", "还本暂存"
    ),
    /**
     * 增值税_发生场景_待抵扣增值额
     */
    增值税_发生场景_待抵扣增值额(
        DictCode.增值税_发生场景, "04", "待抵扣增值额"
    ),
    /**
     * 估值对账配置_区块类型_科目行
     */
    估值对账配置_区块类型_科目行(
        DictCode.估值对账配置_区块类型, "01", "科目行"
    ),
    /**
     * 估值对账配置_区块类型_汇总行
     */
    估值对账配置_区块类型_汇总行(
        DictCode.估值对账配置_区块类型, "02", "汇总行"
    ),
    /**
     * 对比类型_本系统对比对方系统
     */
    对比类型_本系统对比对方系统(
        DictCode.对比类型, "C01", "本系统对比对方系统"
    ),
    /**
     * 对比类型_对方系统对比本系统
     */
    对比类型_对方系统对比本系统(
        DictCode.对比类型, "C02", "对方系统对比本系统"
    ),
    /**
     * 流通市场_一级市场
     */
    流通市场_一级市场(
        DictCode.流通市场, "01", "一级市场"
    ),
    /**
     * 流通市场_二级市场
     */
    流通市场_二级市场(
        DictCode.流通市场, "02", "二级市场"
    ),
    /**
     * 余额类型_计提类余额
     */
    余额类型_计提类余额(
        DictCode.余额类型, "01", "计提类余额"
    ),
    /**
     * 余额类型_摊销类余额
     */
    余额类型_摊销类余额(
        DictCode.余额类型, "02", "摊销类余额"
    ),
    /**
     * 余额类型_还本未收息余额
     */
    余额类型_还本未收息余额(
        DictCode.余额类型, "03", "还本未收息余额"
    ), 待抵扣增值额处理方式_按照数量扣减(
        DictCode.待抵扣增值额处理方式, "01", "按照数量扣减"
    ), 待抵扣增值额处理方式_按照增值额扣减(
        DictCode.待抵扣增值额处理方式, "02", "按照增值额扣减"
    ),
    /**
     * 申报期_第一征期
     */
    申报期_第一征期(
        DictCode.申报期, "01", "第一征期"
    ),
    /**
     * 申报期_第二征期
     */
    申报期_第二征期(
        DictCode.申报期, "02", "第二征期"
    ),
    /**
     * 申报期_第三征期
     */
    申报期_第三征期(
        DictCode.申报期, "03", "第三征期"
        ),
    /**
     * 申报期_第四征期
     */
    申报期_第四征期(
        DictCode.申报期, "04", "第四征期"
        ),
    /**
     * 报表维度_单账套
     */
    报表维度_单账套(
        DictCode.报表维度, "01", "单账套"
    ),
    /**
     * 报表维度_全账套
     */
    报表维度_全账套(
        DictCode.报表维度, "02", "全账套"
        ),
    /**
     * 重算方式_重算
     */
    重算方式_重算(
        DictCode.重算方式, "01", "重算"
        ),
    /**
     * 重算方式_不重算
     */
    重算方式_不重算(
        DictCode.重算方式, "02", "不重算"
            ),
    /**
     * 重算方式_指定实际利率
     */
    重算方式_指定实际利率(
        DictCode.重算方式, "03", "指定实际利率"
            ),
    
    /**
     * 数据移植转换模板类型_产品余额报表
     */
    数据移植转换模板类型_产品余额报表(
        DictCode.数据移植转换模板类型, "01", "产品余额报表"
    ),
    
    /**
     * 数据移植转换模板类型_资产余额报表
     */
    数据移植转换模板类型_资产余额报表(
        DictCode.数据移植转换模板类型, "02", "资产余额报表"
    ),
    
    /**
     * 估值表模板_理财产品模板
     */
    估值表模板_理财产品模板(
        DictCode.估值表模板, "01", "理财产品模板（系统推荐）"
        ),
    /**
     * 估值表模板_基金模板
     */
    估值表模板_基金模板(
        DictCode.估值表模板, "02", "基金模板（按货基和非货基模板)"
        ),
    批处理账套类型_账套组(
        	DictCode.批处理账套类型, "0", "账套组"
        ),
    批处理账套类型_账套(
        	DictCode.批处理账套类型, "1", "账套"
        ),
    /**
    * 应收款项类别_其他应收款_利息
    */
   应收款项类别_其他应收款_利息(
   		DictCode.应收款项类别, "QTYSK_LX", "其他应收款-利息"
   		),
   /**
    * 应收款项类别_其他应收款_本金
    */
   应收款项类别_其他应收款_本金(
   		DictCode.应收款项类别, "QTYSK_BJ", "其他应收款-本金"
   		),
    /**
     * 排序类型_升序
     */
    排序类型_升序(DictCode.排序类型, "ASC", "排序类型_升序"),
    /**
     * 排序类型_降序
     */
    排序类型_降序(DictCode.排序类型, "DESC", "排序类型_降序"),
    ;

    /**
     * 对应于数据字典code
     */
    private String value;

    /**
     * 数据字典枚举
     */
    private DictCode dictCode;

    /**
     * 明细名称
     */
    private String codeName;

    DictCodeList(DictCode dictCode, String value, String codeName) {
        this.dictCode = dictCode;
        this.value = value;
        this.setCodeName(codeName);
    }

    /**
     * 获得数据字典详细类
     *
     * @param value 数据字典值
     * @param dictCode 数据字典DictCode
     * @return DictCodeList
     * @see
     * @since 1.0
     */
    public static DictCodeList from(DictCode dictCode, String value) {
        DictCodeList[] values = DictCodeList.values();
        for (DictCodeList code : values) {
            if (StringUtil.equals(value, code.getValue()) && code.getDictCode() == dictCode) {
                return code;
            }
        }
        return null;
    }

    /**
     * 获取数据字典明细List
     *
     * @param dictCode DictCode
     * @return List&lt;SelectOptionDto&gt;
     * @see
     * @since 1.0
     */
    public static List<SelectOptionDto> fromDictCode(DictCode dictCode) {
        List<SelectOptionDto> result = new ArrayList<>();
        DictCodeList[] values = DictCodeList.values();
        for (DictCodeList code : values) {
            if (code.getDictCode() == dictCode) {
                SelectOptionDto option = new SelectOptionDto();
                option.setId(code.getValue());
                option.setText(code.getCodeName());
                result.add(option);
            }
        }
        return result;
    }

    /**
     * 获取数据字典明细valueList
     *
     * @param dictCode DictCode
     * @return List&lt;SelectOptionDto&gt;
     * @see
     * @since 1.0
     */
    public static List<String> valuesfromDictCode(DictCode dictCode) {
        List<String> result = new ArrayList<>();
        DictCodeList[] values = DictCodeList.values();
        for (DictCodeList code : values) {
            if (code.getDictCode() == dictCode) {
                result.add(code.getValue());
            }
        }
        return result;
    }

    /**
     * 获取 DictCode
     *
     * @return value.
     */
    @Override
    public DictCode getDictCode() {
        return dictCode;
    }

    /**
     * 获取 value
     *
     * @return value.
     */
    @Override
    public String getValue() {
        return value;
    }

    /**
     * 设置 value
     *
     * @param value value
     */
    @Override
    public void setValue(String value) {
        this.value = value;
    }

    /**
     * 获取 codeName
     *
     * @return codeName.
     */
    @Override
    public String getCodeName() {
        return codeName;
    }

    /**
     * 获取 带有引号的名称
     *
     * @return 带有引号的名称.
     */
    public String getQuotesCodeName() {
        return "“" + codeName + "”";
    }

    /**
     * 获取Integer value
     *
     * @return Integer value
     */
    public Integer getIntegerCodeName() {
        Integer result = null;
        try {
            result = Integer.parseInt(codeName);
        }
        catch (Exception e) {
        }
        return result;
    }

    /**
     * 获取Integer value
     *
     * @return Integer value
     */
    public BigDecimal getBigDecimalCodeName() {
        BigDecimal result = null;
        try {
            result = new BigDecimal(codeName);
        }
        catch (Exception e) {
        }
        return result;
    }

    /**
     * 设置 codeName
     *
     * @param codeName codeName
     */
    @Override
    public void setCodeName(String codeName) {
        this.codeName = codeName;
    }
}
